{
    "optim": "1\nGenerative AI for Secure Physical Layer\nCommunications: A Survey\nChangyuan Zhao, Hongyang Du, Dusit Niyato, Fellow, IEEE, Jiawen Kang, Zehui Xiong, Dong In Kim, Fellow,\nIEEE, Xuemin (Sherman) Shen, Fellow, IEEE, and Khaled B. Letaief, Fellow, IEEE\nAbstract—Generative Artificial Intelligence (GAI) stands at the\nforefront of AI innovation, demonstrating rapid advancement and\nunparalleled proficiency in generating diverse content. Beyond\ncontent creation, GAI has significant analytical abilities to learn\ncomplex data distribution, offering numerous opportunities to\nresolve security issues. In the realm of security from physical\nlayer perspectives, traditional AI approaches frequently struggle,\nprimarily due to their limited capacity to dynamically adjust to\nthe evolving physical attributes of transmission channels and the\ncomplexity of contemporary cyber threats. This adaptability and\nanalytical depth are precisely where GAI excels. Therefore, in this\npaper, we offer an extensive survey on the various applications\nof GAI in enhancing security within the physical layer of\ncommunication networks. We first emphasize the importance\nof advanced GAI models in this area, including Generative\nAdversarial Networks (GANs), Autoencoders (AEs), Variational\nAutoencoders (VAEs), and Diffusion Models (DMs). We delve\ninto the roles of GAI in addressing challenges of physical layer\nsecurity, focusing on communication confidentiality, authentica-\ntion, availability, resilience, and integrity. Furthermore, we also\npresent future research directions focusing model improvements,\nmulti-scenario deployment, resource-efficient optimization, and\nsecure semantic communication, highlighting the multifaceted\npotential of GAI to address emerging challenges in secure\nphysical layer communications and sensing.\nIndex Terms—Generative AI, physical layer communications,\nphysical layer security, wireless sensor network, anomaly detec-\ntion.\nI. INTRODUCTION\nGenerative Artificial Intelligence (GAI) represents a trans-\nformative category of Artificial Intelligence (AI) technologies\ncapable of creating content, ranging from text, images, music,\nto complex simulations [1]. As a kind of unsupervised learn-\ning, GAI is trained on vast amounts of data to understand\nthe underlying structure and dynamics of that data. Unlike\ntraditional AI, which primarily focuses on analyzing and\nC. Zhao, H. Du, and D. Niyato are with the School of Computer Sci-\nence and Engineering, Nanyang Technological University, Singapore (e-mail:\nzhao0441@e.ntu.edu.sg; hongyang001@e.ntu.edu.sg; dniyato@ntu.edu.sg).\nJ. Kang is with the School of Automation, Guangdong University of\nTechnology, China. (e-mail: kavinkang@gdut.edu.cn).\nZ. Xiong is with the Pillar of Information Systems Technology and Design,\nSingapore University of Technology and Design, Singapore (e-mail: zehui\nxiong@sutd.edu.sg).\nD.\nI.\nKim\nis\nwith\nthe\nDepartment\nof\nElectrical\nand\nComputer\nEngineering,\nSungkyunkwan\nUniversity,\nSuwon\n16419,\nSouth\nKorea\n(email:dikim@skku.ac.kr).\nX. Shen is with the Department of Electrical and Computer Engineering,\nUniversity of Waterloo, Canada (e-mail: sshen@uwaterloo.ca).\nKhaled B. Letaief is with the Department of Electrical and Computer\nEngineering, Hong Kong University of Science and Technology, Hong Kong\n(e-mail: eekhaled@ust.hk).\ninterpreting data, GAI takes a step further by generating new,\noriginal outputs based on learned patterns and datasets [2].\nOnce trained, these models can produce outputs that mimic\nthe original data’s style, tone, and complexity, often indistin-\nguishable from content produced by humans [3]. Reflecting on\nits inherent capabilities, GAI has been successfully deployed\nin a wide range of mature applications across different fields,\nincluding Stable Diffusion [4], DALL-E 3 [5], and ChatGPT\n[6], etc. Beyond its prowess in generating varied content forms,\nGAI also demonstrates powerful capabilities in enhancing cy-\nbersecurity measures, by generating sophisticated simulations\nand datasets for threat detection and system strengthening [7].\nThe innovative essence and wide-ranging applicability of GAI\nhave captivated the research community, leading to an upsurge\nin interest to uncover its capabilities in addressing intricate\nchallenges and driving innovation across various fields.\nIn wireless communications, security is a critical aspect of\nmodern information technology, ensuring the confidentiality,\nintegrity, and availability of data transmitted across networks\n[8]. Techniques such as encryption, secure socket layers, and\ndigital signatures are employed to protect sensitive information\nduring its transmission over the internet or other communica-\ntion networks [9]. In the Open Systems Interconnection model\nof communications [10], physical layer security plays a pivotal\nrole in protecting communication networks by utilizing the\ninherent physical characteristics of the communication channel\nto thwart unauthorized access and guarantee data integrity\n[11]. This fundamental security layer capitalizes on the inher-\nent unpredictability of channel properties, serving to enhance\nconventional encryption techniques by adding an extra layer\nof defense against eavesdropping and cyber-attacks. Given\nits critical significance, researchers have dedicated extensive\nefforts to conduct in-depth studies on physical layer security\n[12].\nWith the advancement of AI, the integration of Deep\nLearning (DL) methods has revolutionized communication\nsecurity, offering enhanced capabilities for anomaly detection,\nautomatic threat identification, and adaptive security measures\nbased on real-time data analysis [13]. For instance, Convo-\nlutional Neural Networks (CNNs) are employed to design\nphysical layer security techniques such as in the development\nof an intrusion detection system [14], multi-user authentication\n[15]. In addition, Recurrent Neural Networks (RNNs) have\nfound utility in various studies including automatic modulation\nclassification [16], secure channel coding [17], and intrusion\ndetection [18].\nHowever, traditional AI methods often fall short in address-\narXiv:2402.13553v1  [cs.CR]  21 Feb 2024\n2\nGenerative AI for Secure Physical Layer Communications and Sensing\nIntroduction\nRelated Surveys\nGAI for Communication Networks [21], [22], etc;\nAI for Secure Communication [23], [24], etc.\nBackground Knowledge\nSecurity Issues\nin Physical Layer\nConfidentiality, Authentication, Availability,\nResilience and Integrity\nOverview of GAI\nAEs and VAEs [25]; GANs [26]; DMs [27].\nCommunication Confidentiality\nand Authentication\nSecure Communication\nEncryption: GAN [28], SVAE [29], etc.\nAnti-eavesdropping: VQ-VAE [30], WGAN-GP [31], etc.\nCommunication Authentication\nRF Fingerprinting: GAN [32], Triple-GAN [33], etc.\nCSI: CGAN [34], etc. CIR: VAE-PLA [35], etc.\nCommunication Availability\nand Resilience\nAnti-jamming Strategy\nJamming Recognition: GAN [36], AC-VAEGAN [37], etc.\nAnti-jamming: GAN [38], ADRLDN [39], etc.\nSpoofing Defense\nGAN [40], CBEGAN [41], SJG-GAN [42], etc.\nCommunication Integrity\nAnomaly Detection\nScore-based: SAIFE [43] , β-VAE [44], etc.\nPrediction-based: E-GAN [45], CGAN [46], etc.\nData Reconstruction\nSARGAN [47], VAE-GAN [48], CDDM [49], etc.\nFuture Research Direction\nConclusion\nFig. 1.\nThe structure of the survey paper, where we introduce GAI methods for physical layer security through Communication Confidentiality and\nAuthentication (Section III), Communication Availability and Resilience (Section IV), and Communication Integrity (Section V).\ning physical layer security challenges due to their inability\nto dynamically adapt to the continuously changing physical\ncharacteristics of transmission channels and the sophisticated\nnature of modern cyber threats [19]. Specifically, traditional\nAI models are typically trained on datasets from specific\nenvironments, limiting their effectiveness when deployed in\nunfamiliar conditions. Furthermore, the complexity and vari-\nability of noise patterns, signal interference, and channel\nconditions within the physical layer lead to difficulties in\ncollecting sufficient labeled data for physical layer attacks.\nThis challenge necessitates the development of sophisticated\nAI models capable of learning from and adapting to these\never-changing environmental factors, thereby ensuring the\ncontinuous maintenance of robust security measures [20].\nConfronted with the critical challenges in secure physical\nlayer communications, and recognizing the distinct advantages\nprovided by GAI, this paper provides a thorough survey of\nGAI’s applications in tackling various issues in physical layer\nsecurity.\nA. Related Surveys and Contribution\n1) GAI for Communication Networks: Recent literature\nhas witnessed a notable increase in the exploration of GAI\napplications within communication networks (Table I). The\nwork [21] delves into the utilization of GAI to address con-\ntemporary challenges in mobile telecommunications networks.\nThis article underscores the pivotal role of generative AI in\nthe advancement of mobile network technologies, particularly\nin the overcoming of existing obstacles. [50] shifts the focus\nto the deployment of Artificial Intelligence Generated Con-\ntent (AIGC) in mobile networks, providing comprehensive\ninsights into Generative AI and mobile edge intelligence.\nAdditionally, [51] investigates the interplay between GAI and\nSemantic Communication (SemCom) in wireless networks.\nTheir research demonstrates the utility of GAI in the creation,\ntransmission, and efficient management of information within\nthese networks. Moreover, the authors in [22] present an\nanalysis of GAI applications in the physical layer, addressing\nvarious applications but the security issues are not the main\nfocus.\n2) AI for Secure Communication:\nAI has significantly\ntransformed the landscape of communication network security\nand privacy. In [52], a systematic overview is presented on\nprospective technologies for 6G networks, focusing on the\nphysical, connection, and service layers, along with lessons\nlearned from existing security architectures. The authors in\n[23] discuss the contribution of AI to Internet of Things\n(IoTs) security within Edge Computing (EC) environments,\nparticularly emphasizing AI’s role in augmenting security\nfeatures. Regarding attack detection, [53] provides a detailed\nsurvey on AI-based intrusion detection systems, with a focus\non securing communication within the IoT. Similarly, [54]\ndelves into machine learning applications, with a specific\nemphasis on cyber threat detection in IoT environments. For\nPhysical-Layer Security, the utilization of AI in optimizing\nand designing intelligent physical layer security techniques\nis thoroughly explored in [56]. [55] introduces intelligent\n3\nTABLE I\nSUMMARY OF RELATED SURVEYS\nScope\nReference\nEmphasis\nOverview\nGAI for\nCommunication\nNetworks\n[21]\nGAI in mobile networks\nA survey of the recent work in the field of GAI with application to mobile telecommunications\nnetworks\n[50]\nEdge-Cloud GAI\nAn overview of research activities related to AIGC, GAI, and mobile edge intelligence\n[51]\nGAI-driven SemCom\nA summary on the interplay between GAI and SemCom in wireless communication networks\n[22]\nGAI for Physical Layer\nCommunications\nA survey of GAI’s applications to address diverse problems in physical layer communications\nAI for Secure\nCommunication\n[23]\nAI for IoT security\nA summary of the contribution of AI to the IoT security in Edge computing\n[52]\nAI for Security and\nPrivacy of 6G\nA overview of security and privacy issues based on prospective technologies for 6G in the physical,\nconnection, and service layers\n[53]\nAI-based Intrusion\nDetection System\nA survey on machine learning-based intrusion detection systems for secure communication in IoTs\n[54]\nAI in IoT Security\nA overview of applying machine learning for cyber threat detection in IoT environments\n[55]\nAI-based Physical Layer\nSecurity\nA summary on intelligent wireless physical layer security by concentration on physical layer\nauthentication, antenna selection, and relay node selection\n[56]\nAI-assisted Secure Data\nTransmission\nAn in-depth analysis of the role of AI in optimizing and designing the intelligent physical layer\nsecurity techniques\n[24]\nAI-based Physical Layer\nSecurity\nA survey about employing DL-based physical layer security techniques for solving various security\nconcerns in 5G and beyond networks\nwireless physical layer security by concentrating on physical\nlayer authentication, antenna selection, and relay node selec-\ntion. In a related vein, [24] investigates DL based physical\nlayer security techniques, concentrating on their application\nin addressing various security concerns in 5G and beyond\nnetworks. However, it is noted that there is a lack of detailed\nanalysis regarding the role of GAI in physical layer security.\nDistinct from existing surveys and tutorials, our survey\ndistinguishes itself by specifically focusing on the integration\nof GAI in secure physical layer for communication networks.\nUnlike previous works, which either broadly address GAI\napplications in communication networks or delve into AI’s\nrole in network security without a concentrated emphasis on\nGAI, this survey offers a unique perspective by marrying the\ncapabilities of GAI with the requirements of physical layer\nsecurity. It fills a critical gap in the literature by providing an\nin-depth analysis of how GAI can enhance security measures,\ndetect and mitigate threats in the physical layer that have been\npreviously underexplored or only briefly mentioned.\nThe key contributions of this paper are summarized as\nfollows:\n• Our comprehensive analysis reveals how to employ GAI\nmodels to enhance key security properties such as com-\nmunication confidentiality, authentication, availability, re-\nsilience, and integrity. These advancements are facilitated\nby GAI’s ability to understand complex data distributions,\nperform encrypted data transformation and processing,\nand detect cyber threats and anomalies within the network\ninfrastructure. This summary provides essential insights\nfor further exploration and development of GAI applica-\ntions in physical layer security.\n• We explore how GAI addresses the challenges of data\nsparsity and incompleteness in physical layer security,\nwhich significantly impact the efficacy of traditional AI\nmodels. GAI’s contribution to data reconstruction and\naugmentation showcases its unparalleled ability to en-\nhance physical layer security, surpassing the limitations\nof tranditional AI approaches.\n• We outline crucial future research directions for the\napplications of GAI in physical layer security, includ-\ning model improvements, multi-scenario deployment,\nresource-efficient optimization and secure semantic com-\nmunication. These directions are considered from multi-\nple perspectives, underscoring the multifaceted potential\nof GAI to address emerging challenges.\nThe structure of this survey is outlined in Fig. 1. Section II\nintroduces the fundamental concepts of GAI and offer a review\nof related works. In section III, a comprehensive exploration\ninto Communication Confidentiality and Authentication is\npresented. Section IV discusses approaches for Communica-\ntion Availability and Resilience. Section V introduces GAI\nmethods for Communication Integrity. Section VI discusses\nfuture research directions, and Section VII concludes the\npaper. Additionally, Table II lists the abbreviations commonly\nemployed throughout this survey.\nII. BACKGROUND KNOWLEDGE\nIn this section, we delve into the security challenges inherent\nto the physical layer of communication networks, arguing that\naddressing security at this foundational level is of paramount\nimportance. Furthermore, we introduce the fundamental con-\ncepts of GAI, including its architecture, classification, and\nbasic models.\nA. Security Issues in Physical Layer\nSecurity at the physical layer is deemed paramount com-\npared to other layers since it provides the foundation for all\nsubsequent security protocols [57]. Therefore, a breach at this\nfoundational level will jeopardize the entire communication\nsystem. This layer is susceptible to a broad spectrum of phys-\nical threats, including eavesdropping, jamming, and spoofing,\nmaking it a critical point of vulnerability that must be robustly\nprotected [58]. By securing the physical layer, potential attacks\n4\nTABLE II\nLIST OF ABBREVIATIONS\nAbbreviation\nDescription\nAbbreviation\nDescription\nAI\nArtificial Intelligence\nGAI\nGenerative Artificial Intelligence\nCNN\nConvolutional Neural Network\nRNN\nRecurrent Neural Networks\nAIGC\nArtificial Intelligence Generated Content\nDL\nDeep Learning\nDAI\nDiscriminative AI\nAE\nAutoencoder\nVAE\nVariational Autoencoder\nGAN\nGenerative Adversarial Network\nDM\nDiffusion Models\nDRL\nDeep Reinforcement Learning\nWGAN-GP\nWasserstein GAN with Gradient Penalty\nCGAN\nConditional GAN\nACGAN\nAuxiliary Classifier GAN\nAAE\nAdversarial Autoencoder\nSNR\nSignal-to-Noise Ratio\nJNR\nJamming-to-Noise Ratio\nPCA\nPrincipal Component Analysis\nMIMO\nMulti-Input Multi-Output\nCIR\nChannel Impulse Response\nCSI\nChannel State Information\nRF\nRadio Frequency\nLSTM\nLong Short-Term Memory\nSU\nSecondary User\nPU\nPrimary User\nSemCom\nSemantic Communication\nIoT\nInternet of Things\nEC\nEdge Computing\nEH\nEnergy Harvesting\nJSCC\nJoint Source Channel Coding\nBER\nBit Error Rate\nAWGN\nAdditive White Gaussian Noise\nBLER\nBlock Error Rate\nTABLE III\nTHE USE OF GAI IN THE PHYSICAL LAYER AND ITS POTENTIAL SUPPORT FOR SECURITY\nIssues\nModel\nGANs\nAEs and VAEs\nDMs\nCommunication & Sensing Perspectives\nConfidentiality\n● key generation\n● channel response approximations\n● anti-eavesdropping communications\n● wiretap code design\n● transceiver design\n● VAE-based JSCC\n-\nPotential benefits for communication:\n✓ Robustness to the changing environment\n✓ Simulate noise channel effects\n✓ Utilize time-varying information\n✓ Extract valuable features various data\nAvailability\n● jamming recognition\n● anti-jamming strategy\n-\n-\nResilience\n● spoofing recognition\n● spoofing defense\n-\n-\nIntegrity\n● sensors anomaly detection\n● signals anomaly detection\n● radio anomaly detection\n● spectral information completion\n● electromagnetic data reconstruction\n● spectrum anomaly detec-\ntion\n● sensors anomaly detection\n● DSSS signals reconstruc-\ntion\n● noise elimination\nPotential benefits for sensing:\n✓ Identify abnormal sensors\n✓ Not affected by data imblance\n✓ Avoid complex parametric analysis of\nthe signals\n✓ Not require any information\nof the missing band locations\nAuthentication\n● RF fingerprinting authentication\n● CSI authentication\n● CIR authentication\n-\ncan be preemptively thwarted, thereby preventing attackers’\ninitial access points for further intrusions.\nThe subsequent discussion will introduce the CIA triad\n[59]: Confidentiality, Integrity, and Availability, alongside two\nadditional critical focuses: Resilience and Authentication in\nphysical layer security.\n• Communication Confidentiality: Communication con-\nfidentiality in the physical layer involves the use of\ntechniques and mechanisms to secure data transmission\nover communication channels, preventing unauthorized\naccess and eavesdropping. This approach leverages the\nproperties of the physical layer, such as noise and signal\ncharacteristics, to enhance security by making it difficult\nfor attackers to intercept or decode the transmitted infor-\nmation [60].\n• Communication Authentication: Communication au-\nthentication at the physical layer is a critical security\nmeasure that verifies the identities of entities engaged in\ndata exchange to thwart impersonation and unauthorized\naccess. This verification leverages unique attributes intrin-\nsic to the transmission’s physical medium, such as radio-\nfrequency fingerprints or specific channel properties. By\nauthenticating that the communication is genuine and\nemanates from a verified source, this process significantly\nbolsters security and integrity in the exchange of data\n[61].\n• Communication Availability: Ensuring communication\navailability at the physical layer, particularly through\nanti-jamming measures, involves deploying strategies and\nmechanisms to protect wireless communication networks\nfrom deliberate interference or jamming attacks. Tech-\nniques such as frequency hopping and direct sequence\nspread spectrum are pivotal, as they disperse the signal\nacross a broader bandwidth, complicating the attacker’s\nability to disrupt communications [12].\n• Communication Resilience: Communication resilience\nat the physical layer, particularly in safeguarding against\na range of attacks, where spoofing attacks being a typical\nexample, necessitates the implementation of strategies\naimed at detecting and neutralizing attacks signals. Cen-\ntral to this defensive approach is the use of unique\nphysical features or signatures, such as Radio Frequency\n(RF) fingerprints or channel state information. By ex-\nploiting these intrinsic properties, networks are equipped\nto distinguish authentic signals from those fabricated by\nspoofers, significantly maintaining secure and reliable\ncommunications [62].\n• Communication Integrity: To safeguard communication\n5\nintegrity at the physical layer, it is essential to detect\nanomalous data and complete missing information [63].\nTechniques such as DL algorithms are employed to learn\nnormal behavior patterns and subsequently identify out-\nliers or irregularities in real-time data flows. Furthermore,\ndata reconstruction techniques are applied to correct or\nmitigate the impact of these anomalies and incomplete\ndata, guaranteeing the precise and dependable transmis-\nsion of information [64].\nB. Overview of GAI\nGAI aims to learn the underlying features of input data to\ngenerate new content that is similar to real data, in contrast\nto Discriminative AI (DAI), which focuses on predicting the\nprobability or labels of data. GAI is capable of generating\na wide variety of data, including text, images, videos, and\nso on [1]. Usually, these generated outputs are refereed as\nAIGC. With the widespread adoption of AIGC, there has been\na significant boost in the efficiency of content creation, even\nrevolutionizing the production paradigms of several companies\nand individual creators.\nCurrently, GAI models used in commnication networks can\nbe categorized as follows:\n• Autoencoder (AEs) and Variational Autoencoders\n(VAEs): An Autoencoder is a type of artificial neural\nnetwork used to learn efficient codings of unlabeled data\nin an unsupervised manner [25]. It works by compress-\ning the input into a lower-dimensional code and then\nreconstructing the output from this representation as close\nas possible to the original input. By shifting from a\ndeterministic encoding process to a probabilistic one,\nVAEs can learn to represent input data as a distribution\nin latent space [65]. Through latent distributions, VAEs\ngenerate new instances that resemble the input data by\nsampling from the learned distribution in the latent space,\nmaking them highly effective in tasks including image\ngeneration, data augmentation, and anomaly detection\n[66]. Building upon the foundational principles of VAEs,\nmore advanced variants such as the Vector Quantized-\nVariational Autoencoder (VQ-VAE) have been devel-\noped, which incorporates a discrete latent representation\nthrough vector quantization to improve the generation\nquality [67]. In summary, AEs and VAEs offer signif-\nicant benefits, including their ability to learn complex\ndistributions and generate new data points. However, they\nhave limitations such as the tendency to produce blurry\noutputs, and challenges in balancing the reconstruction\nfidelity and the latent space regularization during training\n[3].\n• Generative Adversarial Networks (GANs): Generative\nAdversarial Network model is a form of unsupervised\nlearning [26]. Within a GAN, the generator network is re-\nsponsible for creating data, and concurrently, the discrim-\ninator network assesses the authenticity of this generated\ndata. Using an adversarial mechanism, the discriminator\nis trained to discern between real and fake data, while the\ngenerator aims to produce data that is indiscernible from\nreal data. GANs have evolved into diverse variants, each\nenhancing the original concept for specific purposes. The\nConditional GAN (CGAN) introduces conditionality to\ndirect the generative process with greater precision [68].\nIn parallel, the Wasserstein GAN with Gradient Penalty\n(WGAN-GP) marks a significant stride in stabilizing the\ntraining process, adeptly countering the prevalent issue\nof mode collapse with its innovative loss function [69].\nThe Auxiliary Classifier GAN (ACGAN) ingeniously\nintegrates an auxiliary classifier into the discriminator,\nthereby elevating the fidelity and diversity of the gener-\nated images [70]. The Adversarial Autoencoder (AAE)\nforges a pathway by blending AEs with adversarial train-\ning, enforcing specialized distributions within the latent\nspace [71]. The Variational Auto-Encoding Generative\nAdversarial Network (VAEGAN) synergizes the struc-\ntured latent spaces of VAEs with the superior generation\ncapabilities of GANs [72]. Collectively, GANs excel in\ngenerating high-quality, realistic content and learning data\ndistributions without explicit modeling. However, they\nare challenged by training difficulties, potential for mode\ncollapse, and the generation of nonsensical outputs.\n• Diffusion Models (DMs): Diffusion Model, also known\nas the score-based generative model, is a novel type\nof generative model inspired by non-equilibrium ther-\nmodynamics [27]. Similarly to VAE, DMs aim to learn\nthe distribution of the original data. By adding noise to\nthe original data, the data distribution can approach a\nnormal distribution. Through denoising steps, the noise\nfrom the normal distribution is reverted back to data\nfrom the original distribution.\nDiffusion models are\nproficient in generating highly realistic data, but their\nlong training times and computational intensity highlight\nthe potential for further efficiency improvements in this\nemerging method [73].\nGiven the powerful generative capabilities, GAI has been\ndeployed in a multitude of applications, including image\nand video synthesis, data augmentation and so on. More\nrecently, the integration of GAI into physical layer security in\nwireless communications is a burgeoning field with promising\npotential. To be more specific, GAI can play several roles in\nenhancing security at the physical layer: 1) Encrypted Com-\nmunication; 2) Signals Authentication; 3) Attacks Defense; 4)\nAnomaly Detection; 5) Adaptive Signal Processing (Table III).\nIII. COMMUNICATION CONFIDENTIALITY AND\nAUTHENTICATION\nIn wireless communications, the principles of confidentiality\nand authentication stand as critical pillars ensuring the security\nand integrity of transmitted information [63]. However, cyber\nthreats, such as eavesdropping and unauthenticated attacks in\nphysical layer, significantly compromise communication secu-\nrity, leading to unauthorized access and information breaches\n[74]. This section provides an overview of employing GAI\ntechniques to ensure communication confidentiality and au-\nthenticity.\n6\nTABLE IV\nSUMMARY OF GAI FOR SECURE COMMUNICATION IN PHYSICAL LAYER\nBLUE CIRCLES DESCRIBE THE METHODS; GREEN CORRECT MARKERS AND RED CROSS MARKERS REPRESENT PROS AND CONS RESPECTIVELY.\nTechniques\nReference\nAlgorithm\nPros & Cons\nEncrypted\nCommunication\n[75]\nAE\n● A flexible wiretap code design for Gaussian wiretap channels under finite blocklength by neural network AEs\n✓ Flexibility to trade-off between the BLER and leakage.\n✓ Achieve decent performance with simple network structures.\n✗ Slightly worse performance than the polar wiretap codes.\n✗ Trained with fixed SNR.\n[28]\nGAN\n● The GAN architecture to learn non-linearities, memory effects, and non-Gaussian statistics.\n✓ Approximate the channel response under different conditions.\n✗ Based on a specific distribution dataset.\n[29]\nSVAE\n● A DL-based transceiver design for secrecy systems\n✓ Novel loss to measure the information leakage\n✓ Robustness to the changing environment\n✓ Trained in an unsupervised fashion without labeling effort\n✗ Limited scalability of the code.\n✗ Learning high-dimensional codes is computationally challenging.\nAnti-eavesdropping\n[76]\nVAE\n● A data-driven approach using VAE-based JSCC\n✓ A joint source channel coding framework\n✓ Hide the sensitive information different from the original signal\n✗ The eavesdropper’s channel quality is assumed to be significantly worse.\n[30]\nVQ-VAE\n● A JSCC scheme based on VQ-VAE for point-to-point wireless communication\n✓ Simulate noise channel effects\n✓ Learn joint codewords incorporating the characteristics of the message channel\n✗ Highly dependent on training set\n[77]\nGAN\n● A GAN inspired approach using DSSS to ensure that a transmitter and receiver can communicate safe\n✓ Use low Peak Side Lobe to improve model convergence\n✓ Use of multiple spreading codes instead of one shared code\n✗ Relatively high reconstruction accuracy of eavesdroppers\n[31]\nWGAN-GP\n● A physical layer key generation method based on WGAN-GP AAE\n✓ Overcome the difficulty of quantifying the extracted features\n✓ Reduce the quantization complexity\n✗ The key randomness is related to the interpretability of neural network.\nA. Secure Communication\nEavesdropping is a typical attack in physical layer which\ninvolves intercepting and accessing confidential information\ntransmitted over networks [78]. To improve confidentiality and\nachieve anti-eavesdropping, secure data is usually encrypted\nthrough various encryption algorithms [79]. However, once\nthe math problem used for encryption is solved effective, the\nsecurity of the encryption method will be seriously compro-\nmised. Moreover, several transitional methods including Error-\nCorrecting Codes (ECCs) [80] suffer from a dilemma that they\ncannot achieve the trade-off between the reliability and data\nleakage because of the fixed code parameters. GAI methods,\nparticularly those employing AEs or VAEs, offer enhanced\nsecurity via generating complex structures that are difficult to\ndecipher or reverse-engineer.\nAEs, characterized by its encoder and decoder components,\nenable the efficient encoding of information into a compressed,\nless interpretable format for transmission. Based on this, the\nauthors proposed a AE-based framework in [75], which allows\na flexible design of finite blocklength wiretap codes (Fig. 2).\nThe operating point with respect to the trade-off between\nBlock Error Rate (BLER) and information leakage can be\nchanged easily due to the higher flexibility. In the scenario\nwith Additive White Gaussian Noise (AWGN) channels as\nnoise [75], all tested AEs perform slightly worse than the polar\nwiretap code [81]. The proposed framework achieve a BLER\nof around 26.2% and a leakage around 1.46bits while the polar\nwiretap code achieves a leakage around 1.33bits at a similar\nBLER of around 26.4% [75]. Even though the performance is\nTransmitter\nA. Wiretap System\nReceiver\nEavesdropper\nAWGN\nEncoder\nDecoder\nAWGN\nB. AE-Based Secure Transceiver\nC. VAE-Based Secure Transceiver\nMessages\n 𝑀\nRandom Bit\n෡𝑀\nEncoder\nLeakage\nEstimation\nAWGN\nDecoder\n𝑀′\n𝑍\nMSE(𝑀′, 𝑀)\nMI(𝑀, 𝑍)\nUpdate\nDecoder\nMessages\n 𝑀\nRandom Bit\n෡𝑀\nEncoder\nLeakage\nEstimation\n𝑀′\n𝑍\nMSE(𝑀′, 𝑀)\nMI(𝑀, 𝑍)\nUpdate\nAWGN\nKL\nDivergence\nFig. 2. The overall architecture of the AE-Based [75] and VAE-Based secure\ntransceiver [29]. Part A demonstrates a wiretap system model with AWGN.\nPart B illustrates the whole framework of AE-Based secure transceiver, which\nis trained by two loss functions: the mean-squared error between transmitter\nmessages and reconstructed messages and the mutual information between\nthe messages and the received symbols by the eavesdropper. In Part C, the\nVAE-Based secure transceiver adds additional loss function: KL divergence.\n7\nnot better than the polar wiretap code, the proposed framework\ncan take the advantage of the flexibility to trade-off between\nthe BLER and leakage, and may improve performance with\ndeeper neural networks.\nTo train a secure communication system based on AEs, loss\ngradients need to be passed backward from the output layer\nof the receiver to the input layer of the transmitter. However,\na practical challenge arises due to the unknown gradients of\nthe physical channel. This issue is often circumvented by\nassuming channel models with known analytic expressions,\nsuch as AWGN and Rayleigh fading channels [82]. However,\nthese models may not accurately reflect real-world channel\nconditions. To overcome this limitation, the authors in [28]\nproposed a communication channel density estimating GAN,\ninspired by BicycleGAN [83]. The proposed method focuses\non channels characterized by a combination of non-linear\namplifier distortion, pulse shape filtering, inter-symbol inter-\nference, frequency-dependent group delay, multipath, and non-\nGaussian statistics. They conducted a comparative analysis of\nthe marginalized probability density functions of the channel\nwith a trained generator. Through experiments conducted on\nfour different channels, the results indicate that the proposed\nmodel is capable of generating high-accuracy approximations\nof the channel [28].\nOne of the shortcomings of this AE-based framework is\nthat it is trained based on the fixed Signal-to-Noise Ratio\n(SNR). When the SNR varies in the testing phase, their\nmethod cannot provide the optimal solution. To address this\nissue, the authors in [29] proposed a VAE-based scheme for\nsecrecy systems in changing environment (Fig. 2). In this\nframework, they proposed a secure VAE (SVAE) to perform\nas a transceiver designed with a loss function which can mea-\nsure the information leakage. Its loss function is specifically\ndesigned to increase the difficulty for eavesdroppers to recover\ndata, thereby meeting diverse application requirements of the\ntransceiver. In experiments, Bit Error Rate (BER) is adopted\nto evaluate the communication quality. Compared with the\nAE-based method [75], the BER of SVAE achieves around\n5 × 10−6 when SNR is 10 dB where the BER of AE-based\nachieves 10−2 in a perfect CSI scenario. Moreover, the BER\nat eavesdropper of SVAE does not decrease and keep at\n0.5 where AE-based’s BER has marked decrease [29]. With\nthis high BER at eavesdropper and low BER at legitimate,\nthe eavesdropper cannot recover correct information and the\nlegitimate can keep a high communication quality.\nHowever, the model in [75] only focuses on channel coding,\nwhere source and channel coding are performed separately,\nmight not be as efficient in dynamic communication networks.\nJoint Source Channel Coding (JSCC) can dynamically adjust\nthe coding strategy based on both the source content and\nthe channel conditions which is more suitable for dynamic\nnetworks [84]. The authors in [76] proposed a data-driven\napproach using VAE-based JSCC. The proposed model aims to\nminimize the information leakage and emphasises hiding an\nunderlying sensitive information.\nThe VAE enables precise\ncontrol over latent distributions and practical variational ap-\nproximation computation, crucial for calculating information\nsecurity dynamics in the proposed model. Evaluated on col-\nored MNIST dataset, the proposed method provides minimally\ndistorted source transmission with maximum channel capacity\n[76].\nSimilarly, the authors of [30] proposed a VQ-VAE [67]\nbased JSCC wireless communication framework. This frame-\nwork interprets both channel and source encoder (ENC) and\ndecoder (DEC) as variational techniques. A notable feature of\nthe VQ-VAE is the codebook, which facilitates the modeling\nof noisy channels in communication. Specifically, noise is\nrepresented by codeword through an index of binary digits\nto improve generalization [85].\nSimilarly, distortion can be\ninjected between the ENC and DEC to emulate a noisy chan-\nnel, enhancing the quality of communication. Furthermore, the\nENC, DEC, and codebook are intricately dependent on the\ndataset and channel conditions during the training phase [30].\nLeveraging this dependency, the framework can be adapted\nfor secure and private communication applications specifically\nto prevent eavesdropping. In such scenarios, an eavesdropper\nwould face significant challenges in accurately reconstructing\nthe intended message without prior knowledge of the specific\nENC and codebook used.\nBeyond directly employing VAEs for encoding transmitted\ninformation, [77] investigated the application of a GAN-\ninspired model for covert communication through Direct-\nSequence Spread Spectrum (DSSS). This model is designed to\nsecure communications between two parties, Alice and Bob,\nby preventing an eavesdropper, Eve, from detecting in an\nAWGN environment. In this setup, Alice transmits a message\nto Bob using a spreading code from a shared codebook. The\nGAN-inspired model utilizes the information eavesdropped by\nEve to generate the spreading code used by Alice and Bob. The\nsystem is jointly trained with a combined loss function, aiming\nto minimize Bob’s reconstruction error while maximizing\nEve’s. Furthermore, spreading sequences with low Peak Side\nLobe can improve model convergence. However, when Eve\nemploys Auto-Correlation-based Detection techniques, Eve\ndetectd the presence of the DSSS signal with an accuracy of\n70% at -6 dB SNRs or higher [77]. This significant level of\ndetection accuracy indicates that the proposed method must\nadopt more proactive strategies to ensure enhanced security in\ncommunications.\nKey generation that exploits the unpredictable character-\nistics of wireless channels can provide information-theoretic\nsecurity for communication confidentiality [86]. By utilizing\nthe unique and unpredictable characteristics of channels, key\ngeneration methods can effectively prevent eavesdroppers from\ngaining access to the encrypted data. However, when directly\nadopting AEs or VAEs, the unpredictability of the hidden layer\noutput and the inability to estimate high-dimensional features\nin advance pose challenges for applying these methods to key\ngeneration in the physical layer of communication systems.\nTherefore, a physical layer key generation method based on\nWGAN-GP [69] based AAE was proposed in [31]. This model\nis designed to efficiently extract features between legitimate\nnodes in a way that these features align with a Gaussian\ndistribution. Compared with the Principal Component Analysis\n(PCA) method [87], the proposed method can yield higher\nsecurity key capacity and a lower key error rate 15% which\n8\nTABLE V\nSUMMARY OF GAI FOR COMMUNICATION AUTHENTICATION IN PHYSICAL LAYER\nBLUE CIRCLES DESCRIBE THE METHODS; GREEN CORRECT MARKERS AND RED CROSS MARKERS REPRESENT PROS AND CONS RESPECTIVELY.\nTechniques\nReference\nAlgorithm\nPros & Cons\nRF Fingerprinting\nAuthentication\n[32]\nGAN\n● A GAN framework adapted for use within the RF fingerprinting context\n✓ Introduce a weakness in conventional AI methods\n✓ Augment the train dataset.\n✗ Cannot handle fast time-varying information\n[88]\nGAN\n● A framework for building a robust system to identify rogue RF transmitters\n✓ Exploit transmitter specific “signatures” including I/Q imbalance\n✗ Require additional classifier\n[89]\nGAN\n● A robust wireless transmitter identification scheme using GAN\n✓ Use a multi-classifier to both detect attackers and transmitters\n✗ Real wireless channel effect is not reflected\n[33]\nTriple-GAN\n● A semi-supervised specific emitter identification using GAN\n✓ A semi-supervised classification\n✗ Require relatively long training time\nCSI Authentication\n[90]\nGAN\n● The use of GAN and measured MIMO communications channel information to make a decision on Authentication\n✓ Effective in a variety of wireless environments\n✓ Use adversarial training for the discriminative model\n✗ Cannot handle fast time-varying information\n✗ Relatively limited performance at low SNR\n[34]\nCGAN\n● A method for physical layer authentication using two variations of CGAN\n✓ Utilize time-varying CSI as conditional input\n✓ Handle stochastic nature of the wireless channel\n✗ Not outstanding performance.\nCIR Authentication\n[35]\nHVAE-PLA\n● HVAE algorithm applied for learning industrial wireless channels\n✓ Without requiring attackers’ prior channel information\n✓ Extract valuable features of high-dimensional CIRs\n✗ Require relatively long training time\n✗ A trade-off between the involved class number and the authentication performance\nis lower than PCA with feedback, and 10% lower than the\nwithout feedback PCA. Additionally, the key generation ratio\nof this method is much higher than that achieved with PCA\n[31].\nAs summarized in Table IV, due to its ability to learn dis-\ntributions and extract features, GAI can significantly improve\nthe security of data transmission by generating encryption\nalgorithms preventing evolving threats. However, existing en-\ncryption methods [28], [29], [75] mostly depend on specific\ndataset reducing the generality of the method. Improving the\ngeneralization ability of the GAI model while maintaining\naccuracy may be a research direction in the future. In addition,\ncommunication quality depends greatly on the interpretability\nof neural networks [31], which is still an open question.\nB. Communication Authentication\nIn communication networks, safety-critical messages, which\nare essential for the safe operation and coordination of sys-\ntems, are frequently transmitted. These include vital commu-\nnications such as collision warnings, speed limit notifications,\nand updates on traffic conditions in vehicular networks [91],\n[92]. To ensure these messages are genuine and trustworthy,\nimplementing an authentication process is a critical measure\nto thwart malicious activities.\nRF fingerprinting is a technique used to identify and authen-\nticate wireless devices based on the distinctive characteristics\ninherent in RF signals. Given its ability to accurately pinpoint\nthe source of a transmission, RF fingerprinting is seen as a\ncrucial tool for device authentication and access control [93].\nRecently, several traditional AI methods have been adopted as\nthe standard approach for RF fingerprinting. In [94], a CNN\nframework was proposed to distinguish transmitters by the\nestimated error present in their transmitted waveforms. A Long\nShort-Term Memory (LSTM) network model was proposed in\n[95].\nHowever, the authors in [32] revealed a weakness in the\ntraining processes of these approaches that a malicious GAN\ncan be trained to introduce signal imperfections without\nmodifying the bandwidth or data contents of the signal to\nforce classifier errors. Then they showed that the classifier,\ntrained by the augmented dataset with adversarial examples\nfrom GAN, can mitigate this vulnerability. The experiment\nresults demonstrate that the Receiver Operating Characteristic\n(ROC) curves with GAN-augmented training has nearly 1\nArea Under the Curve (AUC), where 90% of the networks\nwithout GAN perform even worse than random guessing at\n40 dB SNR [32]. Similarly, in [88] the Radio Frequency\nAdversarial Learning (RFAL) framework was proposed for\nbuilding a robust system to identify rogue RF transmitters by\ndesigning and implementing a GAN. The GAN utilizes the In-\nphase and Quadrature (IQ) imbalance [93] to extract unique\nhigh-dimensional features from the RF signals. Using the\naugmented data from the generator in GAN, a discriminator\nmodel can classify the trusted transmitters and the counterfeit\nones with 99.9% accuracy.\nInspired by [88], the authors in [89] proposed a GAN\nbased wireless transmitter identification scheme. The proposed\nframework uses a multi-classifier to both detect malicious\nattacker and classify trusted transmitter without any extra\nclassifier. Once trained, discriminators are employed to check\nwhether the captured unknown IQ data comes from a corre-\nsponding trusted transmitter. If the label vector, made up of 1s\n9\nand 0s, shows all 0s, the data is not from a trusted source, sug-\ngesting a high probability of it being sourced from an attacker.\nAdditionally, the authors in [33] introduced the Triple-GAN\nstructure [96] to adopt semi-supervised classification. With the\nmodified structure, the classification accuracy of the proposed\nframework can achieve over 90%, only 1% of the training data\nsamples are labeled [33].\nChannel State Information (CSI) is an important parameter\nof a communication link in the physical layer. By leveraging\nits unique properties, CSI can be utilized in an authentication\ncontext [92], [97]. Once a transmitter is initially authenticated\nby certain methods such as RF fingerprinting, the receiver\nmaintains this authentication status as long as the variations in\nthe received CSI remain below a certain threshold compared to\nthe CSI from previous transmissions. However, attackers can\nmodify various aspects of their transmission setup, including\nantenna properties, transmission timing, power levels, or use\nreflectors [98]. These alterations enable them to change their\nCSI as measured by the receiver.\nTo address these issues, the author in [90] proposed a GAN\nbased model to authenticate devices in Multi-Input Multi-\nOutput (MIMO) communication systems. The proposed model\nemploys adversarial training to improve the authentication\nprocess. The discriminative model at the receiver is trained\nby a generator that creates fake CSI samples looking like the\nauthentic samples. Simulation results show that the discrimi-\nnator achieves 100% accuracy for SNR greater than or equal\nto 10 dB. For SNR less than 10 dB, while the discriminator\nmakes errors in correctly recognizing legitimate samples, it\nconsistently succeeds in preventing illegitimate samples from\nbeing authenticated [90].\nTo handle the time-varying CSI in fast-changing environ-\nment, the authors in [34] proposed a CGAN based model\ncombining with LSTM and gated recurrent unit (GRU) cells.\nCompared with the method in [90], the proposed model\nutilizes a CGAN instead of a conventional one, which can\nincorporate the previous CSI elements associated with time as\nthe conditional information (Fig. 3). This approach allows for\na more detailed generation and analysis of CSI data in the\ntemporal aspect and historical patterns. In experximents, the\nCGAN-GRU network typically performed as well as or better\nthan the standalone LSTM or GRU networks. Especially when\nmean-square error threshold is -25 dB, all of them can achieve\naccuracy at almost 99% [34].\nIn addition to CSI, the Channel Impulse Response (CIR)\nis another significant parameter in wireless communications\nproviding a detailed characterization of how a wireless signal\npropagates from the transmitter to the receiver in a spe-\ncific environment. In [35], the authors proposed a CIR-based\nhierarchical VAE physical-layer authentication (HVAE-PLA)\nscheme. The HVAE-PLA consists of an AE module and a\nVAE module. The AE module is dedicated to extracting the\ncharacteristics of CIR, providing insights into how signals\npropagate in specific environments. The VAE module building\nupon this aims to enhance the representational capacity of the\nextracted CIR characteristics. Compared with a conventional\nAI method in [99], the proposed scheme can authenticate the\nspoofing nodes in all positions in the static dataset. Moreover,\nthe simulations show that the proposed method can improve\nthe authentication performance by 17.18%–69.3% compared\nto the vanilla AEs and VAEs [35].\nError\nGenerator\nDiscriminator\nTraining\nSamples\nPrevious\nSamples\nPrevious\nSamples\nNoise\nUpdate\nUpdate\n[0,1]\nDeployment\nChannel State \nInformation\nB. Model\nA. CGAN\nFig. 3.\nProposed CGAN training architecture in [34]. In Part A, the\nconditional information is the previous magnitudes of the CSI elements\nassociated with time. The output of the discriminator is the probability value,\nrepresenting the likelihood from zero to one based on its perception of whether\nthe sample is fake or authentic. Part B illustrates the system model structure.\nThe integration of GAI in communication authentication\nthrough specific information has highlighted GAI’s ability to\nenhance the uniqueness and reliability of identifying devices\nin a network, as summarized in Table V. However, generative\nmodels require relatively long training and inference times due\nto their complex structure [33]. When facing fast time-varying\ninformation [32], they have difficulty to infer and adapt to\nadditional new information in real time. Therefore, pruning\nthe model size and enhancing model real-time adaptation are\nurgently needed for security authorization.\nIV. COMMUNICATION AVAILABILITY AND RESILIENCE\nThe concepts of communication availability and resilience\nemerge as fundamental components to maintain continuous\nand reliable access for communication systems [100]. Chal-\nlenges such as network disruptions and deliberate cyber attacks\ncan severely impact the availability of digital communication\nservices, leading to significant downtime and loss of con-\nnectivity [101]. This section aims to explore the integration\nof advanced strategies and GAI techniques to ensure the\ncommunication availability and resilience via solving two\ncommon cyber attacks: jamming and spoofing in physical\nlayers.\nA. Anti-jamming Strategy\nThe jamming attack is a vital threat to communication\navailability at the physical layer, aimed at disrupting legitimate\ncommunications by introducing noise [108]. Therefore, to\nensure communication availability, detecting and mitigating\n10\nTABLE VI\nSUMMARY OF GAI FOR ANTI-JAMMING STRATEGY IN PHYSICAL LAYER\nBLUE CIRCLES DESCRIBE THE METHODS; GREEN CORRECT MARKERS AND RED CROSS MARKERS REPRESENT PROS AND CONS RESPECTIVELY.\nTechniques\nReference\nAlgorithm\nPros & Cons\nJamming\nRecognition\n[36]\nGAN\n● An adversarial machine learning approach launch jamming attacks on wireless communications and a defense\nstrategy\n✓ Rely on a small amount of sample data\n✓ Do not need any knowledge of transmitter’s algorithm\n✗ Limited resilience of the strategy in highly dynamic and unpredictable wireless environments\n[102]\nGAN\n● An input-agnostic adversarial attack technique based on GANs and multi-task loss\n✓ Quickly craft small imperceptible perturbations\n✓ Not depend on the original samples\n✗ Just consider certain scenarios\n[37]\nAC-VAEGAN\n● A jamming recognition method based on AC-VAEGAN\n✓ Stable recognition performance in the case of small samples\n✗ Require relatively long training time\n✗ Unsuitable for large-scale deployment\n[103]\nGAN\n● An algorithm based on GAN TO mine the relationship of the data and complete the missing data\n✓ Complete spectrum data in multiple jamming patterns\n✗ Less emphasis on real-world testing\nAnti-Jamming\n[38]\nGAN\n● A GAN based spectrum completion network\n✓ Complete the partially missing spectrum data\n✓ Achieve high reward of the policy\n✗ Slightly poor performance in the high missing rate scenario\n[104]\nGAN\n● A PU-friendly dynamic spectrum anti-jamming access scheme combining offline training and online deployment\n✓ Focus on both PU and SU\n✓ Converge fast to the optimal policy\n✗ Still slow convergence speed\n[39]\nADRLDN\n● A decision related judgment module between jammer and user based on GAN\n✓ Adapt to complex types of jamming\n✓ Superior in anti-jamming performance than the current anti-jamming method\n✗ Require relatively long training time\n[105]\nGAN\n● The secrecy communication in an EH-enabled Cognitive EH-CIoT network with a cooperative jammer\n✓ Maximize the system’s secrecy rate while minimizing the SOP\n✗ Potential limitations in real-world implementation\n✗ complexity of the DRL framework\n[106]\nGAN\n● An intelligent jamming and anti-jamming framework to analyze and promote the security of semantic commu-\nnication\n✓ A GAN-like game strategy to reflect the relationship between the semantic jammer and receiver\n✗ Not suitable for other multilingual model\n[107]\nGDNN\n● A communication model in cognitive radios using machine learning to learn the dynamics of jamming attacks\n✓ Adapt to the dynamics of the spectrum\n✗ Require relatively long training time\njamming attacks represents a critical initial defense. There\nare several conventional methods employed wireless jamming\nattacks, including random and sensing-based jamming [109].\nHowever, with the increasing integration of machine learn-\ning techniques into communication systems, both legitimate\ntransmitters and malicious jammers leverage machine learning\nalgorithms to understand the spectrum environment better\nwhich introduces new emerging types of attacks including\nadversarial attacks.\nIn [36], the authors present an adversarial learning strategy\nemploying GAN to facilitate adversarial jamming attacks.\nThis approach enables jammers to generate synthetic data\nbased on a small number of real data samples. These syn-\nthetic samples are then integrated into the training dataset.\nSimulation results indicate that the detection accuracy of a\njammer closely approximates, within 0.19% for misdetection\nand 3.14% for false alarms, that of a jammer trained with a\nlarger dataset of real samples collected over a long duration\n[36]. Furthermore, based on the attack characteristics, they\nproposed a defense strategy for the transmitter, centered on\nrendering its behavior unpredictable. This can be achieved by\nthe transmitter intentionally performing incorrect actions, such\nas transmitting on a busy channel or refraining from transmit-\nting on an idle channel, during strategically selected time slots.\nAdditionally, the authors in [102] proposed an input-agnostic\nadversarial attack technique, which adopts GAN to create\nperturbations in advance. These pre-generated perturbations\ncan then be efficiently applied to a variety of incoming signals.\nFurthermore, this approach has the potential to substantially\naid in the development of classifiers that exhibit robustness\nagainst adversarial jamming attacks.\nIn the case of small sample datasets, the performance of\nautonomous feature extraction and classification of DL will\nbe reduced [110]. Especially in real-world network communi-\ncations, it is difficult to obtain enough sample data for anti-\njamming due to the privacy policy and the inadequacy of\ntechnical methods. To generate more realistic data, the authors\nin [37] proposed a jamming recognition method based on AC-\nVAEGAN, which combines the VAEGAN [72] and ACGAN\n[70]. In this model, the latent space of a small amount of signal\ndataset is obtained by VAE firstly. Then, the datasets will be\nexpanded by sampling points of the latent space and decoding\nthem. Finally, the discriminator of the GAN framework is\nextracted for jamming recognition. In experiments, when the\n11\nJamming-to-Noise Ratio (JNR) is -10dB, the average correct\nrecognition rate of AC-VAEGAN network is approximately\n65%, where the rate of ACGAN and CNN network is only\nabout 55% [37].\nOriginal \nSpectrum\nA. Generator\nB. Discriminator\nReal\nFake\nReal\nFake\nConvolution\nConvolution\nDe-Convolution\nFully Connected\nLabel\nSpectrum\nMask \nPartial \nNoise Mask\nGenerated\nMask\nDeployment\nCognition Link\nAgent\nJammer\nJammer\nC. Model\nFig. 4. The overall network structure in [103]. Part A illustrates the generator,\nwhich is designed as an AE comprising a convolution layer, a fully connected\nlayer, and a de-convolution layer. In Part B, two discriminator modules are\ncrafted using a convolution network and are optimized to focus on local and\nglobal details, respectively. Part B describes the system model structure.\nExcept the scarcity of data, the occurrence of jamming\nattacks frequently leads to incomplete data, which hinders\nthe ability of anti-jamming strategies to discern jamming\nattacks [36]. To complete the missing information, the authors\nin [103] proposed an efficient algorithm based on a GAN\nfocusing on spectrum waterfall completion, where spectrum\nwaterfall is a thermodynamic block diagram defining the\nenvironmental state [111]. The algorithm can automatically\nmine the relationship of the data and complete the missing data\naccurately. Different from the noise input in the original GAN,\nthey use the spectrum waterfall with missing data as generator\ninput, which can limit generator artistry (Fig. 4). From the\ncorresponding complement results, the proposed algorithm is\nbetter than the method without pre-classification, since the\ngenerator that adds auxiliary information is more targeted to\nthe data. The accuracy is more than 95%, where the latter is\nnearly 80% [103].\nSeveral studies have demonstrated that anti-jamming com-\nmunications, enhanced by Deep Reinforcement Learning\n(DRL) [112], can achieve near-optimal performance in dy-\nnamic and unpredictable environments [113], [114]. In [38],\nthe authors proposed a framework combining the GAN and\nDRL.\nThe proposed framework consists of two stages: the\noffline stage and online stage (Fig. 5). Initially, a GAN is\ntrained to complete missing spectrum data using historical\ndata. Once the GAN training is complete, the generator is\nimplemented as Spectrum Completion Network (SCN) during\nthe online stage. Subsequently, with the augmented spec-\ntrum data, a DRL-based Channel Selection Network (CSN)\nis employed. The CSN utilizes the enriched spectrum data\nto assist users in selecting optimal communication channels\nfor anti-jamming. The performance of the proposed scheme\nnotably surpasses that of the conventional DRL-based method\nin [114], as well as the scheme that combines K-Nearest-\nNeighbor Interpolation (KNNI) and DRL [115] in all missing\nrates. Especially, the proposed scheme achieves the discounted\naccumulative reward of 8.3 when the missing rate is 10%.\nIn comparison, the conventional method scores 4.4, and the\nKNNI-DRL combination scores 6.5 [38].\nAdditionally, the authors in [104] introduced a dynamic\nspectrum anti-jamming access scheme in the cognitive radio\nbased network [116] that is friendly to Primary Users (PU)\nwhile also safeguarding Secondary Users (SU) from indis-\ncriminate jamming attack by jammers. Similar to the scheme\nin [38], this proposed framework is divided into two stages:\nthe offline stage and the online stage where the key difference\nlies in the GAN model used in the first stage. Here, the GAN\nis trained to accurately simulate the Spectrum Environment\n(SE), which is considered a Virtual Environment (VE). By\npre-training the Channel Decision Network (CDN) offline in\nthis VE, the SU is equipped to evade both PU signals and\njamming in the actual SE, following the guidance of the trained\nCDN. According to the experiments, it takes about 90s for the\nproposed scheme to converge to the optimal policy while the\nCDN trained in SE from scratch spends about 160s [104].\nExisting anti-jamming technologies rely on hidden anti-\njamming strategies, but their performance tends to diminish\nwhen facing with more sophisticated or complex jamming\ntypes [117]. In [39], the authors proposed a DRL algorithm\nwith a double network structure, named ADRLDN, which\nadopts the hidden anti-jamming idea and can deal with var-\nious types of complex jamming in actual scenarios. In this\nframework, they designed a GAN network-based user and\njammer decision-making correlation judgment module. The\nGAN is trained to fit the environmental state under known\nuser information, and evaluates whether the user information\nis obtained by the jammer. The DRL network is trained to\nguarantee the user’s decision not obtained by jammers. In\nthis situation, there are two key points: compare the fitted\nenvironmental state with the real environmental state; ensure\nboth the generation and the evaluation of the effect of the\nnetwork. These happen to be the essential characteristics\nof GAN networks. According to the simulation experiment\nresults, ADRLDN is superior in anti-jamming performance\nthan the current anti-jamming method based on avoiding the\nidea (ADRLA) [114] by reducing the probability of users\nbeing jammed by 15%.\nAs for Cognitive Internet of Things (CIoT), a major chal-\nlenge is extending the system’s lifespan. Energy Harvesting\n(EH) technology is a promising solution to provide sustainable\nenergy to energy-constrained mobile devices in CIoT systems\n[118], [119]. However, EH-CIoT systems encounter significant\njamming attacks due to the wireless channels, which exposes\ninformation transmissions to potential security risks. In [105],\nthe study considered an EH-CIoT system where the commu-\nnication security of the SU network is threatened. To enhance\nsecurity, the authors propose a DRL algorithm that integrates\nLSTM and GAN models. This algorithm aims to maximize\nthe system’s secrecy rate while minimizing the Secrecy Outage\nProbability (SOP). The GAN network is utilized to mitigate the\ntime-varying CSI and the adverse effects of random noise at\n12\nSpectrum\nEnvironment\nJamming\nHistorical\nData\nG\nD\nReal\nFake\nG\nExperience\nPool\nIncomplete\nSensing\nA. Offline Training\nB. Online Training\nMask\nIncomplete \nSW\nCompleted \nSW\nUpdate\nUpdate\nChannel Selection \nNetwork\nUpdate\nObtain feedback and calculate reward\nCommunicate on selected channel\nFig. 5. Overall structure of the proposed anti-jamming spectrum access scheme in [38]. In Part A, a GAN with the Generator (G) and Discriminator (D) is\ntrained to complete missing spectrum data using historical data. In Part B, the generator (G) is implemented as SCN. The CSN utilizes the enriched spectrum\ndata to assist users in selecting optimal communication channels for anti-jamming.\nthe receivers. Simultaneously, the LSTM network is employed\nfor extracting features from the input environment. The study’s\nfindings reveal that the convergence speed of the proposed\nalgorithm is significantly faster 1.69 and 3.15 times than that of\nother algorithms that do not incorporate the GAN model [105].\nThe integration of the GAN and LSTM model significantly en-\nhances the algorithm’s ability to quickly capture environmental\ninformation and learn optimal strategies.\nSemCom is a revolutionary way of communicating that\nhelps overcome the limitations of previous methods by us-\ning DL to send necessary information, which reduces the\namount of data sent [120]. With the focus on semantic-level\ntransmission, new challenges in jamming and anti-jamming\narise. Attackers will aim to create more effective jamming\nmethods to degrade the quality-of-experience (QoE) for users\nin communications [121]. In [106], a framework for intelligent\njamming and anti-jamming in semantic communication was\nproposed based on the GAN. In the framework, the transmitter\nsends data with semantic features, and the receiver tries to\nunderstand it correctly while a jammer tries to mess up\nthis process. The authors designed a GAN model where the\njammer learns to generate disruptive signals, the receiver is\ntrained to selectively focus on legitimate segments of the\nincoming data, thereby enhancing its proficiency in identifying\nand mitigating semantic jamming.\nIn jamming attacks, a key factor for their success is the\njammer’s ability to accurately determine the frequency of\nsignal transmission. This capability is vital for generating\njamming noise powerful enough to disrupt the SNR within\nthe same frequency band. To mitigate jamming attacks, the\nauthor in [107] developed an anti-jamming communication\nsystem model based on GANs. The proposed model employs\ngenerator and discriminator integrated with min-max game\ntheory, to automatically adapt to the dynamics of the spectrum.\nThe training of the proposed model within this defense mech-\nanism is designed to mislead jammers, preventing them from\neffectively targeting the transmission of data. This strategic\ndeception, rooted in game theory, hinders the jammers’ ability\nto accurately select time slots for their attacks, leading to\nerroneous predictions on classification sources, which in turn\nprevents significant transmission losses.\nAs summarized in Table VI, GAI has demonstrated the\neffectiveness in identifying jamming activities and develop-\ning suitable anti-jamming strategies. However, most existing\nworks only consider certain scenarios and lack real-world\ntesting [102], [103], [106]. Due to the complex architectures,\nGAI models are also unsuitable for large-scale deployment\n[37]. Therefore, designing a model that can be used in realistic\nanti-jamming scenarios especially on a large scale needs to be\nconsidered.\nB. Spoofing Defense\nAuthenticating wireless signals at the physical layer is\nessential for ensuring communication resilience. Despite em-\nploying numerous features discussed in Section III, wireless\nsignal spoofing remains a pervasive threat. In spoofing, attack-\ners insert fake identification information into genuine com-\nmunications to join or corrupt the systems [125]. Therefore,\nit enable unauthorized access and data manipulation at the\nphysical layer, causing substantial harm to the communication\nresilience.\nCurrently, DL methods have proven effective against simple\nspoofing attacks. For example, the study in [40] examines a\nbasic spoofing technique like the replay attack, which partially\nreplicates original signals.\nHowever, adversarial spoofing\nattacks, as discussed in [36], pose a more profound threat\nby evading traditional security measures. The research in [40]\nexplored this issue from both the attacker’s and defender’s\n13\nTABLE VII\nSUMMARY OF GAI FOR SPOOFING DEFENSE IN PHYSICAL LAYER\nBLUE CIRCLES DESCRIBE THE METHODS; GREEN CORRECT MARKERS AND RED CROSS MARKERS REPRESENT PROS AND CONS RESPECTIVELY.\nTechniques\nReference\nAlgorithm\nPros & Cons\nSpoofing Defense\n[40]\nGAN\n● An approach of spoofing wireless signals by using a GAN\n✓ Provide GAN-based model defense mechanism\n✗ Limited to simulated environments\n[122]\nGAN\n● A DL-based spoofing attack to generate synthetic wireless signals\n✓ Detailed analysis and implementation\n✗ Not fully explore the potential countermeasures against such attacks\n[123]\nWGAN-GP\n● The task of full-band spectral generation in addition to single signal generation\n✓ Treat LTE signals as 2D images\n✗ Poor performance of generated signals\n[41]\nCBEGAN\n● A wireless spoofing attack scheme against the defense mechanism with adversarial DL\n✓ Compensate for transmission channel effects via auxiliary channel sensing\n✗ Consider specific channel conditions\n✗ Limited to simulated environments\n[124]\nGAN\n● A GNSS anti-spoofing method based on the idea of confrontation evolution of a GAN\n✓ Detect small delay spoofing signals\n✓ Extract features of slight differences\n✗ The overall performance is not remarkable.\n[42]\nSJG-GAN\n● A generation method for spoofing jamming signals\n✓ Learn the latent distribution of DSSS signals\n✓ Propose a improved Pearson correlation coefficient\n✗ Lack real-world testing\nperspectives, proposing a GAN model to create indistinguish-\nable signals. The GAN is trained to emulate the pattern\nof intended transmissions which significantly improves the\npossibility of a successful attack compared to random signal\nand replay attacks, even when node locations vary between\ntraining and testing phases [40]. Moreover, the proposed GAN-\nbased model provides defense mechanism by using GAI to\ndistinguish and counteract signal spoofing attacks. In [122],\nthe authors further provided a detailed analysis of the proposed\nGAN-based spoofing attack, including its implementation on\nembedded platforms. This implementation is carried out on\ntwo distinct embedded platforms: an embedded Graphics Pro-\ncessing Unit (GPU) [126] and a Field-Programmable Gate\nArray (FPGA) [127]. The effectiveness of the proposed attack\nis noteworthy, with a success probability ranging from 60.6%\nto 97.8%. However, the technique’s dependence on real-time\ncompensation for transmission channels causes considerable\noverhead. This feature elevates the risk of detection due to an\nexpanded communication footprint.\nSimulating and imitating RF signals is a basic tactic em-\nployed by spoofers. While GAI has demonstrated effectiveness\nin augmenting short time series segments, challenges remain in\naccurately generating RF signals, such as the length of signals,\nand radio environments [123]. The authors in [123] explored\nthe potential of GAN models to accomplish full-band spec-\ntral generation for anti-spoofing attacks. They implement the\nWGAN-GP model [69] to improve training stability. Drawing\non its proven effectiveness in the image domain, they utilize\nspectral representations of OFDM signals called LTE [128],\ntreating them as 2D images. Nonetheless, the study shows\nthat using GANs to create long sequences over time is quite\nchallenging. It is harder to capture small details and features\nin these long sequences than in the shorter ones [123].\nTo overcome the limitations of existing methods, [41]\nintroduces a controllable wireless spoofing attack scheme\nthat leverages a Conditional Boundary Equilibrium Generative\nAdversarial Network (CBEGAN) [129] in conjunction with\nauxiliary channel sensing. The CBEGAN network combines\nwith an AAE, which is a well-established deep neural net-\nwork architecture for computer vision-related tasks enabling\nlearning with few samples [71]. It facilitates more precise and\neffective spoofing attacks by simulating a variety of emitters\nand modulation types. Additionally, the integration of auxil-\niary channel sensing effectively compensates for transmission\nchannel effects. Since it allows the attack model to be trained\noffline, it significantly reduces the likelihood of detection\nby legitimate communication pairs. Under the same channel\nconditions, the proposed spoofing attack scheme reaches a\nsuccess probability of 85.7%. In contrast, the comparative\nattack scheme mentioned in [122] achieves a lower success\nrate, with a probability of 76.2% [41].\nOne sophisticated form of spoofing attack is spoofing jam-\nming, where the attacker broadcasts analog signals designed\nto imitate authentic signals. This can lead to a target receiver\nobtaining false information instead of the true data. Due to\ntheir long-distance transmission from satellites to receivers,\nGlobal Navigation Satellite System (GNSS) signals are more\nprone to disruptions from spoofing jamming attacks [130]. To\ndetect spoofing jamming attacks, the authors in [124] proposed\na spoofing signal detection method based on the GAN in the\nacquisition stage, which is one of several phases in character\nrecognition that also includes preprocessing, feature extrac-\ntion, classification, and post-processing [131]. The proposed\nmodel specifically considers the classification of authentic and\nspoofing signals within the context of navigation tasks. In this\nsetup, both the training and test datasets are derived from\nthe GPS receiver code. According to the simulation results,\nthe successful detection of small-delay spoofing signals is\nachieved through the use of adversarial learning within the\nGAN. Additionally, while the overall performance of the GAN\nis comparable to that of the CNN, the GAN exhibits a slight\nadvantage over the CNN, particularly when the pseudo-code\n14\nDS signal\nB. High-performance Generated Signal Selection\nPearson \nCorrelation\nCoefficient\nGenerated Signal 1\nGenerated Signal 2\nGenerated Signal n\nGenerated Signal 3\nGenerated Signal 7\nGenerated Signal k\nSynthetic Signal\nPerformance Evaluation\nSignal Selection\nSpoofing Jamming\n≥ +0.9\nDelete\nF\nT\nGenerator\nDiscriminator\nReceived Signal\nNoise\nSource\nModulate\nSpread \nSpectrum\nTransmitting Terminal\nSource\nModulate\nSpread \nSpectrum\nReceiving Terminal\nChannel\nHigh-Performance \nGenerated Signal Selection\nSpoofing\nJamming\nGenerated Signal\nUpdate\nA. SJG-GAN framework\nFig. 6.\nThe overall network structure in [42]. Part A illustrates the SJG-\nGAN framework consisting of two parts: signal generation and the high-\nperformance generated signal selection. In Part B, the process of the high-\nperformance generated signal selection is shown. It can be split into two steps:\nthe evaluation and the selection\nphase offset is equal to or greater than 0.5 chip [124].\nHowever, Spoofing jamming’s creation is complex and\nresource-intensive, requiring extensive prior information. So\nfar, only specific authorized or civilian systems have success-\nfully executed such attacks [132]. Drawing inspiration from\n[40], the authors in [42] introduced a GAN-based approach,\ntermed Spoofing Jamming Generation (SJG-GAN), for craft-\ning spoofing jamming attacks (Fig. 6). This model is adept at\nlearning the latent distribution of DSSS signals and generating\na set of synthetic signals. Upon completion of training, a\nimproved Pearson correlation coefficient is used as an eval-\nuation metric to select the most aggressive synthetic signals\nfor the DSSS system as spoofing jamming signals. Notably,\nthe one-dimensional GAN model of SJG-GAN simplifies the\ngeneration process, making it more cost-effective and feasible\nfor a variety of communication systems, as demonstrated in\nsimulations [40].\nIn conclusions, GAI models are able to offer sophisticated\nmechanisms to both detect and counteract spoofing attacks,\nas summarized in Table VII. However, since they are limited\nto simulated environments, the detection accuracy in actual\nscenarios still needs further investigation.\nV. COMMUNICATION INTEGRITY\nCommunication integrity in the physical layer of a network\ninvolves ensuring that the data transmitted over a physical\nmedium, such as copper wires, fiber-optic cables, or wireless\nsignals, is delivered accurately and reliably, without corruption\nor alteration [63]. This often requires mechanisms for anomaly\ndetection or data reconstruction to maintain the fidelity of the\ndata as it moves from one device to another, thereby preserving\nthe integrity of communication.\nA. Anomaly Detection\nFeatures\nClass\nInput\nDiscriminator\nDiscriminator\nSample from\na Gaussian \ndistribution\nSample from\na Categorical \ndistribution\nLSTM\nEncoder\nCNN\nEncoder\nInput\nLatent Variables\nInput PSD vector\nReconstructed \nPSD vector\nFig. 7.\nThe proposed model architecture in [43]. The AAE architecture is\ntrained in a semi-supervised learning for making the features more inter-\npretable while the reconstruction is fully unsupervised.\nAnomaly detection is a method used to identify and mit-\nigate unexpected deviations or irregularities in the commu-\nnication channel [140]. However, due to the unpredictable\ncharacteristics of potential anomalies, it is difficult to gather\nenough abnormal data for training samples in traditional AI\nmethods [141]. Thus, there is an urgent need for an unsu-\npervised, automatic feature-extraction learning model, such as\nGAI techniques for anomaly detection [142]. Generally, GAI\nfor anomaly detection can be divided into two cartography:\nreconstruction-based [133] and prediction-base detection [45].\nReconstruction-based methods identify anomalies through\nanomaly scores, which are usually the reconstruction error in\nGAI models. In the study [133], the authors proposed a deep\nAE-based approach for anomaly detection in the spectrum.\nThe time-frequency features of preprocessed signal data are\nutilized to train the proposed network. To differentiate between\nnormal and anomalous data, the method applies a threshold\nto the reconstruction errors, transforming these errors into a\nbinary outcome. The threshold value is strategically selected\nto trade-off a balance between the probabilities of false alarms\nand missed alarms, and it is determined as the median of a\nsequence of reconstruction errors in this study.\nWhile the model presented in [133] demonstrates effective-\nness, it lacks interpretable feature extraction capabilities, such\nas signal bandwidth and position. This limitation necessitates\nthe training of multiple copies of the model for different\nfrequency bands. Addressing this issues, the authors in [43]\nintroduced Spectrum Anomaly Detector with Interpretable\nFEatures (SAIFE), which is an AAE based model (Fig. 7).\nSAIFE enables the training of a single model across multiple\nbands in an unsupervised manner, thereby eliminating the need\nfor multiple model instances for different bands. Moreover,\nthe AAE architecture provides a flexible and robust platform\nfor semi-supervised learning, enabling the extraction of in-\nterpretable features based on Power Spectral Density (PSD)\ndata [143]. Furthermore, the reconstructed signals are a key\nasset for localizing anomalies within the wireless spectrum.\nImpressively, the model demonstrates exceptional performance\nin wireless band classification, achieving an accuracy close to\n100% while only utilizing 20% labeled samples [43].\n15\nTABLE VIII\nSUMMARY OF GAI FOR ANOMALY DETECTION IN PHYSICAL LAYER\nBLUE CIRCLES DESCRIBE THE METHODS; GREEN CORRECT MARKERS AND RED CROSS MARKERS REPRESENT PROS AND CONS RESPECTIVELY.\nTechniques\nReference\nAlgorithm\nPros & Cons\nScore-based\nDetection\n[133]\nAE\n● The deep-structure AE neural networks to detect the anomalies of spectrum via time–frequency\ndiagram\n✓ The threshold selected to trade-off a balance between the probabilities of false alarms and missed\nalarms.\n✗ Include potential biases in signal data selection\n[43]\nSAIFE\n● An AAE-based anomaly detector for wireless spectrum anomaly detection using PSD data\n✓ A single model across multiple bands to extract interpretable features\n✗ The distribution corresponds more to the latent representations than to the original training samples.\n[134]\nGAN\n● A GAN-based system trained on available EM signals to detect unseen types of EM waveforms\n✓ The generator consists of two AEs connected in series.\n✗ Require relatively long training time\n[135]\nResNet-AE\n● An anomaly detection method based on ResNet-AE\n✓ Establish an adaptive decision threshold\n✗ Cannot classify the types of anomalies\n[44]\nβ-VAE\n● A VAE model uses multivariate normal distribution with a parameter β included to the KL divergence\nterm\n✓ Investigate the impact of different weightings of the KL divergence\n✗ Not specify how to select the optimal value of the β coefficient\n[136]\nAE\n● The AE neural networks into WSN to solve the anomaly detection problem\n✓ Satisfy the demand for limited computational resources\n✗ Lack of analysis that extends to large scale sensor networks\nPrediction-based\nDetection\n[137]\nMSGAN\n● A domain-specific framework consisting of offline training and online inference to detect anomalies\nin the scenario of industrial robotic sensors\n✓ Use an adaptive update strategy during offline training\n✗ Lack of analysis that extends to diversity scenarios\n[45]\nE-GAN\n● A radio anomaly detection algorithm based on modified GAN\n✓ Latent representations are controlled rather than being randomly selected.\n✓ Capture the distribution of input samples\n✗ Relatively high time complexity\n[46]\nCGAN\n● The GAI-based abnormality Detection techniques at the physical layer in CR\n✓ Implement a hybrid structure for low- and high-dimensionality data\n✗ Limited by signal types tested\n[138]\nMultiple\n● The GAI frameworks used to detect anomalies inside the dynamic radio spectrum\n✓ A comparative analysis of three deep generative models\n✗ Cannot be employed to characterize and classify the anomalous signals\n[139]\nMultiple\n● GAI-based anomaly detection methods to detect a set of anomalous activities in several radio band\n✓ Three deep generative models are applied to spectral density functions\n✗ Need to consider the key applications and proper methods or ensembles of methods to achieve the\nbest performance\nSimilar to the SAIFE model [43], the study in [134] also de-\nsigned an anomaly score based on latent representations. The\nauthors proposed an architecture for electromagnetic wave-\nform anomaly detection, utilizing a dual AE enhanced GAN.\nThis design differs from the SAIFE model, as the generator\nin the proposed method is composed of two AEs connected in\nseries. These encoders map original and reconstructed data to\nthe latent space, respectively. The Anomaly Score is defined\nwith the objective of minimizing the L2 distance between\nlatent representations for anomaly detection.\nIn response to the complexity and training overhead of\nGANs and the low accuracy of traditional AE networks in\nanomaly detection of electromagnetic signals, the authors in\n[135] proposed a ResNet-AE network model. This model\nintegrates the encoder and decoder with ResNet architecture\nand LSTM architectures for efficient feature mapping and data\nreconstruction. To process the anomaly detection results and\nestablish an adaptive decision threshold, a K-Means classifier\nwith two categories is constructed, using a random initial\nclustering center to categorize the anomaly scores. After\niterative clustering, the centers for normal and abnormal signal\nscores are determined, and the mean value of these centers is\nused as the threshold for anomaly judgment. When applied\nto radar signal anomaly detection, the proposed ResNet-AE\nmethod achieves a high recognition accuracy, exceeding 85%\n[135].\nTo further investigate the impact of different weightings of\nthe KL divergence in the loss function of VAEs, the authors of\n[44] proposed an approach for data anomaly detection using a\nβ-VAE [144]. This advanced model, employing a multivariate\nnormal distribution, introduces a coefficient β to control the\nKL term. It allows for a more disentangled representation of\ndata, where each unit in the latent code is responsive to a single\ngenerative element, enhancing the model’s interpretability and\neffectiveness. However, the study does not specify the method\nfor selecting the optimal value of the β coefficient.\nWhile existing methods have proven effective in anomaly\ndetection, they often involve transmitting large volumes of raw\ndata, resulting in significant channel interference and energy\nconsumption. To address the substantial demand for compu-\ntational resources, the study [136] introduces an AE-based\ndistributed anomaly detection approach in Wireless sensor\nnetwork (WSN), characterized by its simplicity with only three\nlayers. Each sensor in the proposed approach is equipped with\n16\na copy of the AE and is responsible for two primary tasks, in\naddition to its regular sensing function. The first task involves\nproviding the input and output data of the AE to the IoT\ncloud, which serves as the training data. This data transfer\noccurs through a gateway or cluster head at a significantly\nlower frequency compared to the sensing rate. The second\ntask is the execution of anomaly detection, which is conducted\nlocally at the sensor level. This process is independent of\nany communication with other sensors, the gateway, or the\nIoT cloud, thereby enabling efficient and autonomous anomaly\ndetection within each sensor unit, offering a more efficient and\nautonomous approach to anomaly detection in WSN [136].\nBesides\nreconstruction-based\nmethods,\nprediction-based\nmethods have also proven to be effective for anomaly de-\ntection, which directly predict the probability of an anomaly\nwithout defining an anomaly score[45], [46], [137], [138].\nA primary challenge in physical layer sensing is the large\namount of unclean and irrelevant data collected from sensors,\nknown as data imbalance [145]. This issue often results in\ntraditional AI models misclassifying all samples as abnormal,\nfurther complicating anomaly detection [146]. To tackle the\ndata imbalance problem, [137] introduces the MSGAN model,\na GAN-based data augmentation strategy specifically designed\nfor sensor anomaly detection. This model integrates WGAN-\nGP [69] with a novel adaptive update strategy during offline\ntraining. The adoption of an adaptive update strategy allows\nthe MSGAN to accelerate training convergence and improve\nthe quality of synthetic samples.\nIn SAIFE [43], the distribution captured by AAEs corre-\nsponds more to the latent representations than to the original\ntraining samples. To address this limitation, the study in [45]\nintroduced an Encoder-GAN (E-GAN) structure, which incor-\nporates an encoder network into the original GAN framework\nto reconstruct the spectrogram. By integrating an encoder into\nthe standard GAN, the latent representations are controlled\nby the encoder rather than being randomly selected, which\nensures that the generator produces data within the actual data\ndistribution. Consequently, the E-GAN model is more adept\nat capturing the distribution of input samples than the SAIFE.\nHowever due to the convolutional structure in E-GAN, the\ntime complexity of the proposed algorithm is higher than that\nof the SAIFE model where a fully-connected architecture is\nenough [45].\nIn [46], a framework integrating Dynamic Bayesian Net-\nworks (DBNs) [147] and GANS was proposed to detect\nabnormalities. A distinctive aspect of this approach is the\nuse of a generalized state vector [148], consisting of the\nsignal feature extracted from the Stockwell Transform (ST)\nand the corresponding derivatives, as the input for the model.\nIn the proposed framework, DBNs are used to learn switching\nmodels where each switching variable can be associated with\na different linear dynamic model. This approach is particularly\nsuited for scenarios involving low-dimensionality data due to\nthe vocabulary size of switching variables. Conversely, CGAN\nis employed for scenarios involving high-dimensionality data.\nWhile GANs are capable of effectively managing a high\nnumber of different dynamic models implicitly, they have\na notable limitation: unlike DBNs, GANs cannot manage\nuncertainty with probabilistic knowledge [46].\nAccording the results in [46], it is demonstrated that ap-\nproaches utilizing generative learning of deep features yield\nsuperior results in anomaly detection when compared to\nconventional techniques, particularly the Cyclostationary Fea-\nture Detector (CFD) [149]. Therefore, the authors in [138]\nconducted a comparative analysis of three deep generative\nmodels: the CGAN, the ACGAN, and the VAE for spec-\ntrum anomaly detection in the millimeter Wave (mmWave)\ncommunications. Tested on a real dataset collect by The\nNational Instruments mmWave Transceiver System [138],\nall three models demonstrated commendable performance in\nanomaly detection, particularly the AC-GAN. The ROC curves\nfrom these tests confirmed that these models have a high\nprobability of detection while maintaining a low false alarm\nrate. Furthermore, the VAE model demonstrates more efficient\ncomputational performance in both the training and testing\nprocesses compared to the other two networks.\nSimilarly, the authors in [139] explored a range of generative\nmodel approaches, including U-Net WGAN, ResNet WGAN,\nand ResNet VAE applied to spectral density functions. The\nanomaly scoring mechanism employed varies with the model:\nbinary cross-entropy loss is used between the input and\nreconstruction for U-Net WGAN and ResNet VAE, while\nmean-squared error loss is applied for ResNet WGAN. For\ncomparison and validation, three well-known anomaly detec-\ntion methods are used as baselines: Isolation Forest [150],\nOne-class SVM [151], and fAnoGAN [152]. The results\ndemonstrate excellent performance of these generative models\ncompared to traditional baseline approaches for various types\nof anomalies. In particular, the Unet GAN achieves the highest\naverage in four out of the five metrics [139].\nAs summarized in Table VIII, GAI models showcase supe-\nrior performance in anomaly detection within complicated fea-\nture data than traditional AI models. However, some methods\ncannot be employed to characterize and classify the anomalous\nsignals [135], [138], which holds critical importance for the\nsubsequent maintenance and security of network equipment.\nConsequently, future research should concentrate on creating\nadvanced GAI models capable of detecting and classifying\nvarious anomalous signals.\nB. Data Reconstruction\nData reconstruction focuses on retrieving the original signal\nor information from corrupted or incomplete datasets [155].\nThis process involves various techniques to restore or approx-\nimate the original data, aiming to overcome the issues caused\nby interference and noise.\nTraditional reconstruction methods, based on sparse rep-\nresentation and low-rank matrix completion [156], assume\nthat both full-spectrum data and their corrupted counterparts\nare sparsely represented with a full-spectrum and a gapped-\nspectrum dictionary, respectively. Therefore, both representa-\ntions are similarly sparse and share identical sparse codes.\nConsequently, these reconstruction methods lack the ability\nand robustness to distinguish closely situated targets at high\nresolution accurately without prior knowledge of the missing\n17\nTABLE IX\nSUMMARY OF GAI FOR DATA RECONSTRUCTION IN PHYSICAL LAYER\nBLUE CIRCLES DESCRIBE THE METHODS; GREEN CORRECT MARKERS AND RED CROSS MARKERS REPRESENT PROS AND CONS RESPECTIVELY.\nTechniques\nReference\nAlgorithm\nPros & Cons\nData\nReconstruction\n[47]\nSARGAN\n● A GAN network to recover this missing spectral information\n✓ Not require any information of the missing band locations\n✓ All computational complexity is at the training phase.\n✗ The requirement for extensive training data\n[48]\nVAE-GAN\n● A VAE-GAN-based method for reconstructing DSSS signals\n✓ Avoid complex parametric analysis of the signal\n✓ Integrate DRSNs and self-attention in VAE-GAN\n✗ Unsatisfactory effect in low SNR\n[153]\nMTS-GAN\n● A high-precision reconstruction method for electromagnetic environment data based on MTS-GAN\n✓ Use the GRUI to simulate time irregularities\n✓ High accuracy and convergence speed\n✗ The specific requirements for training and implementing\n[154]\nVAE\n● Investigate the performance of VAEs and compare the results with standard AEs\n✓ Use SSIM metric instead of the peak signal-to-noise ratio\n✗ Limited in terms of the variety of noise models\n[49]\nCDDM\n● A channel denoising diffusion models for wireless communications to eliminate the channel noise\n✓ Eliminate the channel nosie under Rayleigh fading channel and AWGN channel\n✗ Relatively long sampling time\nfrequency bands. However, GAI models excel in learning\ncomplex data patterns, effectively reducing the dependency on\nprior knowledge of missing frequency bands. Moreover, GAI\nmodels leverage their advanced learning capabilities to data\ngaps, offering a more robust and flexible approach to signal\nreconstruction.\nIn [47], the authors introduced a GAN framework named\nSARGAN, designed to reconstruct missing spectral informa-\ntion in Ultra-wideband (UWB) radar systems across multiple\nfrequency bands. Specifically, SARGAN focuses on recov-\nering Synthetic Aperture Radar (SAR) data [157]. To train\nthe GAN model, the model uses numerous data pairs, each\ncomprising an uncorrupted scene and its frequency-corrupted\nversion. The corrupted datasets are simulated by removing\nrandom frequency bands from the original data. A significant\nadvantage over conventional spectral recovery methods is that\nthe proposed model does not need any prior knowledge of the\nmissing data. This is particularly beneficial in unpredictable\nscenarios including battlefield conditions, where jamming and\ninterference can occur unexpectedly. The simulation results\nshow that the recovered signals using SARGAN achieve an\naverage gain of over 18 dB in SNR, even when up to 90% of\nthe operating spectrum is missing.\nCompared to radar data, DSSS signals possess more com-\nplex structures which makes it challenging to characterize\naccurately the properties of a target signal. To extract more\nproperties such as Pseudonoise (PN) sequence [158], a method\nbased on VAE-GAN [72] for reconstructing DSSS signals was\nproposed in [48]. By integrating VAE and GAN, the encoder\nprovides the generator with a loss function that measures the\ndiscrepancy between real and generated data. Furthermore, the\nproposed framework incorporates a Deep Residual Shrinkage\nNetwork (DRSN) [159] and a self-attention mechanism [160]\ninto the encoder and discriminator. The DRSNs are effective\nin minimizing redundant information in the collected signal,\nparticularly noise-induced redundancy. Meanwhile, the self-\nattention mechanism facilitates the establishment of long-\ndistance dependencies within the input sequences. However,\nwhile the proposed model is adaptable to PN sequences with\nvarying code lengths, its performance in low SNR environ-\nments significantly diminishes. Particularly, when the SNR\nfalls below 13 dB, there is a sharp decline in the model’s\nperformance [48].\nGRUI Cell\nReal\nFake\nCalculate\nValue\nError\nDiscriminator\nGenerator\nPretrainer\nRandom Noise\nReal Data\nReconstructed \nData\n𝑡0\n𝑡2\n𝑡1\n𝑡3\nFrequency\nGRUI Cell\nGRUI Cell\n𝑡0\n𝑡2\n𝑡1\n𝑡3\nFrequency\nUpdate\nUpdate\nSingle-step \nLoop \nGeneration\nFig. 8.\nThe MTS-GAN data completion network structure [153]. The\ngenerator network is built by the gated loop unit GRUI for data interpolation.\nGRUI can simulate time irregularities allowing for more accurate extraction\nof the distribution characteristics of time-frequency signal data.\nTo improve the precision of reconstructing electromagnetic\nenvironment data, the authors in [153] developed a high-\nprecision method using a Multi-Component Time Series Gen-\neration Adversarial Network (MTS-GAN). This approach ef-\nfectively utilizes multivariate time series data to better capture\nthe correlations between the time and frequency domains of\nelectromagnetic data (Fig. 8). A key component of this method\nis the use of a Gate Recursive Unit (GRUI), which simulates\ntime irregularities. The GRUI allows for more accurate extrac-\ntion of the distribution characteristics of time-frequency signal\ndata and reduces the impact of random losses in time series.\nThe proposed method achieves high accuracy and ensures\nrapid convergence and iterative optimization speeds with the\n’Qingdao Offshore Measurement Data Set’ [153].\nBesides GANs, VAEs are recognized as another powerful\n18\nGAI model for effective data reconstruction. In [154], a VAE-\nbased model was proposed for data construction in noisy\nchannels. The AE and VAE models are particularly effective\nin regularizing the latent space distribution, a feature that is\nhighly beneficial in data reconstruction with Gaussian noise\nchannels. The VAE’s regularized latent space facilitates accu-\nrate decoding by the decoder, thus improving performance in\nnoisy settings. Consequently, when evaluated on the STL10\ndataset [161] using the Structural Similarity Index (SSIM)\nmetric [162], the VAE-based method demonstrates a smoother\noutput attributed to its inherent structure.\nDMs have garnered attention in the field of wireless commu-\nnications due to their inherent ability to progressively remove\nnoise, especially in aiding receivers to mitigate channel noise.\nIn response to this potential, the study [49] introduced Channel\nDenoising Diffusion Models (CDDM) specifically designed\nfor wireless communications. CDDM aims to leverage the\nnoise reduction properties of DMs to enhance the quality\nand reliability of signal reception in wireless communication\nchannels. CDDM is trained using a specialized noise schedule\nspecifically adapted to the wireless channel, enabling the effec-\ntive elimination of channel noise through sampling algorithm.\nThe training algorithm for the combined CDDM and JSCC\nsystem is structured into three distinct stages. In the first\nand last stages, the JSCC encoder and decoder are trained to\nminimize the reconstruction error. The second stage involves\nfixing the parameters of the JSCC encoder, thereby allowing\nthe CDDM to learn the distribution of latent representations.\nThis stage utilizes a noise schedule that closely simulates the\ndistribution of channel noise, rendering the CDDM adaptable\nto a variety of channel conditions. The results demonstrate that\nsystems incorporating CDDM consistently outperform those\nwithout CDDM across all SNR regimes, under both AWGN\nand Rayleigh fading channels. Notably, under an AWGN\nchannel and a Rayleigh fading channel at 20 dB SNR, the\nCDDM achieves 0.49 dB gain and 1.06 dB gain, respectively\n[49].\nThe applications of GAI for data reconstruction in Table\nIX showcase its remarkable ability to process and regenerate\nmissing or corrupted data, ensuring communication integrity.\nHowever, the performance is still limited in low SNR scenarios\n[48]. Therefore, proposing more accurate models in high noise\nsituations is a future direction.\nVI. FUTURE RESEARCH DIRECTION\nDespite its impressive capabilities in complex data feature\nextraction, reconstruction, and enhancement, the applications\nof GAI in physical layer security are still in its early stages.\nThis section aims to explore the open issues and research\ndirections related to the integration of GAI in physical layer\nsecurity.\nA. Model Improvements\nEnhancing physical layer security necessitates models that\nsignificantly advance in terms of robustness and efficiency re-\nquiring model improvements. By incorporating advanced neu-\nral network architectures, GAI systems can learn to simulate\nand counteract time related attack patterns more effectively\n[163]. Enhancements in adversarial training techniques will\nalso enable GAI models to better mitigate potential vulnerabil-\nities [164]. Moreover, GAI-aided information encryption may\nbe further explored in conjunction with the near-field beam fo-\ncusing via Extremely large-scale multiple-input-multipleoutput\n(XL-MIMO) that exploits the propagation characteristics of\nboth distance and direction. The latter enables to focus the\ntransmitted signal energy onto an intended user, so as not to\ninduce information leakage to eavesdroppers. This certainly\nenhances the physical layer security for emerging 6G Wireless\nequipped with XL-MIMO [165].\nB. Multi-scenario Deployment\nAs the deployment of GAI in physical layer security, its\napplication across various scenarios emerges as a critical area\nof focus. The intricate architecture of GAI poses challenges\nfor its implementation on edge devices, often requiring the\ntransmission of additional data [136]. Incorporating distributed\ndeployment strategies, GAI can efficiently leverage edge com-\nputing capabilities, thus minimizing latency and reducing the\nneed for extensive data transmission by processing information\ncloser to its source [166]. Furthermore, the Mixture of Experts\n(MoE) model can dynamically assign tasks to specialized sub-\nmodels or ‘experts’ [167]. It presents a promising avenue for\nenhancing the adaptability and efficiency of GAI in addressing\nthe multifaceted and intricate scenarios encountered in physi-\ncal layer security. Exploring the integration of the MoE model\nwith GAI to leverage the strengths of both approaches is a\nnoteworthy direction for future research.\nC. Resource-Efficient Optimization\nCompared with traditional AI, GAI usually requires more\nresources for training and inference due to its complex mission\nobjectives. It causes serious burden and impact on the normal\nprocess operation of the device, especially for devices with\nlimited resources such as mobile phones. Therefore, future\ndirections should emphasize the development of lightweight\nGAI models that can operate with minimal computational\nresources while maintaining high security standards [168].\nFor instance, adapting model pruning techniques to remove\nunnecessary parameters from GANs without compromising\ntheir ability to generate or discriminate can significantly re-\nduce the computational load [169]. Additionally, exploring\nfederated learning approaches could decentralize the training\nprocess, allowing GAIs to learn from diverse datasets across\nmultiple devices while ensuring data privacy and reducing\nthe need for centralized, powerful computing resources [170].\nThese strategies promise to enhance the scalability of GAIs\nin securing the physical layer and ensure their applicability in\nresource-constrained environments including IoT devices and\nedge computing platforms, where security and efficiency are\nparamount.\nD. Secure SemCom\n”GAI-aided Secure SemCom” is certainly a vital future\nresearch direction. The task-oriented SemCom aims at mini-\n19\nmizing the transmission overhead in resource-constrained net-\nworks, such as AI-native wireless networks [51]. Additionally,\nit focuses on performing a given task properly with the aid of\nGAI as well as knowledge base at both ends, even though\nthe reconstructed data is not exactly same as the original\ndata [120]. Consequently, the performance metric transitions\nfrom bit-level accuracy including BER, to the degree of task\nfulfillment within a specified QoE value, given the GAI with\nknowledge base is shared between the transceiver. Therefore,\nthis paradigm shift necessitates a reevaluation of GAI model\ndesign criteria within SemCom, focusing on task fulfillment\nlevels facilitated by the synergistic use of GAI and a shared\nknowledge base in physical layer security [121].\nVII. CONCLUSION\nThis paper has presented a comprehensive survey on the\napplications of GAI in physical layer security, attributed to\nits remarkable capabilities in extracting, reconstructing, and\nenhancing complex data features. It introduced the back-\nground of GAI, encompassing its architecture, classification,\nand foundational models. Subsequently, it explored various\nsecurity properties such as communication confidentiality,\nauthentication, availability, resilience, and integrity. Finally, it\nhighlighted crucial future research directions for generative\nAI in physical layer security, which underscores the potential\nof GAI to further enhance security measures, demonstrating\nits vital role in safeguarding communication networks against\nevolving security threats.\nREFERENCES\n[1] D. Baidoo-Anu and L. O. Ansah, “Education in the era of generative\nartificial intelligence (AI): Understanding the potential benefits of\nChatGPT in promoting teaching and learning,” Journal of AI, vol. 7,\nno. 1, pp. 52–62, Jan. 2023.\n[2] H. Du, D. Niyato, J. Kang, Z. Xiong, P. Zhang, S. Cui, X. Shen,\nS. Mao, Z. Han, A. Jamalipour et al., “The age of generative AI and\nAI-generated everything,” arXiv preprint arXiv:2311.00947, 2023.\n[3] Y. Cao, S. Li, Y. Liu, Z. Yan, Y. Dai, P. S. Yu, and L. Sun, “A compre-\nhensive survey of AI-generated content (AIGC): A history of generative\nai from GAN to ChatGPT,” arXiv preprint arXiv:2303.04226, 2023.\n[4] R. Rombach, A. Blattmann, D. Lorenz, P. Esser, and B. Ommer, “High-\nresolution image synthesis with latent diffusion models,” 2021.\n[5] J.\nBetker,\nG.\nGoh,\nL.\nJing,\nTimBrooks,\nJ.\nWang,\nL.\nLi,\nLongOuyang, JuntangZhuang, JoyceLee, YufeiGuo, WesamManassra,\nPrafullaDhariwal, CaseyChu, YunxinJiao, and A. Ramesh, “Improving\nimage generation with better captions.” [Online]. Available: https:\n//api.semanticscholar.org/CorpusID:264403242\n[6] T. Wu, S. He, J. Liu, S. Sun, K. Liu, Q.-L. Han, and Y. Tang, “A\nbrief overview of ChatGPT: The history, status quo and potential future\ndevelopment,” IEEE/CAA JAS, vol. 10, no. 5, pp. 1122–1136, May.\n2023.\n[7] I. K. Dutta, B. Ghosh, A. Carlson, M. Totaro, and M. Bayoumi,\n“Generative adversarial networks in security: a survey,” in Proceedings\nof the 11th IEEE Annual Ubiquitous Computing, Electronics & Mobile\nCommunication Conference.\nIEEE, 2020, pp. 0399–0405.\n[8] S. Aldossary and W. Allen, “Data security, privacy, availability and\nintegrity in cloud computing: issues and current solutions,” Int. J. Adv.\nComput. Sci. Appl., vol. 7, no. 4, Apr. 2016.\n[9] Y. Zhang, Y. Lu, R. Zhang, B. Ai, and D. Niyato, “Deep reinforcement\nlearning for secrecy energy efficiency maximization in ris-assisted\nnetworks,” IEEE Trans. Veh. Technol., 2023.\n[10] S. Kumar, S. Dalal, and V. Dixit, “The OSI model: Overview on the\nseven layers of computer networks,” Int. J. Comput. Sci. Inf. Technol.\nRes., vol. 2, no. 3, pp. 461–466, Mar. 2014.\n[11] J. Zhang, H. Du, Q. Sun, B. Ai, and D. W. K. Ng, “Physical\nlayer security enhancement with reconfigurable intelligent surface-\naided networks,” IEEE Trans. Inf. Forensics Secur., vol. 16, pp. 3480–\n3495, 2021.\n[12] Y.-S. Shiu, S. Y. Chang, H.-C. Wu, S. C.-H. Huang, and H.-H. Chen,\n“Physical layer security in wireless networks: A tutorial,” IEEE Wirel.\nCommun., vol. 18, no. 2, pp. 66–74, 2011.\n[13] Z. Lv, A. K. Singh, and J. Li, “Deep learning for security problems in\n5G heterogeneous networks,” IEEE Netw., vol. 35, no. 2, pp. 67–73,\n2021.\n[14] W. Wang, M. Zhu, X. Zeng, X. Ye, and Y. Sheng, “Malware traffic\nclassification using convolutional neural network for representation\nlearning,” in Proceedings of the International conference on informa-\ntion networking.\nIEEE, 2017, pp. 712–717.\n[15] R. Liao, H. Wen, F. Pan, H. Song, A. Xu, and Y. Jiang, “A novel phys-\nical layer authentication method with convolutional neural network,”\nin Proceedings of the IEEE International Conference on Artificial\nIntelligence and Computer Applications.\nIEEE, 2019, pp. 231–235.\n[16] D. Hong, Z. Zhang, and X. Xu, “Automatic modulation classification\nusing recurrent neural networks,” in Proceedings of the 3rd IEEE\nInternational Conference on Computer and Communications.\nIEEE,\n2017, pp. 695–700.\n[17] X. Xiao, B. Vasi´c, R. Tandon, and S. Lin, “Designing finite alphabet it-\nerative decoders of ldpc codes via recurrent quantized neural networks,”\nIEEE Trans. Commun., vol. 68, no. 7, pp. 3963–3974, 2020.\n[18] J. Kim and H. Kim, “Applying recurrent neural network to intrusion\ndetection with hessian free optimization,” in International Workshop\non Information Security Applications.\nSpringer, 2015, pp. 357–369.\n[19] J. Wang, H. Du, D. Niyato, J. Kang, S. Cui, X. Shen, and P. Zhang,\n“Generative ai for integrated sensing and communication: Insights from\nthe physical layer perspective,” arXiv preprint arXiv:2310.01036, 2023.\n[20] T. O’shea and J. Hoydis, “An introduction to deep learning for the\nphysical layer,” IEEE Trans. Cogn. Commun. Netw., vol. 3, no. 4, pp.\n563–575, 2017.\n[21] A. Karapantelakis, P. Alizadeh, A. Alabassi, K. Dey, and A. Nikou,\n“Generative ai in mobile networks: a survey,” Ann. Telecommun., pp.\n1–19, 2023.\n[22] N. Van Huynh, J. Wang, H. Du, D. T. Hoang, D. Niyato, D. N.\nNguyen, D. I. Kim, and K. B. Letaief, “Generative ai for physical layer\ncommunications: A survey,” arXiv preprint arXiv:2312.05594, 2023.\n[23] Z. Xu, W. Liu, J. Huang, C. Yang, J. Lu, and H. Tan, “Artificial\nintelligence for securing IoT services in edge computing: a survey,”\nSecur. Commun. Netw., vol. 2020, pp. 1–13, 2020.\n[24] H. Sharma and N. Kumar, “Deep learning based physical layer security\nfor terrestrial communications in 5G and beyond networks: A survey,”\nPhys. Commun., p. 102002, 2023.\n[25] J. Zhai, S. Zhang, J. Chen, and Q. He, “Autoencoder and its various\nvariants,” in Proceedings of the IEEE international conference on\nsystems, man, and cybernetics.\nIEEE, 2018, pp. 415–419.\n[26] I. Goodfellow, J. Pouget-Abadie, M. Mirza, B. Xu, D. Warde-Farley,\nS. Ozair, A. Courville, and Y. Bengio, “Generative adversarial net-\nworks,” Communications of the ACM, vol. 63, no. 11, pp. 139–144,\n2020.\n[27] J. Ho, A. Jain, and P. Abbeel, “Denoising diffusion probabilistic\nmodels,” Adv. Neural Inf. Process., vol. 33, pp. 6840–6851, 2020.\n[28] A. Smith and J. Downey, “A communication channel density estimating\ngenerative adversarial network,” in Proceedings of the IEEE Cognitive\nCommunications for Aerospace Applications Workshop.\nIEEE, 2019,\npp. 1–7.\n[29] C.-H. Lin, C.-C. Wu, K.-F. Chen, and T.-S. Lee, “A variational\nautoencoder-based secure transceiver design using deep learning,” in\nProceeding of IEEE Global Communications Conference. IEEE, 2020,\npp. 1–7.\n[30] M. Nemati, J. Park, and J. Choi, “VQ-VAE empowered wireless\ncommunication for joint source-channel coding and beyond,” 2023.\n[31] J. Han, Y. Zhou, G. Liu, T. Liu, and X. Zeng, “A novel physical layer\nkey generation method based on WGAN-GP adversarial autoencoder,”\nin Proceedings of the 4th International Conference on Communica-\ntions, Information System and Computer Engineering.\nIEEE, 2022,\npp. 1–6.\n[32] K. Merchant and B. Nousain, “Securing IoT RF fingerprinting systems\nwith generative adversarial networks,” in Proceedings of the IEEE\nMilitary Communications Conference.\nIEEE, 2019, pp. 584–589.\n[33] J. Gong, X. Xu, Y. Qin, and W. Dong, “A generative adversarial\nnetwork based framework for specific emitter characterization and\nidentification,” in Proceedings of the 11th International Conference\n20\non Wireless Communications and Signal Processing.\nIEEE, 2019, pp.\n1–6.\n[34] K. S. Germain and F. Kragh, “Mobile physical-layer authentica-\ntion using channel state information and conditional recurrent neural\nnetworks,” in Proceedings of the IEEE 93rd Vehicular Technology\nConference.\nIEEE, 2021, pp. 1–6.\n[35] R. Meng, X. Xu, B. Wang, H. Sun, S. Xia, S. Han, and P. Zhang,\n“Physical-layer authentication based on hierarchical variational autoen-\ncoder for industrial internet of things,” IEEE Internet Things J., vol. 10,\nno. 3, pp. 2528–2544, 2022.\n[36] T. Erpek, Y. E. Sagduyu, and Y. Shi, “Deep learning for launching and\nmitigating wireless jamming attacks,” IEEE Trans. Cogn. Commun.\nNetw., vol. 5, no. 1, pp. 2–14, 2018.\n[37] Y. Tang, Z. Zhao, X. Ye, S. Zheng, and L. Wang, “Jamming recognition\nbased on AC-VAEGAN,” in Proceedings of the 15th IEEE International\nConference on Signal Processing, vol. 1.\nIEEE, 2020, pp. 312–315.\n[38] H. Han, X. Wang, F. Gu, W. Li, Y. Cai, Y. Xu, and Y. Xu, “Better\nlate than never: GAN-enhanced dynamic anti-jamming spectrum access\nwith incomplete sensing information,” IEEE Wirel. Commun. Lett.,\nvol. 10, no. 8, pp. 1800–1804, 2021.\n[39] Y. Wang, X. Liu, and M. Wang, “A double network structure anti-\njamming algorithm based on deep reinforcement learning,” in J. Phys.\nConf. Ser., vol. 1982, no. 1.\nIOP Publishing, 2021, p. 012106.\n[40] Y. Shi, K. Davaslioglu, and Y. E. Sagduyu, “Generative adversarial\nnetwork for wireless signal spoofing,” in Proceedings of the ACM\nWorkshop on Wireless Security and Machine Learning, 2019, pp. 55–\n60.\n[41] M. Ma, Y. Zhang, T. Zhao, W. Zhang, and Z. He, “Controllable wireless\nspoofing attack based on conditional began and auxiliary channel\nsensing,” Electronics, vol. 12, no. 1, p. 84, 2022.\n[42] Y. Yang, L. Zhu, Q. He, and X. Deng, “A simple high-performance\ngeneration method for spoofing jamming signals,” in Proceedings of\nthe International Symposium on Networks, Computers and Communi-\ncations.\nIEEE, 2022, pp. 1–5.\n[43] S. Rajendran, W. Meert, V. Lenders, and S. Pollin, “Unsupervised\nwireless spectrum anomaly detection with interpretable features,” IEEE\nTrans. Cogn. Commun. Netw., vol. 5, no. 3, pp. 637–647, 2019.\n[44] S. Harini, K. Nivedha, S. K. BG, R. Gokul, B. Jayasree et al., “Data\nanomaly detection in wireless sensor networks using β-variational\nautoencoder,” in Proceedings of the International Conference on In-\ntelligent Systems for Communication, IoT and Security.\nIEEE, 2023,\npp. 631–636.\n[45] X. Zhou, J. Xiong, X. Zhang, X. Liu, and J. Wei, “A radio anomaly\ndetection algorithm based on modified generative adversarial network,”\nIEEE Wirel. Commun. Lett., vol. 10, no. 7, pp. 1552–1556, 2021.\n[46] A. Toma, A. Krayani, M. Farrukh, H. Qi, L. Marcenaro, Y. Gao, and\nC. S. Regazzoni, “Ai-based abnormality detection at the PHY-layer\nof cognitive radio by learning generative models,” IEEE Trans. Cogn.\nCommun. Netw., vol. 6, no. 1, pp. 21–34, 2020.\n[47] D. N. Tran, T. D. Tran, and L. Nguyen, “Generative adversarial\nnetworks for recovering missing spectral information,” in Proceedings\nof the IEEE Radar Conference.\nIEEE, 2018, pp. 1223–1227.\n[48] Q. Feng, J. Zhang, L. Chen, and F. Liu, “Waveform reconstruction of\nDSSS signal based on VAE-GAN,” Wirel. Commun. Mob. Comput.,\nvol. 2022, 2022.\n[49] T. Wu, Z. Chen, D. He, L. Qian, Y. Xu, M. Tao, and W. Zhang, “Cddm:\nChannel denoising diffusion models for wireless communications,”\narXiv preprint arXiv:2305.09161, 2023.\n[50] M. Xu, H. Du, D. Niyato, J. Kang, Z. Xiong, S. Mao, Z. Han,\nA. Jamalipour, D. I. Kim, X. Shen et al., “Unleashing the power\nof edge-cloud generative ai in mobile networks: A survey of aigc\nservices,” IEEE Commun. Surv. Tutor., 2024.\n[51] C. Liang, H. Du, Y. Sun, D. Niyato, J. Kang, D. Zhao, and M. A. Imran,\n“Generative ai-driven semantic communication networks: Architecture,\ntechnologies and applications,” arXiv preprint arXiv:2401.00124, 2023.\n[52] V.-L. Nguyen, P.-C. Lin, B.-C. Cheng, R.-H. Hwang, and Y.-D. Lin,\n“Security and privacy for 6G: A survey on prospective technologies\nand challenges,” IEEE Commun. Surv. Tutor., vol. 23, no. 4, pp. 2384–\n2428, 2021.\n[53] S. Santhosh Kumar, M. Selvi, A. Kannan et al., “A comprehensive\nsurvey on machine learning-based intrusion detection systems for\nsecure communication in internet of things,” Comput. Intell. Neurosci.,\nvol. 2023, 2023.\n[54] F. Alwahedi, A. Aldhaheri, M. A. Ferrag, A. Battah, and N. Tihanyi,\n“Machine learning techniques for iot security: Current research and\nfuture vision with generative ai and large language models,” Internet\nof Things and Cyber-Physical Systems, 2024.\n[55] A. K. Kamboj, P. Jindal, and P. Verma, “Machine learning-based\nphysical layer security: techniques, open challenges, and applications,”\nWirel. Netw., vol. 27, pp. 5351–5383, 2021.\n[56] H. Sharma, G. Sharma, and N. Kumar, “Ai-assisted secure data trans-\nmission techniques for next-generation hetnets: A review,” Comput.\nCommun., 2023.\n[57] J. Wang, H. Du, D. Niyato, M. Zhou, J. Kang, and H. V. Poor,\n“Acceleration estimation of signal propagation path length changes for\nwireless sensing,” arXiv preprint arXiv:2401.00160, 2023.\n[58] J. Wang, H. Du, D. Niyato, M. Zhou, J. Kang, Z. Xiong, and A. Ja-\nmalipour, “Through the wall detection and localization of autonomous\nmobile device in indoor scenario,” IEEE J. Sel. Areas Commun., 2023.\n[59] S. Samonas and D. Coss, “The CIA strikes back: Redefining confiden-\ntiality, integrity and availability in security.” J. Inf. Syst. Secur., vol. 10,\nno. 3, 2014.\n[60] J. M. Hamamreh, H. M. Furqan, and H. Arslan, “Classifications and\napplications of physical layer security techniques for confidentiality:\nA comprehensive survey,” IEEE Commun. Surv. Tutor., vol. 21, no. 2,\npp. 1773–1828, 2018.\n[61] L. Bai, L. Zhu, J. Liu, J. Choi, and W. Zhang, “Physical layer\nauthentication in wireless communication networks: A survey,” J.\nCommun. Inf. Netw., vol. 5, no. 3, pp. 237–264, 2020.\n[62] C. Shahriar, M. La Pan, M. Lichtman, T. C. Clancy, R. McGwier,\nR. Tandon, S. Sodagari, and J. H. Reed, “Phy-layer resiliency in ofdm\ncommunications: A tutorial,” IEEE Commun. Surv. Tutor., vol. 17,\nno. 1, pp. 292–314, 2014.\n[63] M. Shakiba-Herfeh, A. Chorti, and H. Vincent Poor, “Physical layer\nsecurity: Authentication, integrity, and confidentiality,” Physical layer\nsecurity, pp. 129–150, 2021.\n[64] H. Shen, X. Li, Q. Cheng, C. Zeng, G. Yang, H. Li, and L. Zhang,\n“Missing information reconstruction of remote sensing data: A tech-\nnical review,” IEEE Trans. Geosci. Remote Sens., vol. 3, no. 3, pp.\n61–85, 2015.\n[65] C. Doersch, “Tutorial on variational autoencoders,” arXiv preprint\narXiv:1606.05908, 2016.\n[66] A. Oussidi and A. Elhassouny, “Deep generative models: Survey,” in\nProceedings of the International conference on intelligent systems and\ncomputer vision.\nIEEE, 2018, pp. 1–8.\n[67] A. Van Den Oord, O. Vinyals et al., “Neural discrete representation\nlearning,” Adv. Neural Inf. Process., vol. 30, 2017.\n[68] M. Mirza and S. Osindero, “Conditional generative adversarial nets,”\narXiv preprint arXiv:1411.1784, 2014.\n[69] M. Arjovsky, S. Chintala, and L. Bottou, “Wasserstein gan,” 2017.\n[70] A. Odena, C. Olah, and J. Shlens, “Conditional image synthesis\nwith auxiliary classifier gans,” in Proceedings of the International\nconference on machine learning.\nPMLR, 2017, pp. 2642–2651.\n[71] A. Makhzani, J. Shlens, N. Jaitly, I. Goodfellow, and B. Frey, “Adver-\nsarial autoencoders,” arXiv preprint arXiv:1511.05644, 2015.\n[72] A. B. L. Larsen, S. K. Sønderby, H. Larochelle, and O. Winther,\n“Autoencoding beyond pixels using a learned similarity metric,” in\nInternational conference on machine learning.\nPMLR, 2016, pp.\n1558–1566.\n[73] R. Rombach, A. Blattmann, D. Lorenz, P. Esser, and B. Ommer,\n“High-resolution image synthesis with latent diffusion models,” in\nProceedings of the IEEE/CVF conference on computer vision and\npattern recognition, 2022, pp. 10 684–10 695.\n[74] Y. Zou, J. Zhu, X. Wang, and L. Hanzo, “A survey on wireless security:\nTechnical challenges, recent advances, and future trends,” Proc. IEEE,\nvol. 104, no. 9, pp. 1727–1765, 2016.\n[75] K.-L. Besser, C. R. Janda, P.-H. Lin, and E. A. Jorswieck, “Flexible\ndesign of finite blocklength wiretap codes by autoencoders,” in Pro-\nceedings of the IEEE International Conference on Acoustics, Speech\nand Signal Processing.\nIEEE, 2019, pp. 2512–2516.\n[76] E. Erdemir, P. L. Dragotti, and D. G¨und¨uz, “Privacy-aware communica-\ntion over a wiretap channel with generative networks,” in Proceedings\nof the IEEE International Conference on Acoustics, Speech and Signal\nProcessing.\nIEEE, 2022, pp. 2989–2993.\n[77] M. K. Fadul, D. R. Reising, K. Arasu, and M. R. Clark, “Adversarial\nmachine learning for enhanced spread spectrum communications,” in\nProceedings of the IEEE Military Communications Conference. IEEE,\n2021, pp. 783–788.\n[78] M. S. Sheikh, J. Liang, and W. Wang, “A survey of security services,\nattacks, and applications for vehicular ad hoc networks (vanets),”\nSensors, vol. 19, no. 16, p. 3589, 2019.\n[79] W. Shi, X. Jiang, J. Hu, Y. Teng, Y. Wang, H. He, R. Dong, F. Shu,\nand J. Wang, “Physical layer security techniques for future wireless\nnetworks,” arXiv preprint arXiv:2112.14469, 2021.\n21\n[80] P. Sweeney, Error control coding.\nPrentice Hall UK, 1991.\n[81] H. Mahdavifar and A. Vardy, “Achieving the secrecy capacity of\nwiretap channels using polar codes,” IEEE Trans. Inf. Theory, vol. 57,\nno. 10, pp. 6428–6443, 2011.\n[82] B. Sklar, “Rayleigh fading channels in mobile digital communication\nsystems. i. characterization,” IEEE Comm. Mag., vol. 35, no. 7, pp.\n90–100, 1997.\n[83] J.-Y. Zhu, R. Zhang, D. Pathak, T. Darrell, A. A. Efros, O. Wang, and\nE. Shechtman, “Toward multimodal image-to-image translation,” Adv.\nNeural Inf. Process., vol. 30, 2017.\n[84] N. Farsad, M. Rao, and A. Goldsmith, “Deep learning for joint source-\nchannel coding of text,” in Proceedings of the IEEE international\nconference on acoustics, speech and signal processing.\nIEEE, 2018,\npp. 2326–2330.\n[85] B. Sklar, Digital communications: fundamentals and applications.\nPearson, 2021.\n[86] J. Zhang, R. Woods, T. Q. Duong, A. Marshall, Y. Ding, Y. Huang,\nand Q. Xu, “Experimental study on key generation for physical layer\nsecurity in wireless communications,” IEEE Access, vol. 4, pp. 4464–\n4477, 2016.\n[87] G. Li, A. Hu, J. Zhang, L. Peng, C. Sun, and D. Cao, “High-agreement\nuncorrelated secret key generation based on principal component\nanalysis preprocessing,” IEEE Trans. Commun., vol. 66, no. 7, pp.\n3022–3034, 2018.\n[88] D. Roy, T. Mukherjee, M. Chatterjee, E. Blasch, and E. Pasiliao,\n“RFAL: Adversarial learning for rf transmitter identification and clas-\nsification,” IEEE Trans. Cogn. Commun. Netw., vol. 6, no. 2, pp. 783–\n801, 2019.\n[89] H. Han, L. Cui, W. Li, L. Huang, Y. Cai, J. Cai, and Y. Zhang, “Radio\nfrequency fingerprint based wireless transmitter identification against\nmalicious attacker: An adversarial learning approach,” in Proceedings\nof the International Conference on Wireless Communications and\nSignal Processing.\nIEEE, 2020, pp. 310–315.\n[90] K. S. Germain and F. Kragh, “Physical-layer authentication using chan-\nnel state information and machine learning,” in Proceedings of the 14th\nInternational Conference on Signal Processing and Communication\nSystems.\nIEEE, 2020, pp. 1–8.\n[91] F. Azam, S. K. Yadav, N. Priyadarshi, S. Padmanaban, and R. C.\nBansal, “A comprehensive review of authentication schemes in vehic-\nular ad-hoc network,” IEEE Access, vol. 9, pp. 31 309–31 321, 2021.\n[92] R. Zhang, K. Xiong, H. Du, D. Niyato, J. Kang, X. Shen, and\nH. V. Poor, “Generative ai-enabled vehicular networks: Fundamentals,\nframework, and case study,” arXiv preprint arXiv:2304.11098, 2023.\n[93] A. Jagannath, J. Jagannath, and P. S. P. V. Kumar, “A comprehensive\nsurvey on radio frequency (rf) fingerprinting: Traditional approaches,\ndeep learning, and open challenges,” Comput. Netw., vol. 219, p.\n109455, 2022.\n[94] K. Merchant, S. Revay, G. Stantchev, and B. Nousain, “Deep learning\nfor RF device fingerprinting in cognitive communication networks,”\nIEEE J. Sel. Top. Signal Process., vol. 12, no. 1, pp. 160–167, 2018.\n[95] R. Das, A. Gadre, S. Zhang, S. Kumar, and J. M. Moura, “A deep\nlearning approach to IoT authentication,” in Proceedings of the IEEE\ninternational conference on communications.\nIEEE, 2018, pp. 1–6.\n[96] Z. Gan, L. Chen, W. Wang, Y. Pu, Y. Zhang, H. Liu, C. Li, and L. Carin,\n“Triangle generative adversarial networks,” Adv. Neural Inf. Process.,\nvol. 30, 2017.\n[97] Z. Wang, W. Dou, M. Ma, X. Feng, Z. Huang, C. Zhang, Y. Guo,\nand D. Chen, “A survey of user authentication based on channel state\ninformation,” Wirel. Commun. Mob. Comput., vol. 2021, pp. 1–16,\n2021.\n[98] A. Siegman, “The antenna properties of optical heterodyne receivers,”\nApplied optics, vol. 5, no. 10, pp. 1588–1594, 1966.\n[99] S. Xia, X. Tao, N. Li, S. Wang, T. Sui, H. Wu, J. Xu, and Z. Han,\n“Multiple correlated attributes based physical layer authentication in\nwireless networks,” IEEE Trans. Veh. Technol., vol. 70, no. 2, pp. 1673–\n1687, 2021.\n[100] M. Bishop, M. Carvalho, R. Ford, and L. M. Mayron, “Resilience is\nmore than availability,” in Proceedings of the New Security Paradigms\nWorkshop, 2011, pp. 95–104.\n[101] W. Wang, Y. Xu, and M. Khanna, “A survey on the communication\narchitectures in smart grid,” Comput. Netw., vol. 55, no. 15, pp. 3604–\n3629, 2011.\n[102] P. F. de Araujo-Filho, G. Kaddoum, M. Naili, E. T. Fapi, and Z. Zhu,\n“Multi-objective GAN-based adversarial attack technique for modula-\ntion classifiers,” IEEE Commun. Lett., vol. 26, no. 7, pp. 1583–1587,\n2022.\n[103] Y. Cai, F. Song, Y. Xu, X. Liu, X. Zhang, and H. Han, “Spectrum\nwaterfall completion in jamming enviroment: A general adversarial\nnetworks method,” in Proceedings of the IEEE 9th Joint International\nInformation Technology and Artificial Intelligence Conference, vol. 9.\nIEEE, 2020, pp. 1661–1665.\n[104] H. Han, Y. Xu, Z. Jin, W. Li, X. Chen, G. Fang, and Y. Xu,\n“Primary-user-friendly dynamic spectrum anti-jamming access: A\nGAN-enhanced deep reinforcement learning approach,” IEEE Wirel.\nCommun. Lett., vol. 11, no. 2, pp. 258–262, 2021.\n[105] R. Lin, H. Qiu, J. Wang, Z. Zhang, L. Wu, and F. Shu, “Physical layer\nsecurity enhancement in energy harvesting-based cognitive internet of\nthings: A GAN-powered deep reinforcement learning approach,” IEEE\nInternet Things J., 2023.\n[106] R. Tang, D. Gao, M. Yang, T. Guo, H. Wu, and G. Shi, “GAN-\ninspired intelligent jamming and anti-jamming strategy for semantic\ncommunication systems,” in Proceedings of the IEEE International\nConference on Communications Workshops.\nIEEE, 2023, pp. 1623–\n1628.\n[107] E. Jayabalan and R. Pugazendi, “Generative adversarial networks for\nsecure data transmission in wireless network.” Intell. Autom. Soft\nComput., vol. 35, no. 3, 2023.\n[108] Y. Huo, Y. Tian, L. Ma, X. Cheng, and T. Jing, “Jamming strategies\nfor physical layer security,” IEEE Wirel. Commun., vol. 25, no. 1, pp.\n148–153, 2017.\n[109] H. Pirayesh and H. Zeng, “Jamming attacks and anti-jamming strategies\nin wireless networks: A comprehensive survey,” IEEE Commun. Surv.\nTutor., vol. 24, no. 2, pp. 767–809, 2022.\n[110] Z. Wu, Y. Zhao, Z. Yin, and H. Luo, “Jamming signals classification\nusing convolutional neural network,” in Proceedings of the IEEE Inter-\nnational Symposium on Signal Processing and Information Technology.\nIEEE, 2017, pp. 062–067.\n[111] Y. Cai, K. Shi, F. Song, Y. Xu, X. Wang, and H. Luan, “Jamming\npattern recognition using spectrum waterfall: A deep learning method,”\nin Proceedings of the IEEE 5th international conference on computer\nand communications.\nIEEE, 2019, pp. 2113–2117.\n[112] K. Arulkumaran, M. P. Deisenroth, M. Brundage, and A. A. Bharath,\n“Deep reinforcement learning: A brief survey,” IEEE Signal Process.\nMag., vol. 34, no. 6, pp. 26–38, 2017.\n[113] X. Wang, J. Wang, Y. Xu, J. Chen, L. Jia, X. Liu, and Y. Yang,\n“Dynamic spectrum anti-jamming communications: Challenges and\nopportunities,” IEEE Commun. Mag., vol. 58, no. 2, pp. 79–85, 2020.\n[114] X. Liu, Y. Xu, L. Jia, Q. Wu, and A. Anpalagan, “Anti-jamming com-\nmunications using spectrum waterfall: A deep reinforcement learning\napproach,” IEEE Commun. Lett., vol. 22, no. 5, pp. 998–1001, 2018.\n[115] Z. Li, J. Cao, H. Wang, and M. Zhao, “Sparsely self-supervised\ngenerative adversarial nets for radio frequency estimation,” IEEE J.\nSel. Areas Commun., vol. 37, no. 11, pp. 2428–2442, 2019.\n[116] S. Kavaiya, D. K. Patel, Z. Ding, Y. L. Guan, and S. Sun, “Physical\nlayer security in cognitive vehicular networks,” IEEE Trans. Commun.,\nvol. 69, no. 4, pp. 2557–2569, 2020.\n[117] Y. Wang, X. Liu, M. Wang, and Y. Yu, “A hidden anti-jamming\nmethod based on deep reinforcement learning,” arXiv preprint\narXiv:2012.12448, 2020.\n[118] D. S. Gurjar, H. H. Nguyen, and H. D. Tuan, “Wireless information\nand power transfer for IoT applications in overlay cognitive radio\nnetworks,” IEEE Internet Things J., vol. 6, no. 2, pp. 3257–3270, 2018.\n[119] D. Xu and H. Zhu, “Secure transmission for SWIPT IoT systems with\nfull-duplex IoT devices,” IEEE Internet Things J., vol. 6, no. 6, pp.\n10 915–10 933, 2019.\n[120] H. Du, J. Wang, D. Niyato, J. Kang, Z. Xiong, J. Zhang, and X. Shen,\n“Semantic communications for wireless sensing: RIS-aided encoding\nand self-supervised decoding,” IEEE J. Sel. Areas Commun., 2023.\n[121] H. Du, J. Wang, D. Niyato, J. Kang, Z. Xiong, M. Guizani, and D. I.\nKim, “Rethinking wireless communication security in semantic internet\nof things,” IEEE Wirel. Commun., vol. 30, no. 3, pp. 36–43, 2023.\n[122] Y. Shi, K. Davaslioglu, and Y. E. Sagduyu, “Generative adversarial\nnetwork in the air: Deep adversarial learning for wireless signal\nspoofing,” IEEE Trans. Cogn. Commun. Netw., vol. 7, no. 1, pp. 294–\n303, 2020.\n[123] T. Roy, T. O’Shea, and N. West, “Generative adversarial radio spectrum\nnetworks,” in Proceedings of the ACM Workshop on Wireless Security\nand Machine Learning, 2019, pp. 12–15.\n[124] J. Li, X. Zhu, M. Ouyang, W. Li, Z. Chen, and Q. Fu, “GNSS spoofing\njamming detection based on generative adversarial network,” IEEE\nSens. J., vol. 21, no. 20, pp. 22 823–22 832, 2021.\n22\n[125] M. H. Yılmaz and H. Arslan, “A survey: Spoofing attacks in physical\nlayer security,” in Proceedings of the IEEE 40th Local Computer\nNetworks Conference Workshops.\nIEEE, 2015, pp. 812–817.\n[126] NVIDIA, “Jetson Nano Developer Kit,” https://developer.nvidia.com/\nembedded/jetson-nano-developer-kit.\n[127] Xilinx, “Zynq UltraScale+ MPSoC,” https://www.xilinx.com/products/\nsilicon-devices/soc/zynq-ultrascalempsoc.html.\n[128] C. U. Ndujiuba, O. Oni, and A. E. Ibhaze, “Comparative analysis of\ndigital modulation techniques in LTE 4G systems,” J. Wirel. Commun.\nNetw., vol. 5, no. 2, pp. 60–66, Feb. 2015.\n[129] A. Marzouk, P. Barros, M. Eppe, and S. Wermter, “The conditional\nboundary equilibrium generative adversarial network and its application\nto facial attributes,” in Proceedings of the International Joint Confer-\nence on Neural Networks.\nIEEE, 2019, pp. 1–7.\n[130] E. D. Kaplan and C. Hegarty, Understanding GPS/GNSS: principles\nand applications.\nArtech house, 2017.\n[131] Y. Alginahi et al., “Preprocessing techniques in character recognition,”\nCharacter recognition, vol. 1, pp. 1–19, 2010.\n[132] J. Bhatti and T. E. Humphreys, “Hostile control of ships via false GPS\nsignals: Demonstration and detection,” Navig. J. Inst., vol. 64, no. 1,\npp. 51–66, 2017.\n[133] Q. Feng, Y. Zhang, C. Li, Z. Dou, and J. Wang, “Anomaly detection\nof spectrum in wireless communication via deep auto-encoders,” J.\nSupercomput., vol. 73, pp. 3161–3178, 2017.\n[134] A. Gkelias and K. K. Leung, “GAN-based detection of adversarial EM\nsignal waveforms,” in Proceedings of the IEEE Military Communica-\ntions Conference.\nIEEE, 2022, pp. 356–361.\n[135] D. Cheng, Y. Fan, S. Fang, M. Wang, and H. Liu, “ResNet-AE for\nradar signal anomaly detection,” Sens., vol. 22, no. 16, p. 6249, 2022.\n[136] T. Luo and S. G. Nagarajan, “Distributed anomaly detection using\nautoencoder neural networks in WSN for IoT,” in Proceedings of the\nIEEE international conference on communications.\nIEEE, 2018, pp.\n1–6.\n[137] H. Lu, M. Du, K. Qian, X. He, and K. Wang, “GAN-based data aug-\nmentation strategy for sensor anomaly detection in industrial robots,”\nIEEE Sens. J., vol. 22, no. 18, pp. 17 464–17 474, 2021.\n[138] A. Toma, A. Krayani, L. Marcenaro, Y. Gao, and C. S. Regazzoni,\n“Deep learning for spectrum anomaly detection in cognitive mmwave\nradios,” in Proceedings of the IEEE 31st Annual International Sympo-\nsium on Personal, Indoor and Mobile Radio Communications.\nIEEE,\n2020, pp. 1–7.\n[139] G. Rathinavel, N. Muralidhar, N. Ramakrishnan, and T. O’Shea,\n“Efficient generative wireless anomaly detection for next generation\nnetworks,” in Proceedings of the IEEE Military Communications\nConference.\nIEEE, 2022, pp. 594–599.\n[140] V. Chandola, A. Banerjee, and V. Kumar, “Anomaly detection: A\nsurvey,” ACM Comput. Surv., vol. 41, no. 3, pp. 1–58, 2009.\n[141] S. El Hajjami, J. Malki, M. Berrada, and B. Fourka, “Machine learning\nfor anomaly detection. performance study considering anomaly dis-\ntribution in an imbalanced dataset,” in Proceedings of the 5th Inter-\nnational Conference on Cloud Computing and Artificial Intelligence:\nTechnologies and Applications.\nIEEE, 2020, pp. 1–8.\n[142] Y. Liu, H. Du, D. Niyato, J. Kang, Z. Xiong, D. I. Kim, and\nA. Jamalipour, “Deep generative model and its applications in efficient\nwireless network management: A tutorial and case study,” arXiv\npreprint arXiv:2303.17114, 2023.\n[143] J. M. Elson and J. M. Bennett, “Calculation of the power spectral\ndensity from surface profile data,” Applied optics, vol. 34, no. 1, pp.\n201–208, 1995.\n[144] M.\nFil,\nM.\nMesinovic,\nM.\nMorris,\nand\nJ.\nWildberger,\n“beta-\nVAE reproducibility: Challenges and extensions,” arXiv preprint\narXiv:2112.14278, 2021.\n[145] F. Thabtah, S. Hammoud, F. Kamalov, and A. Gonsalves, “Data\nimbalance in classification: Experimental evaluation,” Inf. Sci., vol. 513,\npp. 429–441, 2020.\n[146] J. Lee and K. Park, “GAN-based imbalanced data intrusion detection\nsystem,” Pers. Ubiquitous Comput., vol. 25, pp. 121–128, 2021.\n[147] M. Ravanbakhsh, M. Baydoun, D. Campo, P. Marin, D. Martin,\nL. Marcenaro, and C. S. Regazzoni, “Learning multi-modal self-\nawareness models for autonomous vehicles from human driving,”\nin Proceedings of the 21st International Conference on Information\nFusion.\nIEEE, 2018, pp. 1866–1873.\n[148] K. Friston, B. Sengupta, and G. Auletta, “Cognitive dynamics: From\nattractors to active inference,” Proc. IEEE, vol. 102, no. 4, pp. 427–445,\n2014.\n[149] A. Martian, B. T. Sandu, O. Fratu, I. Marghescu, and R. Craciunescu,\n“Spectrum sensing based on spectral correlation for cognitive radio\nsystems,” in Proceedings of the 4th International Conference on\nWireless Communications, Vehicular Technology, Information Theory\nand Aerospace & Electronic Systems.\nIEEE, 2014, pp. 1–4.\n[150] F. T. Liu, K. M. Ting, and Z.-H. Zhou, “Isolation forest,” in Proceedings\nof the 8th ieee international conference on data mining.\nIEEE, 2008,\npp. 413–422.\n[151] Y. Wang, J. Wong, and A. Miner, “Anomaly intrusion detection using\none class SVM,” in Proceedings from the Fifth Annual IEEE SMC\nInformation Assurance Workshop.\nIEEE, 2004, pp. 358–364.\n[152] T. Schlegl, P. Seeb¨ock, S. M. Waldstein, G. Langs, and U. Schmidt-\nErfurth, “f-AnoGAN: Fast unsupervised anomaly detection with gen-\nerative adversarial networks,” Med. Image Anal., vol. 54, pp. 30–44,\n2019.\n[153] L. Guo, Y. Liu, Y. Li, and K. Yang, “High-precision reconstruction\nmethod based on MTS-GAN for electromagnetic environment data in\nsagiot,” Eurasip J. Adv. Signal Process, vol. 2023, no. 1, p. 125, 2023.\n[154] A. H. Estiri, M. R. Sabramooz, A. Banaei, A. H. Dehghan, B. Jami-\nalahmadi, and M. J. Siavoshani, “A variational auto-encoder approach\nfor image transmission in noisy channel,” in Proceedings of the 10th\nInternational Symposium onTelecommunications.\nIEEE, 2020, pp.\n227–233.\n[155] X. Chai, H. Gu, F. Li, H. Duan, X. Hu, and K. Lin, “Deep learning\nfor irregularly and regularly missing data reconstruction,” Scientific\nreports, vol. 10, no. 1, p. 3302, 2020.\n[156] L. H. Nguyen, T. Tran, and T. Do, “Sparse models and sparse recovery\nfor ultra-wideband SAR applications,” IEEE Trans. Aerosp. Electron.\nSyst., vol. 50, no. 2, pp. 940–958, Feb. 2014.\n[157] A. Moreira, P. Prats-Iraola, M. Younis, G. Krieger, I. Hajnsek, and K. P.\nPapathanassiou, “A tutorial on synthetic aperture radar,” IEEE Geosci.\nRemote Sens. Mag., vol. 1, no. 1, pp. 6–43, Jan. 2013.\n[158] T. Helleseth and C. Li, “Pseudo-noise sequences,” in Concise Encyclo-\npedia of Coding Theory. Chapman and Hall/CRC, 2021, pp. 613–644.\n[159] W. Jiang and A. Liu, “Image motion deblurring based on deep\nresidual shrinkage and generative adversarial networks,” Comput. Intell.\nNeurosci., vol. 2022, pp. 1–15, 2022.\n[160] A. Vaswani, N. Shazeer, N. Parmar, J. Uszkoreit, L. Jones, A. N.\nGomez, Ł. Kaiser, and I. Polosukhin, “Attention is all you need,” Proc.\nAdv. Neural Inf. Process. Syst., vol. 30, 2017.\n[161] A. Coates, A. Ng, and H. Lee, “An analysis of single-layer networks in\nunsupervised feature learning,” in Proceedings of the 14th international\nconference on artificial intelligence and statistics.\nJMLR Workshop\nand Conference Proceedings, 2011, pp. 215–223.\n[162] D. Brunet, E. R. Vrscay, and Z. Wang, “On the mathematical properties\nof the structural similarity index,” IEEE Trans. Image Process., vol. 21,\nno. 4, pp. 1488–1499, Apr. 2011.\n[163] Y. Jiang, S. Chang, and Z. Wang, “Transgan: Two transformers can\nmake one strong gan,” arXiv preprint arXiv:2102.07074, vol. 1, no. 3,\n2021.\n[164] T. K. Boppana and P. Bagade, “GAN-AE: An unsupervised intrusion\ndetection system for MQTT networks,” Eng Appl Artif Intell, vol. 119,\np. 105805, 2023.\n[165] Z. Wang, J. Zhang, H. Du, D. Niyato, S. Cui, B. Ai, M. Debbah,\nK. B. Letaief, and H. V. Poor, “A tutorial on extremely large-scale\nMIMO for 6G: Fundamentals, signal processing, and applications,”\nIEEE Commun. Surv. Tutor., 2024.\n[166] H. Du, R. Zhang, D. Niyato, J. Kang, Z. Xiong, D. I. Kim, X. S. Shen,\nand H. V. Poor, “Exploring collaborative distributed diffusion-based\nAI-generated content (AIGC) in wireless networks,” IEEE Network,\nno. 99, pp. 1–8, 2023.\n[167] Y. Shi, B. Paige, P. Torr et al., “Variational mixture-of-experts autoen-\ncoders for multi-modal deep generative models,” Proc. Adv. Neural Inf.\nProcess. Syst., vol. 32, 2019.\n[168] J. Chen, G. Liu, and X. Chen, “AnimeGAN: A novel lightweight\ngan for photo animation,” in International symposium on intelligence\ncomputation and applications.\nSpringer, 2020, pp. 242–256.\n[169] D. M. Vo, A. Sugimoto, and H. Nakayama, “PPCD-GAN: Progressive\npruning and class-aware distillation for large-scale conditional GANs\ncompression,” in Proceedings of the IEEE/CVF Winter Conference on\nApplications of Computer Vision, 2022, pp. 2436–2444.\n[170] H. Du, R. Zhang, Y. Liu, J. Wang, Y. Lin, Z. Li, D. Niyato, J. Kang,\nZ. Xiong, S. Cui et al., “Beyond deep reinforcement learning: A tutorial\non generative diffusion models in network optimization,” arXiv preprint\narXiv:2308.05384, 2023.\n"
}