{
    "optim": "1 Generative AI for Secure Physical Layer Communications: A Survey Changyuan Zhao, Hongyang Du, Dusit Niyato, Fellow, IEEE, Jiawen Kang, Zehui Xiong, Dong In Kim, Fellow, IEEE, Xuemin (Sherman) Shen, Fellow, IEEE, and Khaled B. Letaief, Fellow, IEEE Abstract—Generative Artificial Intelligence (GAI) stands at the forefront of AI innovation, demonstrating rapid advancement and unparalleled proficiency in generating diverse content. Beyond content creation, GAI has significant analytical abilities to learn complex data distribution, offering numerous opportunities to resolve security issues. In the realm of security from physical layer perspectives, traditional AI approaches frequently struggle, primarily due to their limited capacity to dynamically adjust to the evolving physical attributes of transmission channels and the complexity of contemporary cyber threats. This adaptability and analytical depth are precisely where GAI excels. Therefore, in this paper, we offer an extensive survey on the various applications of GAI in enhancing security within the physical layer of communication networks. We first emphasize the importance of advanced GAI models in this area, including Generative Adversarial Networks (GANs), Autoencoders (AEs), Variational Autoencoders (VAEs), and Diffusion Models (DMs). We delve into the roles of GAI in addressing challenges of physical layer security, focusing on communication confidentiality, authentica- tion, availability, resilience, and integrity. Furthermore, we also present future research directions focusing model improvements, multi-scenario deployment, resource-efficient optimization, and secure semantic communication, highlighting the multifaceted potential of GAI to address emerging challenges in secure physical layer communications and sensing. Index Terms—Generative AI, physical layer communications, physical layer security, wireless sensor network, anomaly detec- tion. I. INTRODUCTION Generative Artificial Intelligence (GAI) represents a trans- formative category of Artificial Intelligence (AI) technologies capable of creating content, ranging from text, images, music, to complex simulations [1]. As a kind of unsupervised learn- ing, GAI is trained on vast amounts of data to understand the underlying structure and dynamics of that data. Unlike traditional AI, which primarily focuses on analyzing and C. Zhao, H. Du, and D. Niyato are with the School of Computer Sci- ence and Engineering, Nanyang Technological University, Singapore (e-mail: zhao0441@e.ntu.edu.sg; hongyang001@e.ntu.edu.sg; dniyato@ntu.edu.sg). J. Kang is with the School of Automation, Guangdong University of Technology, China. (e-mail: kavinkang@gdut.edu.cn). Z. Xiong is with the Pillar of Information Systems Technology and Design, Singapore University of Technology and Design, Singapore (e-mail: zehui xiong@sutd.edu.sg). D. I. Kim is with the Department of Electrical and Computer Engineering, Sungkyunkwan University, Suwon 16419, South Korea (email:dikim@skku.ac.kr). X. Shen is with the Department of Electrical and Computer Engineering, University of Waterloo, Canada (e-mail: sshen@uwaterloo.ca). Khaled B. Letaief is with the Department of Electrical and Computer Engineering, Hong Kong University of Science and Technology, Hong Kong (e-mail: eekhaled@ust.hk). interpreting data, GAI takes a step further by generating new, original outputs based on learned patterns and datasets [2]. Once trained, these models can produce outputs that mimic the original data’s style, tone, and complexity, often indistin- guishable from content produced by humans [3]. Reflecting on its inherent capabilities, GAI has been successfully deployed in a wide range of mature applications across different fields, including Stable Diffusion [4], DALL-E 3 [5], and ChatGPT [6], etc. Beyond its prowess in generating varied content forms, GAI also demonstrates powerful capabilities in enhancing cy- bersecurity measures, by generating sophisticated simulations and datasets for threat detection and system strengthening [7]. The innovative essence and wide-ranging applicability of GAI have captivated the research community, leading to an upsurge in interest to uncover its capabilities in addressing intricate challenges and driving innovation across various fields. In wireless communications, security is a critical aspect of modern information technology, ensuring the confidentiality, integrity, and availability of data transmitted across networks [8]. Techniques such as encryption, secure socket layers, and digital signatures are employed to protect sensitive information during its transmission over the internet or other communica- tion networks [9]. In the Open Systems Interconnection model of communications [10], physical layer security plays a pivotal role in protecting communication networks by utilizing the inherent physical characteristics of the communication channel to thwart unauthorized access and guarantee data integrity [11]. This fundamental security layer capitalizes on the inher- ent unpredictability of channel properties, serving to enhance conventional encryption techniques by adding an extra layer of defense against eavesdropping and cyber-attacks. Given its critical significance, researchers have dedicated extensive efforts to conduct in-depth studies on physical layer security [12]. With the advancement of AI, the integration of Deep Learning (DL) methods has revolutionized communication security, offering enhanced capabilities for anomaly detection, automatic threat identification, and adaptive security measures based on real-time data analysis [13]. For instance, Convo- lutional Neural Networks (CNNs) are employed to design physical layer security techniques such as in the development of an intrusion detection system [14], multi-user authentication [15]. In addition, Recurrent Neural Networks (RNNs) have found utility in various studies including automatic modulation classification [16], secure channel coding [17], and intrusion detection [18]. However, traditional AI methods often fall short in address- arXiv:2402.13553v1  [cs.CR]  21 Feb 2024 2 Generative AI for Secure Physical Layer Communications and Sensing Introduction Related Surveys GAI for Communication Networks [21], [22], etc; AI for Secure Communication [23], [24], etc. Background Knowledge Security Issues in Physical Layer Confidentiality, Authentication, Availability, Resilience and Integrity Overview of GAI AEs and VAEs [25]; GANs [26]; DMs [27]. Communication Confidentiality and Authentication Secure Communication Encryption: GAN [28], SVAE [29], etc. Anti-eavesdropping: VQ-VAE [30], WGAN-GP [31], etc. Communication Authentication RF Fingerprinting: GAN [32], Triple-GAN [33], etc. CSI: CGAN [34], etc. CIR: VAE-PLA [35], etc. Communication Availability and Resilience Anti-jamming Strategy Jamming Recognition: GAN [36], AC-VAEGAN [37], etc. Anti-jamming: GAN [38], ADRLDN [39], etc. Spoofing Defense GAN [40], CBEGAN [41], SJG-GAN [42], etc. Communication Integrity Anomaly Detection Score-based: SAIFE [43] , β-VAE [44], etc. Prediction-based: E-GAN [45], CGAN [46], etc. Data Reconstruction SARGAN [47], VAE-GAN [48], CDDM [49], etc. Future Research Direction Conclusion Fig. 1. The structure of the survey paper, where we introduce GAI methods for physical layer security through Communication Confidentiality and Authentication (Section III), Communication Availability and Resilience (Section IV), and Communication Integrity (Section V). ing physical layer security challenges due to their inability to dynamically adapt to the continuously changing physical characteristics of transmission channels and the sophisticated nature of modern cyber threats [19]. Specifically, traditional AI models are typically trained on datasets from specific environments, limiting their effectiveness when deployed in unfamiliar conditions. Furthermore, the complexity and vari- ability of noise patterns, signal interference, and channel conditions within the physical layer lead to difficulties in collecting sufficient labeled data for physical layer attacks. This challenge necessitates the development of sophisticated AI models capable of learning from and adapting to these ever-changing environmental factors, thereby ensuring the continuous maintenance of robust security measures [20]. Confronted with the critical challenges in secure physical layer communications, and recognizing the distinct advantages provided by GAI, this paper provides a thorough survey of GAI’s applications in tackling various issues in physical layer security. A. Related Surveys and Contribution 1) GAI for Communication Networks: Recent literature has witnessed a notable increase in the exploration of GAI applications within communication networks (Table I). The work [21] delves into the utilization of GAI to address con- temporary challenges in mobile telecommunications networks. This article underscores the pivotal role of generative AI in the advancement of mobile network technologies, particularly in the overcoming of existing obstacles. [50] shifts the focus to the deployment of Artificial Intelligence Generated Con- tent (AIGC) in mobile networks, providing comprehensive insights into Generative AI and mobile edge intelligence. Additionally, [51] investigates the interplay between GAI and Semantic Communication (SemCom) in wireless networks. Their research demonstrates the utility of GAI in the creation, transmission, and efficient management of information within these networks. Moreover, the authors in [22] present an analysis of GAI applications in the physical layer, addressing various applications but the security issues are not the main focus. 2) AI for Secure Communication: AI has significantly transformed the landscape of communication network security and privacy. In [52], a systematic overview is presented on prospective technologies for 6G networks, focusing on the physical, connection, and service layers, along with lessons learned from existing security architectures. The authors in [23] discuss the contribution of AI to Internet of Things (IoTs) security within Edge Computing (EC) environments, particularly emphasizing AI’s role in augmenting security features. Regarding attack detection, [53] provides a detailed survey on AI-based intrusion detection systems, with a focus on securing communication within the IoT. Similarly, [54] delves into machine learning applications, with a specific emphasis on cyber threat detection in IoT environments. For Physical-Layer Security, the utilization of AI in optimizing and designing intelligent physical layer security techniques is thoroughly explored in [56]. [55] introduces intelligent 3 TABLE I SUMMARY OF RELATED SURVEYS Scope Reference Emphasis Overview GAI for Communication Networks [21] GAI in mobile networks A survey of the recent work in the field of GAI with application to mobile telecommunications networks [50] Edge-Cloud GAI An overview of research activities related to AIGC, GAI, and mobile edge intelligence [51] GAI-driven SemCom A summary on the interplay between GAI and SemCom in wireless communication networks [22] GAI for Physical Layer Communications A survey of GAI’s applications to address diverse problems in physical layer communications AI for Secure Communication [23] AI for IoT security A summary of the contribution of AI to the IoT security in Edge computing [52] AI for Security and Privacy of 6G A overview of security and privacy issues based on prospective technologies for 6G in the physical, connection, and service layers [53] AI-based Intrusion Detection System A survey on machine learning-based intrusion detection systems for secure communication in IoTs [54] AI in IoT Security A overview of applying machine learning for cyber threat detection in IoT environments [55] AI-based Physical Layer Security A summary on intelligent wireless physical layer security by concentration on physical layer authentication, antenna selection, and relay node selection [56] AI-assisted Secure Data Transmission An in-depth analysis of the role of AI in optimizing and designing the intelligent physical layer security techniques [24] AI-based Physical Layer Security A survey about employing DL-based physical layer security techniques for solving various security concerns in 5G and beyond networks wireless physical layer security by concentrating on physical layer authentication, antenna selection, and relay node selec- tion. In a related vein, [24] investigates DL based physical layer security techniques, concentrating on their application in addressing various security concerns in 5G and beyond networks. However, it is noted that there is a lack of detailed analysis regarding the role of GAI in physical layer security. Distinct from existing surveys and tutorials, our survey distinguishes itself by specifically focusing on the integration of GAI in secure physical layer for communication networks. Unlike previous works, which either broadly address GAI applications in communication networks or delve into AI’s role in network security without a concentrated emphasis on GAI, this survey offers a unique perspective by marrying the capabilities of GAI with the requirements of physical layer security. It fills a critical gap in the literature by providing an in-depth analysis of how GAI can enhance security measures, detect and mitigate threats in the physical layer that have been previously underexplored or only briefly mentioned. The key contributions of this paper are summarized as follows: • Our comprehensive analysis reveals how to employ GAI models to enhance key security properties such as com- munication confidentiality, authentication, availability, re- silience, and integrity. These advancements are facilitated by GAI’s ability to understand complex data distributions, perform encrypted data transformation and processing, and detect cyber threats and anomalies within the network infrastructure. This summary provides essential insights for further exploration and development of GAI applica- tions in physical layer security. • We explore how GAI addresses the challenges of data sparsity and incompleteness in physical layer security, which significantly impact the efficacy of traditional AI models. GAI’s contribution to data reconstruction and augmentation showcases its unparalleled ability to en- hance physical layer security, surpassing the limitations of tranditional AI approaches. • We outline crucial future research directions for the applications of GAI in physical layer security, includ- ing model improvements, multi-scenario deployment, resource-efficient optimization and secure semantic com- munication. These directions are considered from multi- ple perspectives, underscoring the multifaceted potential of GAI to address emerging challenges. The structure of this survey is outlined in Fig. 1. Section II introduces the fundamental concepts of GAI and offer a review of related works. In section III, a comprehensive exploration into Communication Confidentiality and Authentication is presented. Section IV discusses approaches for Communica- tion Availability and Resilience. Section V introduces GAI methods for Communication Integrity. Section VI discusses future research directions, and Section VII concludes the paper. Additionally, Table II lists the abbreviations commonly employed throughout this survey. II. BACKGROUND KNOWLEDGE In this section, we delve into the security challenges inherent to the physical layer of communication networks, arguing that addressing security at this foundational level is of paramount importance. Furthermore, we introduce the fundamental con- cepts of GAI, including its architecture, classification, and basic models. A. Security Issues in Physical Layer Security at the physical layer is deemed paramount com- pared to other layers since it provides the foundation for all subsequent security protocols [57]. Therefore, a breach at this foundational level will jeopardize the entire communication system. This layer is susceptible to a broad spectrum of phys- ical threats, including eavesdropping, jamming, and spoofing, making it a critical point of vulnerability that must be robustly protected [58]. By securing the physical layer, potential attacks 4 TABLE II LIST OF ABBREVIATIONS Abbreviation Description Abbreviation Description AI Artificial Intelligence GAI Generative Artificial Intelligence CNN Convolutional Neural Network RNN Recurrent Neural Networks AIGC Artificial Intelligence Generated Content DL Deep Learning DAI Discriminative AI AE Autoencoder VAE Variational Autoencoder GAN Generative Adversarial Network DM Diffusion Models DRL Deep Reinforcement Learning WGAN-GP Wasserstein GAN with Gradient Penalty CGAN Conditional GAN ACGAN Auxiliary Classifier GAN AAE Adversarial Autoencoder SNR Signal-to-Noise Ratio JNR Jamming-to-Noise Ratio PCA Principal Component Analysis MIMO Multi-Input Multi-Output CIR Channel Impulse Response CSI Channel State Information RF Radio Frequency LSTM Long Short-Term Memory SU Secondary User PU Primary User SemCom Semantic Communication IoT Internet of Things EC Edge Computing EH Energy Harvesting JSCC Joint Source Channel Coding BER Bit Error Rate AWGN Additive White Gaussian Noise BLER Block Error Rate TABLE III THE USE OF GAI IN THE PHYSICAL LAYER AND ITS POTENTIAL SUPPORT FOR SECURITY Issues Model GANs AEs and VAEs DMs Communication & Sensing Perspectives Confidentiality ● key generation ● channel response approximations ● anti-eavesdropping communications ● wiretap code design ● transceiver design ● VAE-based JSCC - Potential benefits for communication: ✓ Robustness to the changing environment ✓ Simulate noise channel effects ✓ Utilize time-varying information ✓ Extract valuable features various data Availability ● jamming recognition ● anti-jamming strategy - - Resilience ● spoofing recognition ● spoofing defense - - Integrity ● sensors anomaly detection ● signals anomaly detection ● radio anomaly detection ● spectral information completion ● electromagnetic data reconstruction ● spectrum anomaly detec- tion ● sensors anomaly detection ● DSSS signals reconstruc- tion ● noise elimination Potential benefits for sensing: ✓ Identify abnormal sensors ✓ Not affected by data imblance ✓ Avoid complex parametric analysis of the signals ✓ Not require any information of the missing band locations Authentication ● RF fingerprinting authentication ● CSI authentication ● CIR authentication - can be preemptively thwarted, thereby preventing attackers’ initial access points for further intrusions. The subsequent discussion will introduce the CIA triad [59]: Confidentiality, Integrity, and Availability, alongside two additional critical focuses: Resilience and Authentication in physical layer security. • Communication Confidentiality: Communication con- fidentiality in the physical layer involves the use of techniques and mechanisms to secure data transmission over communication channels, preventing unauthorized access and eavesdropping. This approach leverages the properties of the physical layer, such as noise and signal characteristics, to enhance security by making it difficult for attackers to intercept or decode the transmitted infor- mation [60]. • Communication Authentication: Communication au- thentication at the physical layer is a critical security measure that verifies the identities of entities engaged in data exchange to thwart impersonation and unauthorized access. This verification leverages unique attributes intrin- sic to the transmission’s physical medium, such as radio- frequency fingerprints or specific channel properties. By authenticating that the communication is genuine and emanates from a verified source, this process significantly bolsters security and integrity in the exchange of data [61]. • Communication Availability: Ensuring communication availability at the physical layer, particularly through anti-jamming measures, involves deploying strategies and mechanisms to protect wireless communication networks from deliberate interference or jamming attacks. Tech- niques such as frequency hopping and direct sequence spread spectrum are pivotal, as they disperse the signal across a broader bandwidth, complicating the attacker’s ability to disrupt communications [12]. • Communication Resilience: Communication resilience at the physical layer, particularly in safeguarding against a range of attacks, where spoofing attacks being a typical example, necessitates the implementation of strategies aimed at detecting and neutralizing attacks signals. Cen- tral to this defensive approach is the use of unique physical features or signatures, such as Radio Frequency (RF) fingerprints or channel state information. By ex- ploiting these intrinsic properties, networks are equipped to distinguish authentic signals from those fabricated by spoofers, significantly maintaining secure and reliable communications [62]. • Communication Integrity: To safeguard communication 5 integrity at the physical layer, it is essential to detect anomalous data and complete missing information [63]. Techniques such as DL algorithms are employed to learn normal behavior patterns and subsequently identify out- liers or irregularities in real-time data flows. Furthermore, data reconstruction techniques are applied to correct or mitigate the impact of these anomalies and incomplete data, guaranteeing the precise and dependable transmis- sion of information [64]. B. Overview of GAI GAI aims to learn the underlying features of input data to generate new content that is similar to real data, in contrast to Discriminative AI (DAI), which focuses on predicting the probability or labels of data. GAI is capable of generating a wide variety of data, including text, images, videos, and so on [1]. Usually, these generated outputs are refereed as AIGC. With the widespread adoption of AIGC, there has been a significant boost in the efficiency of content creation, even revolutionizing the production paradigms of several companies and individual creators. Currently, GAI models used in commnication networks can be categorized as follows: • Autoencoder (AEs) and Variational Autoencoders (VAEs): An Autoencoder is a type of artificial neural network used to learn efficient codings of unlabeled data in an unsupervised manner [25]. It works by compress- ing the input into a lower-dimensional code and then reconstructing the output from this representation as close as possible to the original input. By shifting from a deterministic encoding process to a probabilistic one, VAEs can learn to represent input data as a distribution in latent space [65]. Through latent distributions, VAEs generate new instances that resemble the input data by sampling from the learned distribution in the latent space, making them highly effective in tasks including image generation, data augmentation, and anomaly detection [66]. Building upon the foundational principles of VAEs, more advanced variants such as the Vector Quantized- Variational Autoencoder (VQ-VAE) have been devel- oped, which incorporates a discrete latent representation through vector quantization to improve the generation quality [67]. In summary, AEs and VAEs offer signif- icant benefits, including their ability to learn complex distributions and generate new data points. However, they have limitations such as the tendency to produce blurry outputs, and challenges in balancing the reconstruction fidelity and the latent space regularization during training [3]. • Generative Adversarial Networks (GANs): Generative Adversarial Network model is a form of unsupervised learning [26]. Within a GAN, the generator network is re- sponsible for creating data, and concurrently, the discrim- inator network assesses the authenticity of this generated data. Using an adversarial mechanism, the discriminator is trained to discern between real and fake data, while the generator aims to produce data that is indiscernible from real data. GANs have evolved into diverse variants, each enhancing the original concept for specific purposes. The Conditional GAN (CGAN) introduces conditionality to direct the generative process with greater precision [68]. In parallel, the Wasserstein GAN with Gradient Penalty (WGAN-GP) marks a significant stride in stabilizing the training process, adeptly countering the prevalent issue of mode collapse with its innovative loss function [69]. The Auxiliary Classifier GAN (ACGAN) ingeniously integrates an auxiliary classifier into the discriminator, thereby elevating the fidelity and diversity of the gener- ated images [70]. The Adversarial Autoencoder (AAE) forges a pathway by blending AEs with adversarial train- ing, enforcing specialized distributions within the latent space [71]. The Variational Auto-Encoding Generative Adversarial Network (VAEGAN) synergizes the struc- tured latent spaces of VAEs with the superior generation capabilities of GANs [72]. Collectively, GANs excel in generating high-quality, realistic content and learning data distributions without explicit modeling. However, they are challenged by training difficulties, potential for mode collapse, and the generation of nonsensical outputs. • Diffusion Models (DMs): Diffusion Model, also known as the score-based generative model, is a novel type of generative model inspired by non-equilibrium ther- modynamics [27]. Similarly to VAE, DMs aim to learn the distribution of the original data. By adding noise to the original data, the data distribution can approach a normal distribution. Through denoising steps, the noise from the normal distribution is reverted back to data from the original distribution. Diffusion models are proficient in generating highly realistic data, but their long training times and computational intensity highlight the potential for further efficiency improvements in this emerging method [73]. Given the powerful generative capabilities, GAI has been deployed in a multitude of applications, including image and video synthesis, data augmentation and so on. More recently, the integration of GAI into physical layer security in wireless communications is a burgeoning field with promising potential. To be more specific, GAI can play several roles in enhancing security at the physical layer: 1) Encrypted Com- munication; 2) Signals Authentication; 3) Attacks Defense; 4) Anomaly Detection; 5) Adaptive Signal Processing (Table III). III. COMMUNICATION CONFIDENTIALITY AND AUTHENTICATION In wireless communications, the principles of confidentiality and authentication stand as critical pillars ensuring the security and integrity of transmitted information [63]. However, cyber threats, such as eavesdropping and unauthenticated attacks in physical layer, significantly compromise communication secu- rity, leading to unauthorized access and information breaches [74]. This section provides an overview of employing GAI techniques to ensure communication confidentiality and au- thenticity. 6 TABLE IV SUMMARY OF GAI FOR SECURE COMMUNICATION IN PHYSICAL LAYER BLUE CIRCLES DESCRIBE THE METHODS; GREEN CORRECT MARKERS AND RED CROSS MARKERS REPRESENT PROS AND CONS RESPECTIVELY. Techniques Reference Algorithm Pros & Cons Encrypted Communication [75] AE ● A flexible wiretap code design for Gaussian wiretap channels under finite blocklength by neural network AEs ✓ Flexibility to trade-off between the BLER and leakage. ✓ Achieve decent performance with simple network structures. ✗ Slightly worse performance than the polar wiretap codes. ✗ Trained with fixed SNR. [28] GAN ● The GAN architecture to learn non-linearities, memory effects, and non-Gaussian statistics. ✓ Approximate the channel response under different conditions. ✗ Based on a specific distribution dataset. [29] SVAE ● A DL-based transceiver design for secrecy systems ✓ Novel loss to measure the information leakage ✓ Robustness to the changing environment ✓ Trained in an unsupervised fashion without labeling effort ✗ Limited scalability of the code. ✗ Learning high-dimensional codes is computationally challenging. Anti-eavesdropping [76] VAE ● A data-driven approach using VAE-based JSCC ✓ A joint source channel coding framework ✓ Hide the sensitive information different from the original signal ✗ The eavesdropper’s channel quality is assumed to be significantly worse. [30] VQ-VAE ● A JSCC scheme based on VQ-VAE for point-to-point wireless communication ✓ Simulate noise channel effects ✓ Learn joint codewords incorporating the characteristics of the message channel ✗ Highly dependent on training set [77] GAN ● A GAN inspired approach using DSSS to ensure that a transmitter and receiver can communicate safe ✓ Use low Peak Side Lobe to improve model convergence ✓ Use of multiple spreading codes instead of one shared code ✗ Relatively high reconstruction accuracy of eavesdroppers [31] WGAN-GP ● A physical layer key generation method based on WGAN-GP AAE ✓ Overcome the difficulty of quantifying the extracted features ✓ Reduce the quantization complexity ✗ The key randomness is related to the interpretability of neural network. A. Secure Communication Eavesdropping is a typical attack in physical layer which involves intercepting and accessing confidential information transmitted over networks [78]. To improve confidentiality and achieve anti-eavesdropping, secure data is usually encrypted through various encryption algorithms [79]. However, once the math problem used for encryption is solved effective, the security of the encryption method will be seriously compro- mised. Moreover, several transitional methods including Error- Correcting Codes (ECCs) [80] suffer from a dilemma that they cannot achieve the trade-off between the reliability and data leakage because of the fixed code parameters. GAI methods, particularly those employing AEs or VAEs, offer enhanced security via generating complex structures that are difficult to decipher or reverse-engineer. AEs, characterized by its encoder and decoder components, enable the efficient encoding of information into a compressed, less interpretable format for transmission. Based on this, the authors proposed a AE-based framework in [75], which allows a flexible design of finite blocklength wiretap codes (Fig. 2). The operating point with respect to the trade-off between Block Error Rate (BLER) and information leakage can be changed easily due to the higher flexibility. In the scenario with Additive White Gaussian Noise (AWGN) channels as noise [75], all tested AEs perform slightly worse than the polar wiretap code [81]. The proposed framework achieve a BLER of around 26.2% and a leakage around 1.46bits while the polar wiretap code achieves a leakage around 1.33bits at a similar BLER of around 26.4% [75]. Even though the performance is Transmitter A. Wiretap System Receiver Eavesdropper AWGN Encoder Decoder AWGN B. AE-Based Secure Transceiver C. VAE-Based Secure Transceiver Messages  𝑀 Random Bit ෡𝑀 Encoder Leakage Estimation AWGN Decoder 𝑀′ 𝑍 MSE(𝑀′, 𝑀) MI(𝑀, 𝑍) Update Decoder Messages  𝑀 Random Bit ෡𝑀 Encoder Leakage Estimation 𝑀′ 𝑍 MSE(𝑀′, 𝑀) MI(𝑀, 𝑍) Update AWGN KL Divergence Fig. 2. The overall architecture of the AE-Based [75] and VAE-Based secure transceiver [29]. Part A demonstrates a wiretap system model with AWGN. Part B illustrates the whole framework of AE-Based secure transceiver, which is trained by two loss functions: the mean-squared error between transmitter messages and reconstructed messages and the mutual information between the messages and the received symbols by the eavesdropper. In Part C, the VAE-Based secure transceiver adds additional loss function: KL divergence. 7 not better than the polar wiretap code, the proposed framework can take the advantage of the flexibility to trade-off between the BLER and leakage, and may improve performance with deeper neural networks. To train a secure communication system based on AEs, loss gradients need to be passed backward from the output layer of the receiver to the input layer of the transmitter. However, a practical challenge arises due to the unknown gradients of the physical channel. This issue is often circumvented by assuming channel models with known analytic expressions, such as AWGN and Rayleigh fading channels [82]. However, these models may not accurately reflect real-world channel conditions. To overcome this limitation, the authors in [28] proposed a communication channel density estimating GAN, inspired by BicycleGAN [83]. The proposed method focuses on channels characterized by a combination of non-linear amplifier distortion, pulse shape filtering, inter-symbol inter- ference, frequency-dependent group delay, multipath, and non- Gaussian statistics. They conducted a comparative analysis of the marginalized probability density functions of the channel with a trained generator. Through experiments conducted on four different channels, the results indicate that the proposed model is capable of generating high-accuracy approximations of the channel [28]. One of the shortcomings of this AE-based framework is that it is trained based on the fixed Signal-to-Noise Ratio (SNR). When the SNR varies in the testing phase, their method cannot provide the optimal solution. To address this issue, the authors in [29] proposed a VAE-based scheme for secrecy systems in changing environment (Fig. 2). In this framework, they proposed a secure VAE (SVAE) to perform as a transceiver designed with a loss function which can mea- sure the information leakage. Its loss function is specifically designed to increase the difficulty for eavesdroppers to recover data, thereby meeting diverse application requirements of the transceiver. In experiments, Bit Error Rate (BER) is adopted to evaluate the communication quality. Compared with the AE-based method [75], the BER of SVAE achieves around 5 × 10−6 when SNR is 10 dB where the BER of AE-based achieves 10−2 in a perfect CSI scenario. Moreover, the BER at eavesdropper of SVAE does not decrease and keep at 0.5 where AE-based’s BER has marked decrease [29]. With this high BER at eavesdropper and low BER at legitimate, the eavesdropper cannot recover correct information and the legitimate can keep a high communication quality. However, the model in [75] only focuses on channel coding, where source and channel coding are performed separately, might not be as efficient in dynamic communication networks. Joint Source Channel Coding (JSCC) can dynamically adjust the coding strategy based on both the source content and the channel conditions which is more suitable for dynamic networks [84]. The authors in [76] proposed a data-driven approach using VAE-based JSCC. The proposed model aims to minimize the information leakage and emphasises hiding an underlying sensitive information. The VAE enables precise control over latent distributions and practical variational ap- proximation computation, crucial for calculating information security dynamics in the proposed model. Evaluated on col- ored MNIST dataset, the proposed method provides minimally distorted source transmission with maximum channel capacity [76]. Similarly, the authors of [30] proposed a VQ-VAE [67] based JSCC wireless communication framework. This frame- work interprets both channel and source encoder (ENC) and decoder (DEC) as variational techniques. A notable feature of the VQ-VAE is the codebook, which facilitates the modeling of noisy channels in communication. Specifically, noise is represented by codeword through an index of binary digits to improve generalization [85]. Similarly, distortion can be injected between the ENC and DEC to emulate a noisy chan- nel, enhancing the quality of communication. Furthermore, the ENC, DEC, and codebook are intricately dependent on the dataset and channel conditions during the training phase [30]. Leveraging this dependency, the framework can be adapted for secure and private communication applications specifically to prevent eavesdropping. In such scenarios, an eavesdropper would face significant challenges in accurately reconstructing the intended message without prior knowledge of the specific ENC and codebook used. Beyond directly employing VAEs for encoding transmitted information, [77] investigated the application of a GAN- inspired model for covert communication through Direct- Sequence Spread Spectrum (DSSS). This model is designed to secure communications between two parties, Alice and Bob, by preventing an eavesdropper, Eve, from detecting in an AWGN environment. In this setup, Alice transmits a message to Bob using a spreading code from a shared codebook. The GAN-inspired model utilizes the information eavesdropped by Eve to generate the spreading code used by Alice and Bob. The system is jointly trained with a combined loss function, aiming to minimize Bob’s reconstruction error while maximizing Eve’s. Furthermore, spreading sequences with low Peak Side Lobe can improve model convergence. However, when Eve employs Auto-Correlation-based Detection techniques, Eve detectd the presence of the DSSS signal with an accuracy of 70% at -6 dB SNRs or higher [77]. This significant level of detection accuracy indicates that the proposed method must adopt more proactive strategies to ensure enhanced security in communications. Key generation that exploits the unpredictable character- istics of wireless channels can provide information-theoretic security for communication confidentiality [86]. By utilizing the unique and unpredictable characteristics of channels, key generation methods can effectively prevent eavesdroppers from gaining access to the encrypted data. However, when directly adopting AEs or VAEs, the unpredictability of the hidden layer output and the inability to estimate high-dimensional features in advance pose challenges for applying these methods to key generation in the physical layer of communication systems. Therefore, a physical layer key generation method based on WGAN-GP [69] based AAE was proposed in [31]. This model is designed to efficiently extract features between legitimate nodes in a way that these features align with a Gaussian distribution. Compared with the Principal Component Analysis (PCA) method [87], the proposed method can yield higher security key capacity and a lower key error rate 15% which 8 TABLE V SUMMARY OF GAI FOR COMMUNICATION AUTHENTICATION IN PHYSICAL LAYER BLUE CIRCLES DESCRIBE THE METHODS; GREEN CORRECT MARKERS AND RED CROSS MARKERS REPRESENT PROS AND CONS RESPECTIVELY. Techniques Reference Algorithm Pros & Cons RF Fingerprinting Authentication [32] GAN ● A GAN framework adapted for use within the RF fingerprinting context ✓ Introduce a weakness in conventional AI methods ✓ Augment the train dataset. ✗ Cannot handle fast time-varying information [88] GAN ● A framework for building a robust system to identify rogue RF transmitters ✓ Exploit transmitter specific “signatures” including I/Q imbalance ✗ Require additional classifier [89] GAN ● A robust wireless transmitter identification scheme using GAN ✓ Use a multi-classifier to both detect attackers and transmitters ✗ Real wireless channel effect is not reflected [33] Triple-GAN ● A semi-supervised specific emitter identification using GAN ✓ A semi-supervised classification ✗ Require relatively long training time CSI Authentication [90] GAN ● The use of GAN and measured MIMO communications channel information to make a decision on Authentication ✓ Effective in a variety of wireless environments ✓ Use adversarial training for the discriminative model ✗ Cannot handle fast time-varying information ✗ Relatively limited performance at low SNR [34] CGAN ● A method for physical layer authentication using two variations of CGAN ✓ Utilize time-varying CSI as conditional input ✓ Handle stochastic nature of the wireless channel ✗ Not outstanding performance. CIR Authentication [35] HVAE-PLA ● HVAE algorithm applied for learning industrial wireless channels ✓ Without requiring attackers’ prior channel information ✓ Extract valuable features of high-dimensional CIRs ✗ Require relatively long training time ✗ A trade-off between the involved class number and the authentication performance is lower than PCA with feedback, and 10% lower than the without feedback PCA. Additionally, the key generation ratio of this method is much higher than that achieved with PCA [31]. As summarized in Table IV, due to its ability to learn dis- tributions and extract features, GAI can significantly improve the security of data transmission by generating encryption algorithms preventing evolving threats. However, existing en- cryption methods [28], [29], [75] mostly depend on specific dataset reducing the generality of the method. Improving the generalization ability of the GAI model while maintaining accuracy may be a research direction in the future. In addition, communication quality depends greatly on the interpretability of neural networks [31], which is still an open question. B. Communication Authentication In communication networks, safety-critical messages, which are essential for the safe operation and coordination of sys- tems, are frequently transmitted. These include vital commu- nications such as collision warnings, speed limit notifications, and updates on traffic conditions in vehicular networks [91], [92]. To ensure these messages are genuine and trustworthy, implementing an authentication process is a critical measure to thwart malicious activities. RF fingerprinting is a technique used to identify and authen- ticate wireless devices based on the distinctive characteristics inherent in RF signals. Given its ability to accurately pinpoint the source of a transmission, RF fingerprinting is seen as a crucial tool for device authentication and access control [93]. Recently, several traditional AI methods have been adopted as the standard approach for RF fingerprinting. In [94], a CNN framework was proposed to distinguish transmitters by the estimated error present in their transmitted waveforms. A Long Short-Term Memory (LSTM) network model was proposed in [95]. However, the authors in [32] revealed a weakness in the training processes of these approaches that a malicious GAN can be trained to introduce signal imperfections without modifying the bandwidth or data contents of the signal to force classifier errors. Then they showed that the classifier, trained by the augmented dataset with adversarial examples from GAN, can mitigate this vulnerability. The experiment results demonstrate that the Receiver Operating Characteristic (ROC) curves with GAN-augmented training has nearly 1 Area Under the Curve (AUC), where 90% of the networks without GAN perform even worse than random guessing at 40 dB SNR [32]. Similarly, in [88] the Radio Frequency Adversarial Learning (RFAL) framework was proposed for building a robust system to identify rogue RF transmitters by designing and implementing a GAN. The GAN utilizes the In- phase and Quadrature (IQ) imbalance [93] to extract unique high-dimensional features from the RF signals. Using the augmented data from the generator in GAN, a discriminator model can classify the trusted transmitters and the counterfeit ones with 99.9% accuracy. Inspired by [88], the authors in [89] proposed a GAN based wireless transmitter identification scheme. The proposed framework uses a multi-classifier to both detect malicious attacker and classify trusted transmitter without any extra classifier. Once trained, discriminators are employed to check whether the captured unknown IQ data comes from a corre- sponding trusted transmitter. If the label vector, made up of 1s 9 and 0s, shows all 0s, the data is not from a trusted source, sug- gesting a high probability of it being sourced from an attacker. Additionally, the authors in [33] introduced the Triple-GAN structure [96] to adopt semi-supervised classification. With the modified structure, the classification accuracy of the proposed framework can achieve over 90%, only 1% of the training data samples are labeled [33]. Channel State Information (CSI) is an important parameter of a communication link in the physical layer. By leveraging its unique properties, CSI can be utilized in an authentication context [92], [97]. Once a transmitter is initially authenticated by certain methods such as RF fingerprinting, the receiver maintains this authentication status as long as the variations in the received CSI remain below a certain threshold compared to the CSI from previous transmissions. However, attackers can modify various aspects of their transmission setup, including antenna properties, transmission timing, power levels, or use reflectors [98]. These alterations enable them to change their CSI as measured by the receiver. To address these issues, the author in [90] proposed a GAN based model to authenticate devices in Multi-Input Multi- Output (MIMO) communication systems. The proposed model employs adversarial training to improve the authentication process. The discriminative model at the receiver is trained by a generator that creates fake CSI samples looking like the authentic samples. Simulation results show that the discrimi- nator achieves 100% accuracy for SNR greater than or equal to 10 dB. For SNR less than 10 dB, while the discriminator makes errors in correctly recognizing legitimate samples, it consistently succeeds in preventing illegitimate samples from being authenticated [90]. To handle the time-varying CSI in fast-changing environ- ment, the authors in [34] proposed a CGAN based model combining with LSTM and gated recurrent unit (GRU) cells. Compared with the method in [90], the proposed model utilizes a CGAN instead of a conventional one, which can incorporate the previous CSI elements associated with time as the conditional information (Fig. 3). This approach allows for a more detailed generation and analysis of CSI data in the temporal aspect and historical patterns. In experximents, the CGAN-GRU network typically performed as well as or better than the standalone LSTM or GRU networks. Especially when mean-square error threshold is -25 dB, all of them can achieve accuracy at almost 99% [34]. In addition to CSI, the Channel Impulse Response (CIR) is another significant parameter in wireless communications providing a detailed characterization of how a wireless signal propagates from the transmitter to the receiver in a spe- cific environment. In [35], the authors proposed a CIR-based hierarchical VAE physical-layer authentication (HVAE-PLA) scheme. The HVAE-PLA consists of an AE module and a VAE module. The AE module is dedicated to extracting the characteristics of CIR, providing insights into how signals propagate in specific environments. The VAE module building upon this aims to enhance the representational capacity of the extracted CIR characteristics. Compared with a conventional AI method in [99], the proposed scheme can authenticate the spoofing nodes in all positions in the static dataset. Moreover, the simulations show that the proposed method can improve the authentication performance by 17.18%–69.3% compared to the vanilla AEs and VAEs [35]. Error Generator Discriminator Training Samples Previous Samples Previous Samples Noise Update Update [0,1] Deployment Channel State  Information B. Model A. CGAN Fig. 3. Proposed CGAN training architecture in [34]. In Part A, the conditional information is the previous magnitudes of the CSI elements associated with time. The output of the discriminator is the probability value, representing the likelihood from zero to one based on its perception of whether the sample is fake or authentic. Part B illustrates the system model structure. The integration of GAI in communication authentication through specific information has highlighted GAI’s ability to enhance the uniqueness and reliability of identifying devices in a network, as summarized in Table V. However, generative models require relatively long training and inference times due to their complex structure [33]. When facing fast time-varying information [32], they have difficulty to infer and adapt to additional new information in real time. Therefore, pruning the model size and enhancing model real-time adaptation are urgently needed for security authorization. IV. COMMUNICATION AVAILABILITY AND RESILIENCE The concepts of communication availability and resilience emerge as fundamental components to maintain continuous and reliable access for communication systems [100]. Chal- lenges such as network disruptions and deliberate cyber attacks can severely impact the availability of digital communication services, leading to significant downtime and loss of con- nectivity [101]. This section aims to explore the integration of advanced strategies and GAI techniques to ensure the communication availability and resilience via solving two common cyber attacks: jamming and spoofing in physical layers. A. Anti-jamming Strategy The jamming attack is a vital threat to communication availability at the physical layer, aimed at disrupting legitimate communications by introducing noise [108]. Therefore, to ensure communication availability, detecting and mitigating 10 TABLE VI SUMMARY OF GAI FOR ANTI-JAMMING STRATEGY IN PHYSICAL LAYER BLUE CIRCLES DESCRIBE THE METHODS; GREEN CORRECT MARKERS AND RED CROSS MARKERS REPRESENT PROS AND CONS RESPECTIVELY. Techniques Reference Algorithm Pros & Cons Jamming Recognition [36] GAN ● An adversarial machine learning approach launch jamming attacks on wireless communications and a defense strategy ✓ Rely on a small amount of sample data ✓ Do not need any knowledge of transmitter’s algorithm ✗ Limited resilience of the strategy in highly dynamic and unpredictable wireless environments [102] GAN ● An input-agnostic adversarial attack technique based on GANs and multi-task loss ✓ Quickly craft small imperceptible perturbations ✓ Not depend on the original samples ✗ Just consider certain scenarios [37] AC-VAEGAN ● A jamming recognition method based on AC-VAEGAN ✓ Stable recognition performance in the case of small samples ✗ Require relatively long training time ✗ Unsuitable for large-scale deployment [103] GAN ● An algorithm based on GAN TO mine the relationship of the data and complete the missing data ✓ Complete spectrum data in multiple jamming patterns ✗ Less emphasis on real-world testing Anti-Jamming [38] GAN ● A GAN based spectrum completion network ✓ Complete the partially missing spectrum data ✓ Achieve high reward of the policy ✗ Slightly poor performance in the high missing rate scenario [104] GAN ● A PU-friendly dynamic spectrum anti-jamming access scheme combining offline training and online deployment ✓ Focus on both PU and SU ✓ Converge fast to the optimal policy ✗ Still slow convergence speed [39] ADRLDN ● A decision related judgment module between jammer and user based on GAN ✓ Adapt to complex types of jamming ✓ Superior in anti-jamming performance than the current anti-jamming method ✗ Require relatively long training time [105] GAN ● The secrecy communication in an EH-enabled Cognitive EH-CIoT network with a cooperative jammer ✓ Maximize the system’s secrecy rate while minimizing the SOP ✗ Potential limitations in real-world implementation ✗ complexity of the DRL framework [106] GAN ● An intelligent jamming and anti-jamming framework to analyze and promote the security of semantic commu- nication ✓ A GAN-like game strategy to reflect the relationship between the semantic jammer and receiver ✗ Not suitable for other multilingual model [107] GDNN ● A communication model in cognitive radios using machine learning to learn the dynamics of jamming attacks ✓ Adapt to the dynamics of the spectrum ✗ Require relatively long training time jamming attacks represents a critical initial defense. There are several conventional methods employed wireless jamming attacks, including random and sensing-based jamming [109]. However, with the increasing integration of machine learn- ing techniques into communication systems, both legitimate transmitters and malicious jammers leverage machine learning algorithms to understand the spectrum environment better which introduces new emerging types of attacks including adversarial attacks. In [36], the authors present an adversarial learning strategy employing GAN to facilitate adversarial jamming attacks. This approach enables jammers to generate synthetic data based on a small number of real data samples. These syn- thetic samples are then integrated into the training dataset. Simulation results indicate that the detection accuracy of a jammer closely approximates, within 0.19% for misdetection and 3.14% for false alarms, that of a jammer trained with a larger dataset of real samples collected over a long duration [36]. Furthermore, based on the attack characteristics, they proposed a defense strategy for the transmitter, centered on rendering its behavior unpredictable. This can be achieved by the transmitter intentionally performing incorrect actions, such as transmitting on a busy channel or refraining from transmit- ting on an idle channel, during strategically selected time slots. Additionally, the authors in [102] proposed an input-agnostic adversarial attack technique, which adopts GAN to create perturbations in advance. These pre-generated perturbations can then be efficiently applied to a variety of incoming signals. Furthermore, this approach has the potential to substantially aid in the development of classifiers that exhibit robustness against adversarial jamming attacks. In the case of small sample datasets, the performance of autonomous feature extraction and classification of DL will be reduced [110]. Especially in real-world network communi- cations, it is difficult to obtain enough sample data for anti- jamming due to the privacy policy and the inadequacy of technical methods. To generate more realistic data, the authors in [37] proposed a jamming recognition method based on AC- VAEGAN, which combines the VAEGAN [72] and ACGAN [70]. In this model, the latent space of a small amount of signal dataset is obtained by VAE firstly. Then, the datasets will be expanded by sampling points of the latent space and decoding them. Finally, the discriminator of the GAN framework is extracted for jamming recognition. In experiments, when the 11 Jamming-to-Noise Ratio (JNR) is -10dB, the average correct recognition rate of AC-VAEGAN network is approximately 65%, where the rate of ACGAN and CNN network is only about 55% [37]. Original  Spectrum A. Generator B. Discriminator Real Fake Real Fake Convolution Convolution De-Convolution Fully Connected Label Spectrum Mask  Partial  Noise Mask Generated Mask Deployment Cognition Link Agent Jammer Jammer C. Model Fig. 4. The overall network structure in [103]. Part A illustrates the generator, which is designed as an AE comprising a convolution layer, a fully connected layer, and a de-convolution layer. In Part B, two discriminator modules are crafted using a convolution network and are optimized to focus on local and global details, respectively. Part B describes the system model structure. Except the scarcity of data, the occurrence of jamming attacks frequently leads to incomplete data, which hinders the ability of anti-jamming strategies to discern jamming attacks [36]. To complete the missing information, the authors in [103] proposed an efficient algorithm based on a GAN focusing on spectrum waterfall completion, where spectrum waterfall is a thermodynamic block diagram defining the environmental state [111]. The algorithm can automatically mine the relationship of the data and complete the missing data accurately. Different from the noise input in the original GAN, they use the spectrum waterfall with missing data as generator input, which can limit generator artistry (Fig. 4). From the corresponding complement results, the proposed algorithm is better than the method without pre-classification, since the generator that adds auxiliary information is more targeted to the data. The accuracy is more than 95%, where the latter is nearly 80% [103]. Several studies have demonstrated that anti-jamming com- munications, enhanced by Deep Reinforcement Learning (DRL) [112], can achieve near-optimal performance in dy- namic and unpredictable environments [113], [114]. In [38], the authors proposed a framework combining the GAN and DRL. The proposed framework consists of two stages: the offline stage and online stage (Fig. 5). Initially, a GAN is trained to complete missing spectrum data using historical data. Once the GAN training is complete, the generator is implemented as Spectrum Completion Network (SCN) during the online stage. Subsequently, with the augmented spec- trum data, a DRL-based Channel Selection Network (CSN) is employed. The CSN utilizes the enriched spectrum data to assist users in selecting optimal communication channels for anti-jamming. The performance of the proposed scheme notably surpasses that of the conventional DRL-based method in [114], as well as the scheme that combines K-Nearest- Neighbor Interpolation (KNNI) and DRL [115] in all missing rates. Especially, the proposed scheme achieves the discounted accumulative reward of 8.3 when the missing rate is 10%. In comparison, the conventional method scores 4.4, and the KNNI-DRL combination scores 6.5 [38]. Additionally, the authors in [104] introduced a dynamic spectrum anti-jamming access scheme in the cognitive radio based network [116] that is friendly to Primary Users (PU) while also safeguarding Secondary Users (SU) from indis- criminate jamming attack by jammers. Similar to the scheme in [38], this proposed framework is divided into two stages: the offline stage and the online stage where the key difference lies in the GAN model used in the first stage. Here, the GAN is trained to accurately simulate the Spectrum Environment (SE), which is considered a Virtual Environment (VE). By pre-training the Channel Decision Network (CDN) offline in this VE, the SU is equipped to evade both PU signals and jamming in the actual SE, following the guidance of the trained CDN. According to the experiments, it takes about 90s for the proposed scheme to converge to the optimal policy while the CDN trained in SE from scratch spends about 160s [104]. Existing anti-jamming technologies rely on hidden anti- jamming strategies, but their performance tends to diminish when facing with more sophisticated or complex jamming types [117]. In [39], the authors proposed a DRL algorithm with a double network structure, named ADRLDN, which adopts the hidden anti-jamming idea and can deal with var- ious types of complex jamming in actual scenarios. In this framework, they designed a GAN network-based user and jammer decision-making correlation judgment module. The GAN is trained to fit the environmental state under known user information, and evaluates whether the user information is obtained by the jammer. The DRL network is trained to guarantee the user’s decision not obtained by jammers. In this situation, there are two key points: compare the fitted environmental state with the real environmental state; ensure both the generation and the evaluation of the effect of the network. These happen to be the essential characteristics of GAN networks. According to the simulation experiment results, ADRLDN is superior in anti-jamming performance than the current anti-jamming method based on avoiding the idea (ADRLA) [114] by reducing the probability of users being jammed by 15%. As for Cognitive Internet of Things (CIoT), a major chal- lenge is extending the system’s lifespan. Energy Harvesting (EH) technology is a promising solution to provide sustainable energy to energy-constrained mobile devices in CIoT systems [118], [119]. However, EH-CIoT systems encounter significant jamming attacks due to the wireless channels, which exposes information transmissions to potential security risks. In [105], the study considered an EH-CIoT system where the commu- nication security of the SU network is threatened. To enhance security, the authors propose a DRL algorithm that integrates LSTM and GAN models. This algorithm aims to maximize the system’s secrecy rate while minimizing the Secrecy Outage Probability (SOP). The GAN network is utilized to mitigate the time-varying CSI and the adverse effects of random noise at 12 Spectrum Environment Jamming Historical Data G D Real Fake G Experience Pool Incomplete Sensing A. Offline Training B. Online Training Mask Incomplete  SW Completed  SW Update Update Channel Selection  Network Update Obtain feedback and calculate reward Communicate on selected channel Fig. 5. Overall structure of the proposed anti-jamming spectrum access scheme in [38]. In Part A, a GAN with the Generator (G) and Discriminator (D) is trained to complete missing spectrum data using historical data. In Part B, the generator (G) is implemented as SCN. The CSN utilizes the enriched spectrum data to assist users in selecting optimal communication channels for anti-jamming. the receivers. Simultaneously, the LSTM network is employed for extracting features from the input environment. The study’s findings reveal that the convergence speed of the proposed algorithm is significantly faster 1.69 and 3.15 times than that of other algorithms that do not incorporate the GAN model [105]. The integration of the GAN and LSTM model significantly en- hances the algorithm’s ability to quickly capture environmental information and learn optimal strategies. SemCom is a revolutionary way of communicating that helps overcome the limitations of previous methods by us- ing DL to send necessary information, which reduces the amount of data sent [120]. With the focus on semantic-level transmission, new challenges in jamming and anti-jamming arise. Attackers will aim to create more effective jamming methods to degrade the quality-of-experience (QoE) for users in communications [121]. In [106], a framework for intelligent jamming and anti-jamming in semantic communication was proposed based on the GAN. In the framework, the transmitter sends data with semantic features, and the receiver tries to understand it correctly while a jammer tries to mess up this process. The authors designed a GAN model where the jammer learns to generate disruptive signals, the receiver is trained to selectively focus on legitimate segments of the incoming data, thereby enhancing its proficiency in identifying and mitigating semantic jamming. In jamming attacks, a key factor for their success is the jammer’s ability to accurately determine the frequency of signal transmission. This capability is vital for generating jamming noise powerful enough to disrupt the SNR within the same frequency band. To mitigate jamming attacks, the author in [107] developed an anti-jamming communication system model based on GANs. The proposed model employs generator and discriminator integrated with min-max game theory, to automatically adapt to the dynamics of the spectrum. The training of the proposed model within this defense mech- anism is designed to mislead jammers, preventing them from effectively targeting the transmission of data. This strategic deception, rooted in game theory, hinders the jammers’ ability to accurately select time slots for their attacks, leading to erroneous predictions on classification sources, which in turn prevents significant transmission losses. As summarized in Table VI, GAI has demonstrated the effectiveness in identifying jamming activities and develop- ing suitable anti-jamming strategies. However, most existing works only consider certain scenarios and lack real-world testing [102], [103], [106]. Due to the complex architectures, GAI models are also unsuitable for large-scale deployment [37]. Therefore, designing a model that can be used in realistic anti-jamming scenarios especially on a large scale needs to be considered. B. Spoofing Defense Authenticating wireless signals at the physical layer is essential for ensuring communication resilience. Despite em- ploying numerous features discussed in Section III, wireless signal spoofing remains a pervasive threat. In spoofing, attack- ers insert fake identification information into genuine com- munications to join or corrupt the systems [125]. Therefore, it enable unauthorized access and data manipulation at the physical layer, causing substantial harm to the communication resilience. Currently, DL methods have proven effective against simple spoofing attacks. For example, the study in [40] examines a basic spoofing technique like the replay attack, which partially replicates original signals. However, adversarial spoofing attacks, as discussed in [36], pose a more profound threat by evading traditional security measures. The research in [40] explored this issue from both the attacker’s and defender’s 13 TABLE VII SUMMARY OF GAI FOR SPOOFING DEFENSE IN PHYSICAL LAYER BLUE CIRCLES DESCRIBE THE METHODS; GREEN CORRECT MARKERS AND RED CROSS MARKERS REPRESENT PROS AND CONS RESPECTIVELY. Techniques Reference Algorithm Pros & Cons Spoofing Defense [40] GAN ● An approach of spoofing wireless signals by using a GAN ✓ Provide GAN-based model defense mechanism ✗ Limited to simulated environments [122] GAN ● A DL-based spoofing attack to generate synthetic wireless signals ✓ Detailed analysis and implementation ✗ Not fully explore the potential countermeasures against such attacks [123] WGAN-GP ● The task of full-band spectral generation in addition to single signal generation ✓ Treat LTE signals as 2D images ✗ Poor performance of generated signals [41] CBEGAN ● A wireless spoofing attack scheme against the defense mechanism with adversarial DL ✓ Compensate for transmission channel effects via auxiliary channel sensing ✗ Consider specific channel conditions ✗ Limited to simulated environments [124] GAN ● A GNSS anti-spoofing method based on the idea of confrontation evolution of a GAN ✓ Detect small delay spoofing signals ✓ Extract features of slight differences ✗ The overall performance is not remarkable. [42] SJG-GAN ● A generation method for spoofing jamming signals ✓ Learn the latent distribution of DSSS signals ✓ Propose a improved Pearson correlation coefficient ✗ Lack real-world testing perspectives, proposing a GAN model to create indistinguish- able signals. The GAN is trained to emulate the pattern of intended transmissions which significantly improves the possibility of a successful attack compared to random signal and replay attacks, even when node locations vary between training and testing phases [40]. Moreover, the proposed GAN- based model provides defense mechanism by using GAI to distinguish and counteract signal spoofing attacks. In [122], the authors further provided a detailed analysis of the proposed GAN-based spoofing attack, including its implementation on embedded platforms. This implementation is carried out on two distinct embedded platforms: an embedded Graphics Pro- cessing Unit (GPU) [126] and a Field-Programmable Gate Array (FPGA) [127]. The effectiveness of the proposed attack is noteworthy, with a success probability ranging from 60.6% to 97.8%. However, the technique’s dependence on real-time compensation for transmission channels causes considerable overhead. This feature elevates the risk of detection due to an expanded communication footprint. Simulating and imitating RF signals is a basic tactic em- ployed by spoofers. While GAI has demonstrated effectiveness in augmenting short time series segments, challenges remain in accurately generating RF signals, such as the length of signals, and radio environments [123]. The authors in [123] explored the potential of GAN models to accomplish full-band spec- tral generation for anti-spoofing attacks. They implement the WGAN-GP model [69] to improve training stability. Drawing on its proven effectiveness in the image domain, they utilize spectral representations of OFDM signals called LTE [128], treating them as 2D images. Nonetheless, the study shows that using GANs to create long sequences over time is quite challenging. It is harder to capture small details and features in these long sequences than in the shorter ones [123]. To overcome the limitations of existing methods, [41] introduces a controllable wireless spoofing attack scheme that leverages a Conditional Boundary Equilibrium Generative Adversarial Network (CBEGAN) [129] in conjunction with auxiliary channel sensing. The CBEGAN network combines with an AAE, which is a well-established deep neural net- work architecture for computer vision-related tasks enabling learning with few samples [71]. It facilitates more precise and effective spoofing attacks by simulating a variety of emitters and modulation types. Additionally, the integration of auxil- iary channel sensing effectively compensates for transmission channel effects. Since it allows the attack model to be trained offline, it significantly reduces the likelihood of detection by legitimate communication pairs. Under the same channel conditions, the proposed spoofing attack scheme reaches a success probability of 85.7%. In contrast, the comparative attack scheme mentioned in [122] achieves a lower success rate, with a probability of 76.2% [41]. One sophisticated form of spoofing attack is spoofing jam- ming, where the attacker broadcasts analog signals designed to imitate authentic signals. This can lead to a target receiver obtaining false information instead of the true data. Due to their long-distance transmission from satellites to receivers, Global Navigation Satellite System (GNSS) signals are more prone to disruptions from spoofing jamming attacks [130]. To detect spoofing jamming attacks, the authors in [124] proposed a spoofing signal detection method based on the GAN in the acquisition stage, which is one of several phases in character recognition that also includes preprocessing, feature extrac- tion, classification, and post-processing [131]. The proposed model specifically considers the classification of authentic and spoofing signals within the context of navigation tasks. In this setup, both the training and test datasets are derived from the GPS receiver code. According to the simulation results, the successful detection of small-delay spoofing signals is achieved through the use of adversarial learning within the GAN. Additionally, while the overall performance of the GAN is comparable to that of the CNN, the GAN exhibits a slight advantage over the CNN, particularly when the pseudo-code 14 DS signal B. High-performance Generated Signal Selection Pearson  Correlation Coefficient Generated Signal 1 Generated Signal 2 Generated Signal n Generated Signal 3 Generated Signal 7 Generated Signal k Synthetic Signal Performance Evaluation Signal Selection Spoofing Jamming ≥ +0.9 Delete F T Generator Discriminator Received Signal Noise Source Modulate Spread  Spectrum Transmitting Terminal Source Modulate Spread  Spectrum Receiving Terminal Channel High-Performance  Generated Signal Selection Spoofing Jamming Generated Signal Update A. SJG-GAN framework Fig. 6. The overall network structure in [42]. Part A illustrates the SJG- GAN framework consisting of two parts: signal generation and the high- performance generated signal selection. In Part B, the process of the high- performance generated signal selection is shown. It can be split into two steps: the evaluation and the selection phase offset is equal to or greater than 0.5 chip [124]. However, Spoofing jamming’s creation is complex and resource-intensive, requiring extensive prior information. So far, only specific authorized or civilian systems have success- fully executed such attacks [132]. Drawing inspiration from [40], the authors in [42] introduced a GAN-based approach, termed Spoofing Jamming Generation (SJG-GAN), for craft- ing spoofing jamming attacks (Fig. 6). This model is adept at learning the latent distribution of DSSS signals and generating a set of synthetic signals. Upon completion of training, a improved Pearson correlation coefficient is used as an eval- uation metric to select the most aggressive synthetic signals for the DSSS system as spoofing jamming signals. Notably, the one-dimensional GAN model of SJG-GAN simplifies the generation process, making it more cost-effective and feasible for a variety of communication systems, as demonstrated in simulations [40]. In conclusions, GAI models are able to offer sophisticated mechanisms to both detect and counteract spoofing attacks, as summarized in Table VII. However, since they are limited to simulated environments, the detection accuracy in actual scenarios still needs further investigation. V. COMMUNICATION INTEGRITY Communication integrity in the physical layer of a network involves ensuring that the data transmitted over a physical medium, such as copper wires, fiber-optic cables, or wireless signals, is delivered accurately and reliably, without corruption or alteration [63]. This often requires mechanisms for anomaly detection or data reconstruction to maintain the fidelity of the data as it moves from one device to another, thereby preserving the integrity of communication. A. Anomaly Detection Features Class Input Discriminator Discriminator Sample from a Gaussian  distribution Sample from a Categorical  distribution LSTM Encoder CNN Encoder Input Latent Variables Input PSD vector Reconstructed  PSD vector Fig. 7. The proposed model architecture in [43]. The AAE architecture is trained in a semi-supervised learning for making the features more inter- pretable while the reconstruction is fully unsupervised. Anomaly detection is a method used to identify and mit- igate unexpected deviations or irregularities in the commu- nication channel [140]. However, due to the unpredictable characteristics of potential anomalies, it is difficult to gather enough abnormal data for training samples in traditional AI methods [141]. Thus, there is an urgent need for an unsu- pervised, automatic feature-extraction learning model, such as GAI techniques for anomaly detection [142]. Generally, GAI for anomaly detection can be divided into two cartography: reconstruction-based [133] and prediction-base detection [45]. Reconstruction-based methods identify anomalies through anomaly scores, which are usually the reconstruction error in GAI models. In the study [133], the authors proposed a deep AE-based approach for anomaly detection in the spectrum. The time-frequency features of preprocessed signal data are utilized to train the proposed network. To differentiate between normal and anomalous data, the method applies a threshold to the reconstruction errors, transforming these errors into a binary outcome. The threshold value is strategically selected to trade-off a balance between the probabilities of false alarms and missed alarms, and it is determined as the median of a sequence of reconstruction errors in this study. While the model presented in [133] demonstrates effective- ness, it lacks interpretable feature extraction capabilities, such as signal bandwidth and position. This limitation necessitates the training of multiple copies of the model for different frequency bands. Addressing this issues, the authors in [43] introduced Spectrum Anomaly Detector with Interpretable FEatures (SAIFE), which is an AAE based model (Fig. 7). SAIFE enables the training of a single model across multiple bands in an unsupervised manner, thereby eliminating the need for multiple model instances for different bands. Moreover, the AAE architecture provides a flexible and robust platform for semi-supervised learning, enabling the extraction of in- terpretable features based on Power Spectral Density (PSD) data [143]. Furthermore, the reconstructed signals are a key asset for localizing anomalies within the wireless spectrum. Impressively, the model demonstrates exceptional performance in wireless band classification, achieving an accuracy close to 100% while only utilizing 20% labeled samples [43]. 15 TABLE VIII SUMMARY OF GAI FOR ANOMALY DETECTION IN PHYSICAL LAYER BLUE CIRCLES DESCRIBE THE METHODS; GREEN CORRECT MARKERS AND RED CROSS MARKERS REPRESENT PROS AND CONS RESPECTIVELY. Techniques Reference Algorithm Pros & Cons Score-based Detection [133] AE ● The deep-structure AE neural networks to detect the anomalies of spectrum via time–frequency diagram ✓ The threshold selected to trade-off a balance between the probabilities of false alarms and missed alarms. ✗ Include potential biases in signal data selection [43] SAIFE ● An AAE-based anomaly detector for wireless spectrum anomaly detection using PSD data ✓ A single model across multiple bands to extract interpretable features ✗ The distribution corresponds more to the latent representations than to the original training samples. [134] GAN ● A GAN-based system trained on available EM signals to detect unseen types of EM waveforms ✓ The generator consists of two AEs connected in series. ✗ Require relatively long training time [135] ResNet-AE ● An anomaly detection method based on ResNet-AE ✓ Establish an adaptive decision threshold ✗ Cannot classify the types of anomalies [44] β-VAE ● A VAE model uses multivariate normal distribution with a parameter β included to the KL divergence term ✓ Investigate the impact of different weightings of the KL divergence ✗ Not specify how to select the optimal value of the β coefficient [136] AE ● The AE neural networks into WSN to solve the anomaly detection problem ✓ Satisfy the demand for limited computational resources ✗ Lack of analysis that extends to large scale sensor networks Prediction-based Detection [137] MSGAN ● A domain-specific framework consisting of offline training and online inference to detect anomalies in the scenario of industrial robotic sensors ✓ Use an adaptive update strategy during offline training ✗ Lack of analysis that extends to diversity scenarios [45] E-GAN ● A radio anomaly detection algorithm based on modified GAN ✓ Latent representations are controlled rather than being randomly selected. ✓ Capture the distribution of input samples ✗ Relatively high time complexity [46] CGAN ● The GAI-based abnormality Detection techniques at the physical layer in CR ✓ Implement a hybrid structure for low- and high-dimensionality data ✗ Limited by signal types tested [138] Multiple ● The GAI frameworks used to detect anomalies inside the dynamic radio spectrum ✓ A comparative analysis of three deep generative models ✗ Cannot be employed to characterize and classify the anomalous signals [139] Multiple ● GAI-based anomaly detection methods to detect a set of anomalous activities in several radio band ✓ Three deep generative models are applied to spectral density functions ✗ Need to consider the key applications and proper methods or ensembles of methods to achieve the best performance Similar to the SAIFE model [43], the study in [134] also de- signed an anomaly score based on latent representations. The authors proposed an architecture for electromagnetic wave- form anomaly detection, utilizing a dual AE enhanced GAN. This design differs from the SAIFE model, as the generator in the proposed method is composed of two AEs connected in series. These encoders map original and reconstructed data to the latent space, respectively. The Anomaly Score is defined with the objective of minimizing the L2 distance between latent representations for anomaly detection. In response to the complexity and training overhead of GANs and the low accuracy of traditional AE networks in anomaly detection of electromagnetic signals, the authors in [135] proposed a ResNet-AE network model. This model integrates the encoder and decoder with ResNet architecture and LSTM architectures for efficient feature mapping and data reconstruction. To process the anomaly detection results and establish an adaptive decision threshold, a K-Means classifier with two categories is constructed, using a random initial clustering center to categorize the anomaly scores. After iterative clustering, the centers for normal and abnormal signal scores are determined, and the mean value of these centers is used as the threshold for anomaly judgment. When applied to radar signal anomaly detection, the proposed ResNet-AE method achieves a high recognition accuracy, exceeding 85% [135]. To further investigate the impact of different weightings of the KL divergence in the loss function of VAEs, the authors of [44] proposed an approach for data anomaly detection using a β-VAE [144]. This advanced model, employing a multivariate normal distribution, introduces a coefficient β to control the KL term. It allows for a more disentangled representation of data, where each unit in the latent code is responsive to a single generative element, enhancing the model’s interpretability and effectiveness. However, the study does not specify the method for selecting the optimal value of the β coefficient. While existing methods have proven effective in anomaly detection, they often involve transmitting large volumes of raw data, resulting in significant channel interference and energy consumption. To address the substantial demand for compu- tational resources, the study [136] introduces an AE-based distributed anomaly detection approach in Wireless sensor network (WSN), characterized by its simplicity with only three layers. Each sensor in the proposed approach is equipped with 16 a copy of the AE and is responsible for two primary tasks, in addition to its regular sensing function. The first task involves providing the input and output data of the AE to the IoT cloud, which serves as the training data. This data transfer occurs through a gateway or cluster head at a significantly lower frequency compared to the sensing rate. The second task is the execution of anomaly detection, which is conducted locally at the sensor level. This process is independent of any communication with other sensors, the gateway, or the IoT cloud, thereby enabling efficient and autonomous anomaly detection within each sensor unit, offering a more efficient and autonomous approach to anomaly detection in WSN [136]. Besides reconstruction-based methods, prediction-based methods have also proven to be effective for anomaly de- tection, which directly predict the probability of an anomaly without defining an anomaly score[45], [46], [137], [138]. A primary challenge in physical layer sensing is the large amount of unclean and irrelevant data collected from sensors, known as data imbalance [145]. This issue often results in traditional AI models misclassifying all samples as abnormal, further complicating anomaly detection [146]. To tackle the data imbalance problem, [137] introduces the MSGAN model, a GAN-based data augmentation strategy specifically designed for sensor anomaly detection. This model integrates WGAN- GP [69] with a novel adaptive update strategy during offline training. The adoption of an adaptive update strategy allows the MSGAN to accelerate training convergence and improve the quality of synthetic samples. In SAIFE [43], the distribution captured by AAEs corre- sponds more to the latent representations than to the original training samples. To address this limitation, the study in [45] introduced an Encoder-GAN (E-GAN) structure, which incor- porates an encoder network into the original GAN framework to reconstruct the spectrogram. By integrating an encoder into the standard GAN, the latent representations are controlled by the encoder rather than being randomly selected, which ensures that the generator produces data within the actual data distribution. Consequently, the E-GAN model is more adept at capturing the distribution of input samples than the SAIFE. However due to the convolutional structure in E-GAN, the time complexity of the proposed algorithm is higher than that of the SAIFE model where a fully-connected architecture is enough [45]. In [46], a framework integrating Dynamic Bayesian Net- works (DBNs) [147] and GANS was proposed to detect abnormalities. A distinctive aspect of this approach is the use of a generalized state vector [148], consisting of the signal feature extracted from the Stockwell Transform (ST) and the corresponding derivatives, as the input for the model. In the proposed framework, DBNs are used to learn switching models where each switching variable can be associated with a different linear dynamic model. This approach is particularly suited for scenarios involving low-dimensionality data due to the vocabulary size of switching variables. Conversely, CGAN is employed for scenarios involving high-dimensionality data. While GANs are capable of effectively managing a high number of different dynamic models implicitly, they have a notable limitation: unlike DBNs, GANs cannot manage uncertainty with probabilistic knowledge [46]. According the results in [46], it is demonstrated that ap- proaches utilizing generative learning of deep features yield superior results in anomaly detection when compared to conventional techniques, particularly the Cyclostationary Fea- ture Detector (CFD) [149]. Therefore, the authors in [138] conducted a comparative analysis of three deep generative models: the CGAN, the ACGAN, and the VAE for spec- trum anomaly detection in the millimeter Wave (mmWave) communications. Tested on a real dataset collect by The National Instruments mmWave Transceiver System [138], all three models demonstrated commendable performance in anomaly detection, particularly the AC-GAN. The ROC curves from these tests confirmed that these models have a high probability of detection while maintaining a low false alarm rate. Furthermore, the VAE model demonstrates more efficient computational performance in both the training and testing processes compared to the other two networks. Similarly, the authors in [139] explored a range of generative model approaches, including U-Net WGAN, ResNet WGAN, and ResNet VAE applied to spectral density functions. The anomaly scoring mechanism employed varies with the model: binary cross-entropy loss is used between the input and reconstruction for U-Net WGAN and ResNet VAE, while mean-squared error loss is applied for ResNet WGAN. For comparison and validation, three well-known anomaly detec- tion methods are used as baselines: Isolation Forest [150], One-class SVM [151], and fAnoGAN [152]. The results demonstrate excellent performance of these generative models compared to traditional baseline approaches for various types of anomalies. In particular, the Unet GAN achieves the highest average in four out of the five metrics [139]. As summarized in Table VIII, GAI models showcase supe- rior performance in anomaly detection within complicated fea- ture data than traditional AI models. However, some methods cannot be employed to characterize and classify the anomalous signals [135], [138], which holds critical importance for the subsequent maintenance and security of network equipment. Consequently, future research should concentrate on creating advanced GAI models capable of detecting and classifying various anomalous signals. B. Data Reconstruction Data reconstruction focuses on retrieving the original signal or information from corrupted or incomplete datasets [155]. This process involves various techniques to restore or approx- imate the original data, aiming to overcome the issues caused by interference and noise. Traditional reconstruction methods, based on sparse rep- resentation and low-rank matrix completion [156], assume that both full-spectrum data and their corrupted counterparts are sparsely represented with a full-spectrum and a gapped- spectrum dictionary, respectively. Therefore, both representa- tions are similarly sparse and share identical sparse codes. Consequently, these reconstruction methods lack the ability and robustness to distinguish closely situated targets at high resolution accurately without prior knowledge of the missing 17 TABLE IX SUMMARY OF GAI FOR DATA RECONSTRUCTION IN PHYSICAL LAYER BLUE CIRCLES DESCRIBE THE METHODS; GREEN CORRECT MARKERS AND RED CROSS MARKERS REPRESENT PROS AND CONS RESPECTIVELY. Techniques Reference Algorithm Pros & Cons Data Reconstruction [47] SARGAN ● A GAN network to recover this missing spectral information ✓ Not require any information of the missing band locations ✓ All computational complexity is at the training phase. ✗ The requirement for extensive training data [48] VAE-GAN ● A VAE-GAN-based method for reconstructing DSSS signals ✓ Avoid complex parametric analysis of the signal ✓ Integrate DRSNs and self-attention in VAE-GAN ✗ Unsatisfactory effect in low SNR [153] MTS-GAN ● A high-precision reconstruction method for electromagnetic environment data based on MTS-GAN ✓ Use the GRUI to simulate time irregularities ✓ High accuracy and convergence speed ✗ The specific requirements for training and implementing [154] VAE ● Investigate the performance of VAEs and compare the results with standard AEs ✓ Use SSIM metric instead of the peak signal-to-noise ratio ✗ Limited in terms of the variety of noise models [49] CDDM ● A channel denoising diffusion models for wireless communications to eliminate the channel noise ✓ Eliminate the channel nosie under Rayleigh fading channel and AWGN channel ✗ Relatively long sampling time frequency bands. However, GAI models excel in learning complex data patterns, effectively reducing the dependency on prior knowledge of missing frequency bands. Moreover, GAI models leverage their advanced learning capabilities to data gaps, offering a more robust and flexible approach to signal reconstruction. In [47], the authors introduced a GAN framework named SARGAN, designed to reconstruct missing spectral informa- tion in Ultra-wideband (UWB) radar systems across multiple frequency bands. Specifically, SARGAN focuses on recov- ering Synthetic Aperture Radar (SAR) data [157]. To train the GAN model, the model uses numerous data pairs, each comprising an uncorrupted scene and its frequency-corrupted version. The corrupted datasets are simulated by removing random frequency bands from the original data. A significant advantage over conventional spectral recovery methods is that the proposed model does not need any prior knowledge of the missing data. This is particularly beneficial in unpredictable scenarios including battlefield conditions, where jamming and interference can occur unexpectedly. The simulation results show that the recovered signals using SARGAN achieve an average gain of over 18 dB in SNR, even when up to 90% of the operating spectrum is missing. Compared to radar data, DSSS signals possess more com- plex structures which makes it challenging to characterize accurately the properties of a target signal. To extract more properties such as Pseudonoise (PN) sequence [158], a method based on VAE-GAN [72] for reconstructing DSSS signals was proposed in [48]. By integrating VAE and GAN, the encoder provides the generator with a loss function that measures the discrepancy between real and generated data. Furthermore, the proposed framework incorporates a Deep Residual Shrinkage Network (DRSN) [159] and a self-attention mechanism [160] into the encoder and discriminator. The DRSNs are effective in minimizing redundant information in the collected signal, particularly noise-induced redundancy. Meanwhile, the self- attention mechanism facilitates the establishment of long- distance dependencies within the input sequences. However, while the proposed model is adaptable to PN sequences with varying code lengths, its performance in low SNR environ- ments significantly diminishes. Particularly, when the SNR falls below 13 dB, there is a sharp decline in the model’s performance [48]. GRUI Cell Real Fake Calculate Value Error Discriminator Generator Pretrainer Random Noise Real Data Reconstructed  Data 𝑡0 𝑡2 𝑡1 𝑡3 Frequency GRUI Cell GRUI Cell 𝑡0 𝑡2 𝑡1 𝑡3 Frequency Update Update Single-step  Loop  Generation Fig. 8. The MTS-GAN data completion network structure [153]. The generator network is built by the gated loop unit GRUI for data interpolation. GRUI can simulate time irregularities allowing for more accurate extraction of the distribution characteristics of time-frequency signal data. To improve the precision of reconstructing electromagnetic environment data, the authors in [153] developed a high- precision method using a Multi-Component Time Series Gen- eration Adversarial Network (MTS-GAN). This approach ef- fectively utilizes multivariate time series data to better capture the correlations between the time and frequency domains of electromagnetic data (Fig. 8). A key component of this method is the use of a Gate Recursive Unit (GRUI), which simulates time irregularities. The GRUI allows for more accurate extrac- tion of the distribution characteristics of time-frequency signal data and reduces the impact of random losses in time series. The proposed method achieves high accuracy and ensures rapid convergence and iterative optimization speeds with the ’Qingdao Offshore Measurement Data Set’ [153]. Besides GANs, VAEs are recognized as another powerful 18 GAI model for effective data reconstruction. In [154], a VAE- based model was proposed for data construction in noisy channels. The AE and VAE models are particularly effective in regularizing the latent space distribution, a feature that is highly beneficial in data reconstruction with Gaussian noise channels. The VAE’s regularized latent space facilitates accu- rate decoding by the decoder, thus improving performance in noisy settings. Consequently, when evaluated on the STL10 dataset [161] using the Structural Similarity Index (SSIM) metric [162], the VAE-based method demonstrates a smoother output attributed to its inherent structure. DMs have garnered attention in the field of wireless commu- nications due to their inherent ability to progressively remove noise, especially in aiding receivers to mitigate channel noise. In response to this potential, the study [49] introduced Channel Denoising Diffusion Models (CDDM) specifically designed for wireless communications. CDDM aims to leverage the noise reduction properties of DMs to enhance the quality and reliability of signal reception in wireless communication channels. CDDM is trained using a specialized noise schedule specifically adapted to the wireless channel, enabling the effec- tive elimination of channel noise through sampling algorithm. The training algorithm for the combined CDDM and JSCC system is structured into three distinct stages. In the first and last stages, the JSCC encoder and decoder are trained to minimize the reconstruction error. The second stage involves fixing the parameters of the JSCC encoder, thereby allowing the CDDM to learn the distribution of latent representations. This stage utilizes a noise schedule that closely simulates the distribution of channel noise, rendering the CDDM adaptable to a variety of channel conditions. The results demonstrate that systems incorporating CDDM consistently outperform those without CDDM across all SNR regimes, under both AWGN and Rayleigh fading channels. Notably, under an AWGN channel and a Rayleigh fading channel at 20 dB SNR, the CDDM achieves 0.49 dB gain and 1.06 dB gain, respectively [49]. The applications of GAI for data reconstruction in Table IX showcase its remarkable ability to process and regenerate missing or corrupted data, ensuring communication integrity. However, the performance is still limited in low SNR scenarios [48]. Therefore, proposing more accurate models in high noise situations is a future direction. VI. FUTURE RESEARCH DIRECTION Despite its impressive capabilities in complex data feature extraction, reconstruction, and enhancement, the applications of GAI in physical layer security are still in its early stages. This section aims to explore the open issues and research directions related to the integration of GAI in physical layer security. A. Model Improvements Enhancing physical layer security necessitates models that significantly advance in terms of robustness and efficiency re- quiring model improvements. By incorporating advanced neu- ral network architectures, GAI systems can learn to simulate and counteract time related attack patterns more effectively [163]. Enhancements in adversarial training techniques will also enable GAI models to better mitigate potential vulnerabil- ities [164]. Moreover, GAI-aided information encryption may be further explored in conjunction with the near-field beam fo- cusing via Extremely large-scale multiple-input-multipleoutput (XL-MIMO) that exploits the propagation characteristics of both distance and direction. The latter enables to focus the transmitted signal energy onto an intended user, so as not to induce information leakage to eavesdroppers. This certainly enhances the physical layer security for emerging 6G Wireless equipped with XL-MIMO [165]. B. Multi-scenario Deployment As the deployment of GAI in physical layer security, its application across various scenarios emerges as a critical area of focus. The intricate architecture of GAI poses challenges for its implementation on edge devices, often requiring the transmission of additional data [136]. Incorporating distributed deployment strategies, GAI can efficiently leverage edge com- puting capabilities, thus minimizing latency and reducing the need for extensive data transmission by processing information closer to its source [166]. Furthermore, the Mixture of Experts (MoE) model can dynamically assign tasks to specialized sub- models or ‘experts’ [167]. It presents a promising avenue for enhancing the adaptability and efficiency of GAI in addressing the multifaceted and intricate scenarios encountered in physi- cal layer security. Exploring the integration of the MoE model with GAI to leverage the strengths of both approaches is a noteworthy direction for future research. C. Resource-Efficient Optimization Compared with traditional AI, GAI usually requires more resources for training and inference due to its complex mission objectives. It causes serious burden and impact on the normal process operation of the device, especially for devices with limited resources such as mobile phones. Therefore, future directions should emphasize the development of lightweight GAI models that can operate with minimal computational resources while maintaining high security standards [168]. For instance, adapting model pruning techniques to remove unnecessary parameters from GANs without compromising their ability to generate or discriminate can significantly re- duce the computational load [169]. Additionally, exploring federated learning approaches could decentralize the training process, allowing GAIs to learn from diverse datasets across multiple devices while ensuring data privacy and reducing the need for centralized, powerful computing resources [170]. These strategies promise to enhance the scalability of GAIs in securing the physical layer and ensure their applicability in resource-constrained environments including IoT devices and edge computing platforms, where security and efficiency are paramount. D. Secure SemCom ”GAI-aided Secure SemCom” is certainly a vital future research direction. The task-oriented SemCom aims at mini- 19 mizing the transmission overhead in resource-constrained net- works, such as AI-native wireless networks [51]. Additionally, it focuses on performing a given task properly with the aid of GAI as well as knowledge base at both ends, even though the reconstructed data is not exactly same as the original data [120]. Consequently, the performance metric transitions from bit-level accuracy including BER, to the degree of task fulfillment within a specified QoE value, given the GAI with knowledge base is shared between the transceiver. Therefore, this paradigm shift necessitates a reevaluation of GAI model design criteria within SemCom, focusing on task fulfillment levels facilitated by the synergistic use of GAI and a shared knowledge base in physical layer security [121]. VII. CONCLUSION This paper has presented a comprehensive survey on the applications of GAI in physical layer security, attributed to its remarkable capabilities in extracting, reconstructing, and enhancing complex data features. It introduced the back- ground of GAI, encompassing its architecture, classification, and foundational models. Subsequently, it explored various security properties such as communication confidentiality, authentication, availability, resilience, and integrity. Finally, it highlighted crucial future research directions for generative AI in physical layer security, which underscores the potential of GAI to further enhance security measures, demonstrating its vital role in safeguarding communication networks against evolving security threats. REFERENCES [1] D. Baidoo-Anu and L. O. Ansah, “Education in the era of generative artificial intelligence (AI): Understanding the potential benefits of ChatGPT in promoting teaching and learning,” Journal of AI, vol. 7, no. 1, pp. 52–62, Jan. 2023. [2] H. Du, D. Niyato, J. Kang, Z. Xiong, P. Zhang, S. Cui, X. Shen, S. Mao, Z. Han, A. Jamalipour et al., “The age of generative AI and AI-generated everything,” arXiv preprint arXiv:2311.00947, 2023. [3] Y. Cao, S. Li, Y. Liu, Z. Yan, Y. Dai, P. S. Yu, and L. Sun, “A compre- hensive survey of AI-generated content (AIGC): A history of generative ai from GAN to ChatGPT,” arXiv preprint arXiv:2303.04226, 2023. [4] R. Rombach, A. Blattmann, D. Lorenz, P. Esser, and B. Ommer, “High- resolution image synthesis with latent diffusion models,” 2021. [5] J. Betker, G. Goh, L. Jing, TimBrooks, J. Wang, L. Li, LongOuyang, JuntangZhuang, JoyceLee, YufeiGuo, WesamManassra, PrafullaDhariwal, CaseyChu, YunxinJiao, and A. Ramesh, “Improving image generation with better captions.” [Online]. Available: https: //api.semanticscholar.org/CorpusID:264403242 [6] T. Wu, S. He, J. Liu, S. Sun, K. Liu, Q.-L. Han, and Y. Tang, “A brief overview of ChatGPT: The history, status quo and potential future development,” IEEE/CAA JAS, vol. 10, no. 5, pp. 1122–1136, May. 2023. [7] I. K. Dutta, B. Ghosh, A. Carlson, M. Totaro, and M. Bayoumi, “Generative adversarial networks in security: a survey,” in Proceedings of the 11th IEEE Annual Ubiquitous Computing, Electronics & Mobile Communication Conference. IEEE, 2020, pp. 0399–0405. [8] S. Aldossary and W. Allen, “Data security, privacy, availability and integrity in cloud computing: issues and current solutions,” Int. J. Adv. Comput. Sci. Appl., vol. 7, no. 4, Apr. 2016. [9] Y. Zhang, Y. Lu, R. Zhang, B. Ai, and D. Niyato, “Deep reinforcement learning for secrecy energy efficiency maximization in ris-assisted networks,” IEEE Trans. Veh. Technol., 2023. [10] S. Kumar, S. Dalal, and V. Dixit, “The OSI model: Overview on the seven layers of computer networks,” Int. J. Comput. Sci. Inf. Technol. Res., vol. 2, no. 3, pp. 461–466, Mar. 2014. [11] J. Zhang, H. Du, Q. Sun, B. Ai, and D. W. K. Ng, “Physical layer security enhancement with reconfigurable intelligent surface- aided networks,” IEEE Trans. Inf. Forensics Secur., vol. 16, pp. 3480– 3495, 2021. [12] Y.-S. Shiu, S. Y. Chang, H.-C. Wu, S. C.-H. Huang, and H.-H. Chen, “Physical layer security in wireless networks: A tutorial,” IEEE Wirel. Commun., vol. 18, no. 2, pp. 66–74, 2011. [13] Z. Lv, A. K. Singh, and J. Li, “Deep learning for security problems in 5G heterogeneous networks,” IEEE Netw., vol. 35, no. 2, pp. 67–73, 2021. [14] W. Wang, M. Zhu, X. Zeng, X. Ye, and Y. Sheng, “Malware traffic classification using convolutional neural network for representation learning,” in Proceedings of the International conference on informa- tion networking. IEEE, 2017, pp. 712–717. [15] R. Liao, H. Wen, F. Pan, H. Song, A. Xu, and Y. Jiang, “A novel phys- ical layer authentication method with convolutional neural network,” in Proceedings of the IEEE International Conference on Artificial Intelligence and Computer Applications. IEEE, 2019, pp. 231–235. [16] D. Hong, Z. Zhang, and X. Xu, “Automatic modulation classification using recurrent neural networks,” in Proceedings of the 3rd IEEE International Conference on Computer and Communications. IEEE, 2017, pp. 695–700. [17] X. Xiao, B. Vasi´c, R. Tandon, and S. Lin, “Designing finite alphabet it- erative decoders of ldpc codes via recurrent quantized neural networks,” IEEE Trans. Commun., vol. 68, no. 7, pp. 3963–3974, 2020. [18] J. Kim and H. Kim, “Applying recurrent neural network to intrusion detection with hessian free optimization,” in International Workshop on Information Security Applications. Springer, 2015, pp. 357–369. [19] J. Wang, H. Du, D. Niyato, J. Kang, S. Cui, X. Shen, and P. Zhang, “Generative ai for integrated sensing and communication: Insights from the physical layer perspective,” arXiv preprint arXiv:2310.01036, 2023. [20] T. O’shea and J. Hoydis, “An introduction to deep learning for the physical layer,” IEEE Trans. Cogn. Commun. Netw., vol. 3, no. 4, pp. 563–575, 2017. [21] A. Karapantelakis, P. Alizadeh, A. Alabassi, K. Dey, and A. Nikou, “Generative ai in mobile networks: a survey,” Ann. Telecommun., pp. 1–19, 2023. [22] N. Van Huynh, J. Wang, H. Du, D. T. Hoang, D. Niyato, D. N. Nguyen, D. I. Kim, and K. B. Letaief, “Generative ai for physical layer communications: A survey,” arXiv preprint arXiv:2312.05594, 2023. [23] Z. Xu, W. Liu, J. Huang, C. Yang, J. Lu, and H. Tan, “Artificial intelligence for securing IoT services in edge computing: a survey,” Secur. Commun. Netw., vol. 2020, pp. 1–13, 2020. [24] H. Sharma and N. Kumar, “Deep learning based physical layer security for terrestrial communications in 5G and beyond networks: A survey,” Phys. Commun., p. 102002, 2023. [25] J. Zhai, S. Zhang, J. Chen, and Q. He, “Autoencoder and its various variants,” in Proceedings of the IEEE international conference on systems, man, and cybernetics. IEEE, 2018, pp. 415–419. [26] I. Goodfellow, J. Pouget-Abadie, M. Mirza, B. Xu, D. Warde-Farley, S. Ozair, A. Courville, and Y. Bengio, “Generative adversarial net- works,” Communications of the ACM, vol. 63, no. 11, pp. 139–144, 2020. [27] J. Ho, A. Jain, and P. Abbeel, “Denoising diffusion probabilistic models,” Adv. Neural Inf. Process., vol. 33, pp. 6840–6851, 2020. [28] A. Smith and J. Downey, “A communication channel density estimating generative adversarial network,” in Proceedings of the IEEE Cognitive Communications for Aerospace Applications Workshop. IEEE, 2019, pp. 1–7. [29] C.-H. Lin, C.-C. Wu, K.-F. Chen, and T.-S. Lee, “A variational autoencoder-based secure transceiver design using deep learning,” in Proceeding of IEEE Global Communications Conference. IEEE, 2020, pp. 1–7. [30] M. Nemati, J. Park, and J. Choi, “VQ-VAE empowered wireless communication for joint source-channel coding and beyond,” 2023. [31] J. Han, Y. Zhou, G. Liu, T. Liu, and X. Zeng, “A novel physical layer key generation method based on WGAN-GP adversarial autoencoder,” in Proceedings of the 4th International Conference on Communica- tions, Information System and Computer Engineering. IEEE, 2022, pp. 1–6. [32] K. Merchant and B. Nousain, “Securing IoT RF fingerprinting systems with generative adversarial networks,” in Proceedings of the IEEE Military Communications Conference. IEEE, 2019, pp. 584–589. [33] J. Gong, X. Xu, Y. Qin, and W. Dong, “A generative adversarial network based framework for specific emitter characterization and identification,” in Proceedings of the 11th International Conference 20 on Wireless Communications and Signal Processing. IEEE, 2019, pp. 1–6. [34] K. S. Germain and F. Kragh, “Mobile physical-layer authentica- tion using channel state information and conditional recurrent neural networks,” in Proceedings of the IEEE 93rd Vehicular Technology Conference. IEEE, 2021, pp. 1–6. [35] R. Meng, X. Xu, B. Wang, H. Sun, S. Xia, S. Han, and P. Zhang, “Physical-layer authentication based on hierarchical variational autoen- coder for industrial internet of things,” IEEE Internet Things J., vol. 10, no. 3, pp. 2528–2544, 2022. [36] T. Erpek, Y. E. Sagduyu, and Y. Shi, “Deep learning for launching and mitigating wireless jamming attacks,” IEEE Trans. Cogn. Commun. Netw., vol. 5, no. 1, pp. 2–14, 2018. [37] Y. Tang, Z. Zhao, X. Ye, S. Zheng, and L. Wang, “Jamming recognition based on AC-VAEGAN,” in Proceedings of the 15th IEEE International Conference on Signal Processing, vol. 1. IEEE, 2020, pp. 312–315. [38] H. Han, X. Wang, F. Gu, W. Li, Y. Cai, Y. Xu, and Y. Xu, “Better late than never: GAN-enhanced dynamic anti-jamming spectrum access with incomplete sensing information,” IEEE Wirel. Commun. Lett., vol. 10, no. 8, pp. 1800–1804, 2021. [39] Y. Wang, X. Liu, and M. Wang, “A double network structure anti- jamming algorithm based on deep reinforcement learning,” in J. Phys. Conf. Ser., vol. 1982, no. 1. IOP Publishing, 2021, p. 012106. [40] Y. Shi, K. Davaslioglu, and Y. E. Sagduyu, “Generative adversarial network for wireless signal spoofing,” in Proceedings of the ACM Workshop on Wireless Security and Machine Learning, 2019, pp. 55– 60. [41] M. Ma, Y. Zhang, T. Zhao, W. Zhang, and Z. He, “Controllable wireless spoofing attack based on conditional began and auxiliary channel sensing,” Electronics, vol. 12, no. 1, p. 84, 2022. [42] Y. Yang, L. Zhu, Q. He, and X. Deng, “A simple high-performance generation method for spoofing jamming signals,” in Proceedings of the International Symposium on Networks, Computers and Communi- cations. IEEE, 2022, pp. 1–5. [43] S. Rajendran, W. Meert, V. Lenders, and S. Pollin, “Unsupervised wireless spectrum anomaly detection with interpretable features,” IEEE Trans. Cogn. Commun. Netw., vol. 5, no. 3, pp. 637–647, 2019. [44] S. Harini, K. Nivedha, S. K. BG, R. Gokul, B. Jayasree et al., “Data anomaly detection in wireless sensor networks using β-variational autoencoder,” in Proceedings of the International Conference on In- telligent Systems for Communication, IoT and Security. IEEE, 2023, pp. 631–636. [45] X. Zhou, J. Xiong, X. Zhang, X. Liu, and J. Wei, “A radio anomaly detection algorithm based on modified generative adversarial network,” IEEE Wirel. Commun. Lett., vol. 10, no. 7, pp. 1552–1556, 2021. [46] A. Toma, A. Krayani, M. Farrukh, H. Qi, L. Marcenaro, Y. Gao, and C. S. Regazzoni, “Ai-based abnormality detection at the PHY-layer of cognitive radio by learning generative models,” IEEE Trans. Cogn. Commun. Netw., vol. 6, no. 1, pp. 21–34, 2020. [47] D. N. Tran, T. D. Tran, and L. Nguyen, “Generative adversarial networks for recovering missing spectral information,” in Proceedings of the IEEE Radar Conference. IEEE, 2018, pp. 1223–1227. [48] Q. Feng, J. Zhang, L. Chen, and F. Liu, “Waveform reconstruction of DSSS signal based on VAE-GAN,” Wirel. Commun. Mob. Comput., vol. 2022, 2022. [49] T. Wu, Z. Chen, D. He, L. Qian, Y. Xu, M. Tao, and W. Zhang, “Cddm: Channel denoising diffusion models for wireless communications,” arXiv preprint arXiv:2305.09161, 2023. [50] M. Xu, H. Du, D. Niyato, J. Kang, Z. Xiong, S. Mao, Z. Han, A. Jamalipour, D. I. Kim, X. Shen et al., “Unleashing the power of edge-cloud generative ai in mobile networks: A survey of aigc services,” IEEE Commun. Surv. Tutor., 2024. [51] C. Liang, H. Du, Y. Sun, D. Niyato, J. Kang, D. Zhao, and M. A. Imran, “Generative ai-driven semantic communication networks: Architecture, technologies and applications,” arXiv preprint arXiv:2401.00124, 2023. [52] V.-L. Nguyen, P.-C. Lin, B.-C. Cheng, R.-H. Hwang, and Y.-D. Lin, “Security and privacy for 6G: A survey on prospective technologies and challenges,” IEEE Commun. Surv. Tutor., vol. 23, no. 4, pp. 2384– 2428, 2021. [53] S. Santhosh Kumar, M. Selvi, A. Kannan et al., “A comprehensive survey on machine learning-based intrusion detection systems for secure communication in internet of things,” Comput. Intell. Neurosci., vol. 2023, 2023. [54] F. Alwahedi, A. Aldhaheri, M. A. Ferrag, A. Battah, and N. Tihanyi, “Machine learning techniques for iot security: Current research and future vision with generative ai and large language models,” Internet of Things and Cyber-Physical Systems, 2024. [55] A. K. Kamboj, P. Jindal, and P. Verma, “Machine learning-based physical layer security: techniques, open challenges, and applications,” Wirel. Netw., vol. 27, pp. 5351–5383, 2021. [56] H. Sharma, G. Sharma, and N. Kumar, “Ai-assisted secure data trans- mission techniques for next-generation hetnets: A review,” Comput. Commun., 2023. [57] J. Wang, H. Du, D. Niyato, M. Zhou, J. Kang, and H. V. Poor, “Acceleration estimation of signal propagation path length changes for wireless sensing,” arXiv preprint arXiv:2401.00160, 2023. [58] J. Wang, H. Du, D. Niyato, M. Zhou, J. Kang, Z. Xiong, and A. Ja- malipour, “Through the wall detection and localization of autonomous mobile device in indoor scenario,” IEEE J. Sel. Areas Commun., 2023. [59] S. Samonas and D. Coss, “The CIA strikes back: Redefining confiden- tiality, integrity and availability in security.” J. Inf. Syst. Secur., vol. 10, no. 3, 2014. [60] J. M. Hamamreh, H. M. Furqan, and H. Arslan, “Classifications and applications of physical layer security techniques for confidentiality: A comprehensive survey,” IEEE Commun. Surv. Tutor., vol. 21, no. 2, pp. 1773–1828, 2018. [61] L. Bai, L. Zhu, J. Liu, J. Choi, and W. Zhang, “Physical layer authentication in wireless communication networks: A survey,” J. Commun. Inf. Netw., vol. 5, no. 3, pp. 237–264, 2020. [62] C. Shahriar, M. La Pan, M. Lichtman, T. C. Clancy, R. McGwier, R. Tandon, S. Sodagari, and J. H. Reed, “Phy-layer resiliency in ofdm communications: A tutorial,” IEEE Commun. Surv. Tutor., vol. 17, no. 1, pp. 292–314, 2014. [63] M. Shakiba-Herfeh, A. Chorti, and H. Vincent Poor, “Physical layer security: Authentication, integrity, and confidentiality,” Physical layer security, pp. 129–150, 2021. [64] H. Shen, X. Li, Q. Cheng, C. Zeng, G. Yang, H. Li, and L. Zhang, “Missing information reconstruction of remote sensing data: A tech- nical review,” IEEE Trans. Geosci. Remote Sens., vol. 3, no. 3, pp. 61–85, 2015. [65] C. Doersch, “Tutorial on variational autoencoders,” arXiv preprint arXiv:1606.05908, 2016. [66] A. Oussidi and A. Elhassouny, “Deep generative models: Survey,” in Proceedings of the International conference on intelligent systems and computer vision. IEEE, 2018, pp. 1–8. [67] A. Van Den Oord, O. Vinyals et al., “Neural discrete representation learning,” Adv. Neural Inf. Process., vol. 30, 2017. [68] M. Mirza and S. Osindero, “Conditional generative adversarial nets,” arXiv preprint arXiv:1411.1784, 2014. [69] M. Arjovsky, S. Chintala, and L. Bottou, “Wasserstein gan,” 2017. [70] A. Odena, C. Olah, and J. Shlens, “Conditional image synthesis with auxiliary classifier gans,” in Proceedings of the International conference on machine learning. PMLR, 2017, pp. 2642–2651. [71] A. Makhzani, J. Shlens, N. Jaitly, I. Goodfellow, and B. Frey, “Adver- sarial autoencoders,” arXiv preprint arXiv:1511.05644, 2015. [72] A. B. L. Larsen, S. K. Sønderby, H. Larochelle, and O. Winther, “Autoencoding beyond pixels using a learned similarity metric,” in International conference on machine learning. PMLR, 2016, pp. 1558–1566. [73] R. Rombach, A. Blattmann, D. Lorenz, P. Esser, and B. Ommer, “High-resolution image synthesis with latent diffusion models,” in Proceedings of the IEEE/CVF conference on computer vision and pattern recognition, 2022, pp. 10 684–10 695. [74] Y. Zou, J. Zhu, X. Wang, and L. Hanzo, “A survey on wireless security: Technical challenges, recent advances, and future trends,” Proc. IEEE, vol. 104, no. 9, pp. 1727–1765, 2016. [75] K.-L. Besser, C. R. Janda, P.-H. Lin, and E. A. Jorswieck, “Flexible design of finite blocklength wiretap codes by autoencoders,” in Pro- ceedings of the IEEE International Conference on Acoustics, Speech and Signal Processing. IEEE, 2019, pp. 2512–2516. [76] E. Erdemir, P. L. Dragotti, and D. G¨und¨uz, “Privacy-aware communica- tion over a wiretap channel with generative networks,” in Proceedings of the IEEE International Conference on Acoustics, Speech and Signal Processing. IEEE, 2022, pp. 2989–2993. [77] M. K. Fadul, D. R. Reising, K. Arasu, and M. R. Clark, “Adversarial machine learning for enhanced spread spectrum communications,” in Proceedings of the IEEE Military Communications Conference. IEEE, 2021, pp. 783–788. [78] M. S. Sheikh, J. Liang, and W. Wang, “A survey of security services, attacks, and applications for vehicular ad hoc networks (vanets),” Sensors, vol. 19, no. 16, p. 3589, 2019. [79] W. Shi, X. Jiang, J. Hu, Y. Teng, Y. Wang, H. He, R. Dong, F. Shu, and J. Wang, “Physical layer security techniques for future wireless networks,” arXiv preprint arXiv:2112.14469, 2021. 21 [80] P. Sweeney, Error control coding. Prentice Hall UK, 1991. [81] H. Mahdavifar and A. Vardy, “Achieving the secrecy capacity of wiretap channels using polar codes,” IEEE Trans. Inf. Theory, vol. 57, no. 10, pp. 6428–6443, 2011. [82] B. Sklar, “Rayleigh fading channels in mobile digital communication systems. i. characterization,” IEEE Comm. Mag., vol. 35, no. 7, pp. 90–100, 1997. [83] J.-Y. Zhu, R. Zhang, D. Pathak, T. Darrell, A. A. Efros, O. Wang, and E. Shechtman, “Toward multimodal image-to-image translation,” Adv. Neural Inf. Process., vol. 30, 2017. [84] N. Farsad, M. Rao, and A. Goldsmith, “Deep learning for joint source- channel coding of text,” in Proceedings of the IEEE international conference on acoustics, speech and signal processing. IEEE, 2018, pp. 2326–2330. [85] B. Sklar, Digital communications: fundamentals and applications. Pearson, 2021. [86] J. Zhang, R. Woods, T. Q. Duong, A. Marshall, Y. Ding, Y. Huang, and Q. Xu, “Experimental study on key generation for physical layer security in wireless communications,” IEEE Access, vol. 4, pp. 4464– 4477, 2016. [87] G. Li, A. Hu, J. Zhang, L. Peng, C. Sun, and D. Cao, “High-agreement uncorrelated secret key generation based on principal component analysis preprocessing,” IEEE Trans. Commun., vol. 66, no. 7, pp. 3022–3034, 2018. [88] D. Roy, T. Mukherjee, M. Chatterjee, E. Blasch, and E. Pasiliao, “RFAL: Adversarial learning for rf transmitter identification and clas- sification,” IEEE Trans. Cogn. Commun. Netw., vol. 6, no. 2, pp. 783– 801, 2019. [89] H. Han, L. Cui, W. Li, L. Huang, Y. Cai, J. Cai, and Y. Zhang, “Radio frequency fingerprint based wireless transmitter identification against malicious attacker: An adversarial learning approach,” in Proceedings of the International Conference on Wireless Communications and Signal Processing. IEEE, 2020, pp. 310–315. [90] K. S. Germain and F. Kragh, “Physical-layer authentication using chan- nel state information and machine learning,” in Proceedings of the 14th International Conference on Signal Processing and Communication Systems. IEEE, 2020, pp. 1–8. [91] F. Azam, S. K. Yadav, N. Priyadarshi, S. Padmanaban, and R. C. Bansal, “A comprehensive review of authentication schemes in vehic- ular ad-hoc network,” IEEE Access, vol. 9, pp. 31 309–31 321, 2021. [92] R. Zhang, K. Xiong, H. Du, D. Niyato, J. Kang, X. Shen, and H. V. Poor, “Generative ai-enabled vehicular networks: Fundamentals, framework, and case study,” arXiv preprint arXiv:2304.11098, 2023. [93] A. Jagannath, J. Jagannath, and P. S. P. V. Kumar, “A comprehensive survey on radio frequency (rf) fingerprinting: Traditional approaches, deep learning, and open challenges,” Comput. Netw., vol. 219, p. 109455, 2022. [94] K. Merchant, S. Revay, G. Stantchev, and B. Nousain, “Deep learning for RF device fingerprinting in cognitive communication networks,” IEEE J. Sel. Top. Signal Process., vol. 12, no. 1, pp. 160–167, 2018. [95] R. Das, A. Gadre, S. Zhang, S. Kumar, and J. M. Moura, “A deep learning approach to IoT authentication,” in Proceedings of the IEEE international conference on communications. IEEE, 2018, pp. 1–6. [96] Z. Gan, L. Chen, W. Wang, Y. Pu, Y. Zhang, H. Liu, C. Li, and L. Carin, “Triangle generative adversarial networks,” Adv. Neural Inf. Process., vol. 30, 2017. [97] Z. Wang, W. Dou, M. Ma, X. Feng, Z. Huang, C. Zhang, Y. Guo, and D. Chen, “A survey of user authentication based on channel state information,” Wirel. Commun. Mob. Comput., vol. 2021, pp. 1–16, 2021. [98] A. Siegman, “The antenna properties of optical heterodyne receivers,” Applied optics, vol. 5, no. 10, pp. 1588–1594, 1966. [99] S. Xia, X. Tao, N. Li, S. Wang, T. Sui, H. Wu, J. Xu, and Z. Han, “Multiple correlated attributes based physical layer authentication in wireless networks,” IEEE Trans. Veh. Technol., vol. 70, no. 2, pp. 1673– 1687, 2021. [100] M. Bishop, M. Carvalho, R. Ford, and L. M. Mayron, “Resilience is more than availability,” in Proceedings of the New Security Paradigms Workshop, 2011, pp. 95–104. [101] W. Wang, Y. Xu, and M. Khanna, “A survey on the communication architectures in smart grid,” Comput. Netw., vol. 55, no. 15, pp. 3604– 3629, 2011. [102] P. F. de Araujo-Filho, G. Kaddoum, M. Naili, E. T. Fapi, and Z. Zhu, “Multi-objective GAN-based adversarial attack technique for modula- tion classifiers,” IEEE Commun. Lett., vol. 26, no. 7, pp. 1583–1587, 2022. [103] Y. Cai, F. Song, Y. Xu, X. Liu, X. Zhang, and H. Han, “Spectrum waterfall completion in jamming enviroment: A general adversarial networks method,” in Proceedings of the IEEE 9th Joint International Information Technology and Artificial Intelligence Conference, vol. 9. IEEE, 2020, pp. 1661–1665. [104] H. Han, Y. Xu, Z. Jin, W. Li, X. Chen, G. Fang, and Y. Xu, “Primary-user-friendly dynamic spectrum anti-jamming access: A GAN-enhanced deep reinforcement learning approach,” IEEE Wirel. Commun. Lett., vol. 11, no. 2, pp. 258–262, 2021. [105] R. Lin, H. Qiu, J. Wang, Z. Zhang, L. Wu, and F. Shu, “Physical layer security enhancement in energy harvesting-based cognitive internet of things: A GAN-powered deep reinforcement learning approach,” IEEE Internet Things J., 2023. [106] R. Tang, D. Gao, M. Yang, T. Guo, H. Wu, and G. Shi, “GAN- inspired intelligent jamming and anti-jamming strategy for semantic communication systems,” in Proceedings of the IEEE International Conference on Communications Workshops. IEEE, 2023, pp. 1623– 1628. [107] E. Jayabalan and R. Pugazendi, “Generative adversarial networks for secure data transmission in wireless network.” Intell. Autom. Soft Comput., vol. 35, no. 3, 2023. [108] Y. Huo, Y. Tian, L. Ma, X. Cheng, and T. Jing, “Jamming strategies for physical layer security,” IEEE Wirel. Commun., vol. 25, no. 1, pp. 148–153, 2017. [109] H. Pirayesh and H. Zeng, “Jamming attacks and anti-jamming strategies in wireless networks: A comprehensive survey,” IEEE Commun. Surv. Tutor., vol. 24, no. 2, pp. 767–809, 2022. [110] Z. Wu, Y. Zhao, Z. Yin, and H. Luo, “Jamming signals classification using convolutional neural network,” in Proceedings of the IEEE Inter- national Symposium on Signal Processing and Information Technology. IEEE, 2017, pp. 062–067. [111] Y. Cai, K. Shi, F. Song, Y. Xu, X. Wang, and H. Luan, “Jamming pattern recognition using spectrum waterfall: A deep learning method,” in Proceedings of the IEEE 5th international conference on computer and communications. IEEE, 2019, pp. 2113–2117. [112] K. Arulkumaran, M. P. Deisenroth, M. Brundage, and A. A. Bharath, “Deep reinforcement learning: A brief survey,” IEEE Signal Process. Mag., vol. 34, no. 6, pp. 26–38, 2017. [113] X. Wang, J. Wang, Y. Xu, J. Chen, L. Jia, X. Liu, and Y. Yang, “Dynamic spectrum anti-jamming communications: Challenges and opportunities,” IEEE Commun. Mag., vol. 58, no. 2, pp. 79–85, 2020. [114] X. Liu, Y. Xu, L. Jia, Q. Wu, and A. Anpalagan, “Anti-jamming com- munications using spectrum waterfall: A deep reinforcement learning approach,” IEEE Commun. Lett., vol. 22, no. 5, pp. 998–1001, 2018. [115] Z. Li, J. Cao, H. Wang, and M. Zhao, “Sparsely self-supervised generative adversarial nets for radio frequency estimation,” IEEE J. Sel. Areas Commun., vol. 37, no. 11, pp. 2428–2442, 2019. [116] S. Kavaiya, D. K. Patel, Z. Ding, Y. L. Guan, and S. Sun, “Physical layer security in cognitive vehicular networks,” IEEE Trans. Commun., vol. 69, no. 4, pp. 2557–2569, 2020. [117] Y. Wang, X. Liu, M. Wang, and Y. Yu, “A hidden anti-jamming method based on deep reinforcement learning,” arXiv preprint arXiv:2012.12448, 2020. [118] D. S. Gurjar, H. H. Nguyen, and H. D. Tuan, “Wireless information and power transfer for IoT applications in overlay cognitive radio networks,” IEEE Internet Things J., vol. 6, no. 2, pp. 3257–3270, 2018. [119] D. Xu and H. Zhu, “Secure transmission for SWIPT IoT systems with full-duplex IoT devices,” IEEE Internet Things J., vol. 6, no. 6, pp. 10 915–10 933, 2019. [120] H. Du, J. Wang, D. Niyato, J. Kang, Z. Xiong, J. Zhang, and X. Shen, “Semantic communications for wireless sensing: RIS-aided encoding and self-supervised decoding,” IEEE J. Sel. Areas Commun., 2023. [121] H. Du, J. Wang, D. Niyato, J. Kang, Z. Xiong, M. Guizani, and D. I. Kim, “Rethinking wireless communication security in semantic internet of things,” IEEE Wirel. Commun., vol. 30, no. 3, pp. 36–43, 2023. [122] Y. Shi, K. Davaslioglu, and Y. E. Sagduyu, “Generative adversarial network in the air: Deep adversarial learning for wireless signal spoofing,” IEEE Trans. Cogn. Commun. Netw., vol. 7, no. 1, pp. 294– 303, 2020. [123] T. Roy, T. O’Shea, and N. West, “Generative adversarial radio spectrum networks,” in Proceedings of the ACM Workshop on Wireless Security and Machine Learning, 2019, pp. 12–15. [124] J. Li, X. Zhu, M. Ouyang, W. Li, Z. Chen, and Q. Fu, “GNSS spoofing jamming detection based on generative adversarial network,” IEEE Sens. J., vol. 21, no. 20, pp. 22 823–22 832, 2021. 22 [125] M. H. Yılmaz and H. Arslan, “A survey: Spoofing attacks in physical layer security,” in Proceedings of the IEEE 40th Local Computer Networks Conference Workshops. IEEE, 2015, pp. 812–817. [126] NVIDIA, “Jetson Nano Developer Kit,” https://developer.nvidia.com/ embedded/jetson-nano-developer-kit. [127] Xilinx, “Zynq UltraScale+ MPSoC,” https://www.xilinx.com/products/ silicon-devices/soc/zynq-ultrascalempsoc.html. [128] C. U. Ndujiuba, O. Oni, and A. E. Ibhaze, “Comparative analysis of digital modulation techniques in LTE 4G systems,” J. Wirel. Commun. Netw., vol. 5, no. 2, pp. 60–66, Feb. 2015. [129] A. Marzouk, P. Barros, M. Eppe, and S. Wermter, “The conditional boundary equilibrium generative adversarial network and its application to facial attributes,” in Proceedings of the International Joint Confer- ence on Neural Networks. IEEE, 2019, pp. 1–7. [130] E. D. Kaplan and C. Hegarty, Understanding GPS/GNSS: principles and applications. Artech house, 2017. [131] Y. Alginahi et al., “Preprocessing techniques in character recognition,” Character recognition, vol. 1, pp. 1–19, 2010. [132] J. Bhatti and T. E. Humphreys, “Hostile control of ships via false GPS signals: Demonstration and detection,” Navig. J. Inst., vol. 64, no. 1, pp. 51–66, 2017. [133] Q. Feng, Y. Zhang, C. Li, Z. Dou, and J. Wang, “Anomaly detection of spectrum in wireless communication via deep auto-encoders,” J. Supercomput., vol. 73, pp. 3161–3178, 2017. [134] A. Gkelias and K. K. Leung, “GAN-based detection of adversarial EM signal waveforms,” in Proceedings of the IEEE Military Communica- tions Conference. IEEE, 2022, pp. 356–361. [135] D. Cheng, Y. Fan, S. Fang, M. Wang, and H. Liu, “ResNet-AE for radar signal anomaly detection,” Sens., vol. 22, no. 16, p. 6249, 2022. [136] T. Luo and S. G. Nagarajan, “Distributed anomaly detection using autoencoder neural networks in WSN for IoT,” in Proceedings of the IEEE international conference on communications. IEEE, 2018, pp. 1–6. [137] H. Lu, M. Du, K. Qian, X. He, and K. Wang, “GAN-based data aug- mentation strategy for sensor anomaly detection in industrial robots,” IEEE Sens. J., vol. 22, no. 18, pp. 17 464–17 474, 2021. [138] A. Toma, A. Krayani, L. Marcenaro, Y. Gao, and C. S. Regazzoni, “Deep learning for spectrum anomaly detection in cognitive mmwave radios,” in Proceedings of the IEEE 31st Annual International Sympo- sium on Personal, Indoor and Mobile Radio Communications. IEEE, 2020, pp. 1–7. [139] G. Rathinavel, N. Muralidhar, N. Ramakrishnan, and T. O’Shea, “Efficient generative wireless anomaly detection for next generation networks,” in Proceedings of the IEEE Military Communications Conference. IEEE, 2022, pp. 594–599. [140] V. Chandola, A. Banerjee, and V. Kumar, “Anomaly detection: A survey,” ACM Comput. Surv., vol. 41, no. 3, pp. 1–58, 2009. [141] S. El Hajjami, J. Malki, M. Berrada, and B. Fourka, “Machine learning for anomaly detection. performance study considering anomaly dis- tribution in an imbalanced dataset,” in Proceedings of the 5th Inter- national Conference on Cloud Computing and Artificial Intelligence: Technologies and Applications. IEEE, 2020, pp. 1–8. [142] Y. Liu, H. Du, D. Niyato, J. Kang, Z. Xiong, D. I. Kim, and A. Jamalipour, “Deep generative model and its applications in efficient wireless network management: A tutorial and case study,” arXiv preprint arXiv:2303.17114, 2023. [143] J. M. Elson and J. M. Bennett, “Calculation of the power spectral density from surface profile data,” Applied optics, vol. 34, no. 1, pp. 201–208, 1995. [144] M. Fil, M. Mesinovic, M. Morris, and J. Wildberger, “beta- VAE reproducibility: Challenges and extensions,” arXiv preprint arXiv:2112.14278, 2021. [145] F. Thabtah, S. Hammoud, F. Kamalov, and A. Gonsalves, “Data imbalance in classification: Experimental evaluation,” Inf. Sci., vol. 513, pp. 429–441, 2020. [146] J. Lee and K. Park, “GAN-based imbalanced data intrusion detection system,” Pers. Ubiquitous Comput., vol. 25, pp. 121–128, 2021. [147] M. Ravanbakhsh, M. Baydoun, D. Campo, P. Marin, D. Martin, L. Marcenaro, and C. S. Regazzoni, “Learning multi-modal self- awareness models for autonomous vehicles from human driving,” in Proceedings of the 21st International Conference on Information Fusion. IEEE, 2018, pp. 1866–1873. [148] K. Friston, B. Sengupta, and G. Auletta, “Cognitive dynamics: From attractors to active inference,” Proc. IEEE, vol. 102, no. 4, pp. 427–445, 2014. [149] A. Martian, B. T. Sandu, O. Fratu, I. Marghescu, and R. Craciunescu, “Spectrum sensing based on spectral correlation for cognitive radio systems,” in Proceedings of the 4th International Conference on Wireless Communications, Vehicular Technology, Information Theory and Aerospace & Electronic Systems. IEEE, 2014, pp. 1–4. [150] F. T. Liu, K. M. Ting, and Z.-H. Zhou, “Isolation forest,” in Proceedings of the 8th ieee international conference on data mining. IEEE, 2008, pp. 413–422. [151] Y. Wang, J. Wong, and A. Miner, “Anomaly intrusion detection using one class SVM,” in Proceedings from the Fifth Annual IEEE SMC Information Assurance Workshop. IEEE, 2004, pp. 358–364. [152] T. Schlegl, P. Seeb¨ock, S. M. Waldstein, G. Langs, and U. Schmidt- Erfurth, “f-AnoGAN: Fast unsupervised anomaly detection with gen- erative adversarial networks,” Med. Image Anal., vol. 54, pp. 30–44, 2019. [153] L. Guo, Y. Liu, Y. Li, and K. Yang, “High-precision reconstruction method based on MTS-GAN for electromagnetic environment data in sagiot,” Eurasip J. Adv. Signal Process, vol. 2023, no. 1, p. 125, 2023. [154] A. H. Estiri, M. R. Sabramooz, A. Banaei, A. H. Dehghan, B. Jami- alahmadi, and M. J. Siavoshani, “A variational auto-encoder approach for image transmission in noisy channel,” in Proceedings of the 10th International Symposium onTelecommunications. IEEE, 2020, pp. 227–233. [155] X. Chai, H. Gu, F. Li, H. Duan, X. Hu, and K. Lin, “Deep learning for irregularly and regularly missing data reconstruction,” Scientific reports, vol. 10, no. 1, p. 3302, 2020. [156] L. H. Nguyen, T. Tran, and T. Do, “Sparse models and sparse recovery for ultra-wideband SAR applications,” IEEE Trans. Aerosp. Electron. Syst., vol. 50, no. 2, pp. 940–958, Feb. 2014. [157] A. Moreira, P. Prats-Iraola, M. Younis, G. Krieger, I. Hajnsek, and K. P. Papathanassiou, “A tutorial on synthetic aperture radar,” IEEE Geosci. Remote Sens. Mag., vol. 1, no. 1, pp. 6–43, Jan. 2013. [158] T. Helleseth and C. Li, “Pseudo-noise sequences,” in Concise Encyclo- pedia of Coding Theory. Chapman and Hall/CRC, 2021, pp. 613–644. [159] W. Jiang and A. Liu, “Image motion deblurring based on deep residual shrinkage and generative adversarial networks,” Comput. Intell. Neurosci., vol. 2022, pp. 1–15, 2022. [160] A. Vaswani, N. Shazeer, N. Parmar, J. Uszkoreit, L. Jones, A. N. Gomez, Ł. Kaiser, and I. Polosukhin, “Attention is all you need,” Proc. Adv. Neural Inf. Process. Syst., vol. 30, 2017. [161] A. Coates, A. Ng, and H. Lee, “An analysis of single-layer networks in unsupervised feature learning,” in Proceedings of the 14th international conference on artificial intelligence and statistics. JMLR Workshop and Conference Proceedings, 2011, pp. 215–223. [162] D. Brunet, E. R. Vrscay, and Z. Wang, “On the mathematical properties of the structural similarity index,” IEEE Trans. Image Process., vol. 21, no. 4, pp. 1488–1499, Apr. 2011. [163] Y. Jiang, S. Chang, and Z. Wang, “Transgan: Two transformers can make one strong gan,” arXiv preprint arXiv:2102.07074, vol. 1, no. 3, 2021. [164] T. K. Boppana and P. Bagade, “GAN-AE: An unsupervised intrusion detection system for MQTT networks,” Eng Appl Artif Intell, vol. 119, p. 105805, 2023. [165] Z. Wang, J. Zhang, H. Du, D. Niyato, S. Cui, B. Ai, M. Debbah, K. B. Letaief, and H. V. Poor, “A tutorial on extremely large-scale MIMO for 6G: Fundamentals, signal processing, and applications,” IEEE Commun. Surv. Tutor., 2024. [166] H. Du, R. Zhang, D. Niyato, J. Kang, Z. Xiong, D. I. Kim, X. S. Shen, and H. V. Poor, “Exploring collaborative distributed diffusion-based AI-generated content (AIGC) in wireless networks,” IEEE Network, no. 99, pp. 1–8, 2023. [167] Y. Shi, B. Paige, P. Torr et al., “Variational mixture-of-experts autoen- coders for multi-modal deep generative models,” Proc. Adv. Neural Inf. Process. Syst., vol. 32, 2019. [168] J. Chen, G. Liu, and X. Chen, “AnimeGAN: A novel lightweight gan for photo animation,” in International symposium on intelligence computation and applications. Springer, 2020, pp. 242–256. [169] D. M. Vo, A. Sugimoto, and H. Nakayama, “PPCD-GAN: Progressive pruning and class-aware distillation for large-scale conditional GANs compression,” in Proceedings of the IEEE/CVF Winter Conference on Applications of Computer Vision, 2022, pp. 2436–2444. [170] H. Du, R. Zhang, Y. Liu, J. Wang, Y. Lin, Z. Li, D. Niyato, J. Kang, Z. Xiong, S. Cui et al., “Beyond deep reinforcement learning: A tutorial on generative diffusion models in network optimization,” arXiv preprint arXiv:2308.05384, 2023. "
}