{
    "optim": "IDENTIFYING PROBABILISTIC WEATHER REGIMES TARGETED TO\nA LOCAL-SCALE IMPACT VARIABLE\nFiona R. Spuler\nDepartment of Meteorology\nUniversity of Reading, Reading, UK\nf.r.spuler@pgr.reading.ac.uk\nMarlene Kretschmer\nLeipzig Institute for Meteorology\nUniversity of Leipzig,\nLeipzig, Germany\nYevgeniya Kovalchuk\nCentre for Advanced Research Computing\nUniversity College London\nLondon, UK\nMagdalena Alonso Balmaseda\nEuropean Centre for Medium-Range\nWeather Forecasts\nReading, UK\nTheodore G. Shepherd\nDepartment of Meteorology,\nUniversity of Reading\nReading, UK\nFebruary 28, 2024\nABSTRACT\nWeather regimes are recurrent and persistent large-scale atmospheric circulation patterns that modulate\nthe occurrence of local impact variables such as extreme precipitation. In their capacity as mediators\nbetween long-range teleconnections and these local extremes, they have shown potential for improving\nsub-seasonal forecasting as well as long-term climate projections. However, existing methods for\nidentifying weather regimes are not designed to capture the physical processes relevant to the impact\nvariable in question while still representing the full atmospheric phase space. This paper introduces a\nnovel probabilistic machine learning method, RMM-VAE, for identifying weather regimes targeted to\na local-scale impact variable. Based on a variational autoencoder architecture, the method combines\nnon-linear dimensionality reduction with a prediction task and probabilistic clustering in a coherent\narchitecture. The new method is applied to identify circulation patterns over the Mediterranean region\ntargeted to precipitation over Morocco and compared to three existing approaches, two established\nlinear methods and another machine learning approach. The RMM-VAE method identifies regimes\nthat are more predictive of the target variable compared to the two linear methods, and more robust\nand persistent compared to the alternative machine learning method, while also improving the\nreconstruction of the input space. The results demonstrate the potential benefit of the new method\nfor use in various climate applications such as sub-seasonal forecasting, while also highlighting the\ntrade-offs involved in targeted clustering.\nKeywords weather regimes · variational autoencoders · Mediterranean precipitation · extreme events\n1\nIntroduction\n1.1\nWeather Regimes\nLarge-scale atmospheric circulation modulates the occurrence of regional extremes such as heavy precipitation and heat\nwaves that cause devastating impacts on people and livelihoods across the planet. In a changing climate, preparing for\nthese extreme events becomes even more important and requires both an understanding of their projected long-term\nchanges to make well-informed and robust adaptation decisions [Lemos et al., 2012], as well as an improvement of their\nnear-term prediction skill to support early-warning decisions [Coughlan de Perez et al., 2022]. Low-frequency variability\nof the large-scale atmospheric circulation has been understood through different research methods and paradigms\n[Ghil and Robertson, 2002]. One common approach is the identification of recurrent and persistent atmospheric states,\narXiv:2402.15379v2  [physics.geo-ph]  27 Feb 2024\nRMM-VAE\nSPULER ET AL. 2024\nso-called weather regimes, based on statistical dimensionality reduction and clustering of variables such as geopotential\nheight data over the region of interest [Hannachi et al., 2017].\nFor many applications, weather regimes can be interpreted as discrete mediators between teleconnections in the climate\nsystem and regional impact variables [Cassou, 2008, Gonzalez et al., 2022]. For example, large-scale atmospheric\npatterns such as weather regimes have been used to disentangle dynamic and thermodynamic components of climate\nchange for extreme event attribution or quantify the role of atmospheric internal variability in observed trends [Cattiaux\net al., 2010, Horton et al., 2015, Terray, 2021], or to statistically downscale climate models [Ailliot et al., 2009,\nMaraun et al., 2010]. Moreover, weather regimes have been shown to improve the usability and skill of forecasts at\nsub-seasonal-to-seasonal timescales [Allen et al., 2021, Bloomfield et al., 2021], due to their interpretability, persistence,\nas well as teleconnections with the Madden-Julian Oscillation [Gadouali et al., 2020], the El-Niño Southern Oscillation\n[Lee et al., 2019], or stratospheric states [Charlton-Perez et al., 2018], although different teleconnections will be relevant\nfor different regions and timescales.\nAlthough weather regimes over the North Atlantic/European region are the most extensively studied [Michelangeli et al.,\n1995, Vautard, 1990], weather regimes over other regions such as the Mediterranean [Giuntoli et al., 2022, Mastrantonas\net al., 2020], the Indian subcontinent [Neal et al., 2020] and North America [Lee et al., 2023, Straus et al., 2007] have\nalso been analysed and used in applications such as sub-seasonal forecasting [Robertson et al., 2020].\n1.2\nDimensionality reduction and clustering for identifying regimes\nWeather regimes are commonly identified using a combination of dimensionality reduction and clustering methods.\nWhile the dimensionality reduction step projects the high-dimensional data into a lower-dimensional subspace, the\nclustering step subsequently identifies and assigns discrete regimes within this reduced space [Murphy, 2022].\nFollowing Michelangeli et al. [1995], Principal Component Analysis (PCA, often referred to as Empirical Orthogonal\nFunction analysis in atmospheric sciences [Hannachi et al., 2007]) and k-means have established themselves as common\nchoices for dimensionality reduction and clustering respectively. The advantage of this combination of methods is that\nthey are easy to compute, understand, and interpret. However, they are not inherently more physically meaningful\nthan other statistical dimensionality reduction and clustering methods, and several critiques have been highlighted and\nalternatives proposed in the literature on weather regimes. The present discussion is focused on critical aspects relevant\nto the analysis in this paper; for a detailed overview of different methodologies, see Hannachi et al. [2017] and Feldstein\nand Franzke [2017]. Figure 1 illustrates some of the possible choices discussed in the following.\nIn terms of dimensionality reduction methods, PCA can be explicitly determined as the solution of an eigenvalue\nequation thanks to its linear and non-probabilistic nature. However, the linear transformation applied is not necessarily\nphysically meaningful [Jolliffe and Cadima, 2016] or optimal for encoding the underlying features of the data [Murphy,\n2022]. Furthermore, a probabilistic method such as factor analysis should in general be preferred for the task of\nstatistically identifying a subspace of limited and noisy high-dimensional data to better capture the uncertainty of\nthe identified solution [Falkena et al., 2023]. In terms of machine learning methods for dimensionality reduction,\nautoencoders can be seen as a non-linear extension of PCA implemented through an encoder and decoder neural\nnetwork. Autoencoders are more efficient at encoding the input data compared to PCA but suffer from the fact that\nthe identified latent space is not necessarily continuous which is an obstacle to subsequent clustering [Murphy, 2022].\nVariational autoencoders (VAEs) address the limitations of autoencoders by explicitly fitting a probabilistic model\nusing Bayesian variational inference and thereby regularizing the dimensionality-reduced space, providing a both\nprobabilistic and non-linear alternative to PCA [Kingma and Welling, 2013]. Although the transformation into the\ndimensionality-reduced space can no longer be provided analytically, VAEs have been shown to provide an improved\nrepresentation of the high-dimensional input space in lower dimensions in various machine learning applications,\nincluding the identification of weather regimes [Baldo and Locatelli, 2022].\nIn terms of clustering methods, k-means is susceptible to noise and loses information on transitional states between\ndifferent weather regimes due to its hard cluster assignment [Falkena et al., 2023]. Gaussian mixture models constitute\na probabilistic alternative where clusters are fitted as probability distributions, and each data point is associated with\nprobabilities of belonging to different clusters. K-means clustering also requires determining the number of clusters a\npriori, the most suitable method for which is not settled and has led to ongoing discussion in the literature [Dorrington\nand Strommen, 2020, Falkena et al., 2020, Feldstein and Franzke, 2017].\nAlong with the identification of the optimal number of clusters, the scientific and statistical interpretation of the\nweather regimes themselves has been subject to discussion in the literature [Stephenson et al., 2004]. In the present\nmanuscript, weather regimes are interpreted as statistical representations of the underlying physical processes that\nshould be statistically robust and relevant to the intended use case, without making any stronger assumptions about the\nmulti-modality of the underlying probability density distribution.\n2\nRMM-VAE\nSPULER ET AL. 2024\nFigure 1: Illustration of selected methodological choices for dimensionality reduction and clustering based on Hannachi\net al. [2017] and Murphy [2022]. Methods highlighted in green refer to joint dimensionality reduction methods between\ntwo high-dimensional spaces. Also mentioned are clustering methods that incorporate temporal information into the\nregime assignment such as Hidden Markov Models although they are not discussed further in this paper\n1.3\nResearch gap: targeted weather regimes\nEven though the relationship between weather regimes and extremes in local impact variables such as precipitation\nis a key motivation for their investigation, there are no comprehensive methods available for identifying probabilistic\nweather regimes targeted to a specific impact variable. Here, ’targeted’ means that physical processes relevant to the\nimpact variable are specifically, resolved and well-separated in the resulting weather regimes, thereby enhancing the\npredictive skill of clusters for this impact variable while still capturing the complete dynamics of the atmospheric\ncirculation phase space.\nTo account for a local impact variable, existing approaches have either pre-filtered geopotential height data to extreme\nimpact days [Rouges et al., 2023], clustered the impact variable directly [Bloomfield et al., 2020, Ullmann et al., 2014],\nor chosen the cluster number based on how much information the resulting clusters capture about the impact variable\n[Gadouali et al., 2020, Mastrantonas et al., 2020]. However, all of these approaches compromise either completeness of\nthe dimensionality reduction or regime persistence and knowledge of transition dynamics, which limits their usefulness\nfor various climate applications such as extended-range forecasting. Building a purely predictive machine learning\nmodel would suffer from the same limitations in this context.\nAt the same time, there are a number of statistical methods to identify related subspaces of two high-dimensional\ndatasets: canonical correlation analysis (CCA), for example, identifies linear transformations such that the two reduced\nspaces are maximally correlated [Murphy, 2022], and has been applied by Vrac and Yiou [2010] in combination with\nk-means clustering to identify weather regimes targeted to rainfall over France. However, the approach itself remains\nlinear and non-probabilistic while the variables are only projected into partial subspaces (see also Figure 1).\n1.4\nContribution\nThis paper presents a novel machine learning method for identifying probabilistic weather regimes that provide enhanced\npredictability of a local scale impact variable while capturing the full phase space of atmospheric circulation in a reduced\nspace. The proposed method, called RMM-VAE (Regression Mixture Model Variational Autoencoder), integrates\ntargeted dimensionality reduction using a variational autoencoder with probabilistic clustering using a Gaussian mixture\nmodel into one coherent statistical model. It extends previous machine learning architectures reported by Zhao et al.\n[2019a], abbreviated R-VAE (Regression - VAE), which incorporate a co-variate into the dimensionality reduction step\nof a VAE model.\n3\nRMM-VAE\nSPULER ET AL. 2024\nTo demonstrate the performance of the RMM-VAE method, we apply it to the task of identifying weather regimes over\nthe Mediterranean region in extended winter (November to March), targeted to precipitation over Morocco, which\nserves as our impact variable here. While the predictive skill for precipitation conditional on Mediterranean weather\nregimes has shown promise over Morocco [Mastrantonas et al., 2022], predictability has been understudied in this\nregion with studies of the Mediterranean region frequently directed towards the European continent. This provides\nour motivation for considering this particular region. We compare the performance of RMM-VAE to two established\nlinear approaches (PCA + k-means, and CCA + k-means), as well as the R-VAE method [Zhao et al., 2019a] which\nis combined with k-means clustering (R-VAE + k-means). The performance of all four methods is assessed on three\nobjectives of targeted clustering: reconstruction of the input space, persistent and well-separated clusters, and predictive\nskill with respect to the target variable.\nThe remainder of this paper is structured as follows. Section 2 provides a detailed description of the different methods,\nwhile section 3 describes the data used and pre-processing steps applied, as well as implementation details and parameter\nchoices. After analysing the results of the different targeted clustering methods in Section 4, Section 5 discusses and\nconcludes the findings of this paper.\n2\nMethods\nFour different methods are implemented to compute weather regimes. They all combine dimensionality reduction of\nthe input space X with clustering, using different methods explained below. All methods except for the first, PCA +\nk-means, explicitly integrate the target variable, t, in the identification of weather regimes.\n2.1\nPrincipal component analysis and k-means clustering (PCA + k-means)\nThe PCA + k-means method combines linear dimensionality reduction using principal component analysis (PCA) with\nsubsequent clustering using k-means to identify weather regimes. PCA is a linear transformation of the data onto a\nsubspace spanned by the orthogonal eigenvectors of the covariance matrix Cxx of the dataset X. Several extensions of\nPCA exist, such as rotated-EOF analysis to improve physical interpretability [Hannachi et al., 2009], although the most\ncommon form described above is implemented in this analysis. k-means clustering iteratively partitions the data into k\nsets with the objective of minimizing the within-cluster squared distance from the cluster centre. Jolliffe and Cadima\n[2016] and Murphy [2022] respectively provide a detailed overview and description of the two methods. While this\ncombination of methods does not explicitly incorporate information about the target variable t, it is implemented as a\nbaseline method as it is the most commonly applied method for identifying weather regimes.\n2.2\nCanonical correlation analysis and k-means clustering (CCA + k-means)\nSimilarly, the CCA + k-means method combined a linear dimensionality reduction method with k-means clustering.\nCanonical correlation analysis (CCA) is a dimensionality reduction method that identifies linear transformations of\ntwo spaces, X and t, into respective subspaces such that the correlation between the projections of the variables onto\ntheir new basis vectors is maximized. The method is symmetric, meaning the spaces X and t are treated in the same\nmanner. CCA is applied to the input space X and target space t, and subsequently, the transformed input space X\nis clustered using the k-means clustering algorithm. CCA can be expressed as identifying solutions to the eigenvalue\nequation Johnson and Wichern [2013]\nB−1A ˆ\nw = ρ ˆ\nw, where A =\n\u0012\n0\nCxt\nCtx\n0\n\u0013\n, and B =\n\u0012\nCxx\n0\n0\nCtt\n\u0013\n.\n(1)\nHence CCA linearly transforms both the input and target variable into dimensionality-reduced spaces that are maximally\ncorrelated. This combination of methods is implemented to identify targeted clusters based on an established, linear\ndimensionality reduction method.\n2.3\nRegression variational autoencoder (R-VAE + k-means)\nThe R-VAE + k-means method is a targeted approach to the identification of weather regimes. It is based on a variational\nautoencoder architecture presented by Zhao et al. [2019a] which includes a scalar co-variate into the dimensionality\nreduction step with application to brain image analysis. A non-variational autoencoder architecture that incorporates a\nscalar regression variable has previously also been presented by Heinze-Deml et al. [2021]. In this paper, a targeted\ndimensionality reduction using a variational autoencoder is combined with subsequent k-means clustering as a simple\n4\nRMM-VAE\nSPULER ET AL. 2024\nFigure 2: Schematic diagram of the R-VAE + k-means method which combines a VAE encoder with a prediction\ntask, and subsequently clusters the resulting latent space using k-means to identify the weather regimes. Based on the\narchitecture developed by Zhao et al. [2019a]\nclustering method and applied to a climate application for the first time. An illustration of the model is shown in Figure\n2.\n2.3.1\nVariational inference\nFor a standard variational autoencoder, represented as a probabilistic graphical model in Figure 3a, with latent variables\nz, input data x and parameters θ, the normalization constant pθ(x) =\nR\npθ(x, z)dz required to compute the model\nposterior pθ(z | x) is, in general, computationally intractable. To resolve this, the loss function of a variational\nautoencoder is derived using Bayesian variational inference [Murphy, 2023]. Variational inference introduces a function\nqϕ from a selected distributional family with parameters ϕ to approximate the intractable posterior by minimizing the\nfollowing Kullback-Leibler divergence between the true and approximated posterior:\nϕ∗ = argminϕDKL (qϕ(z | x), pθ(z | x))\n= argminϕEqϕ(z)[log qϕ(z | x) − log pθ(z | x) − log pθ(z)] + log pθ(x)\n= argminϕL(θ, ϕ | x) + log pθ(x).\n(2)\nThe Evidence Lower Bound L(θ, ϕ | x), which is the part of the KL-divergence that depends on the parameters ϕ, can\nthen be minimized to provide a best variational estimate of our model, using, for example, the Expectation-Maximization\nAlgorithm [Murphy, 2023]. Kingma and Welling [2013] adapt variational inference to autoencoders using the Stochastic\nGradient Variational Bayes (SGVB) estimator and introduce a reparameterization trick to generate samples from the\nprobabilistic encoder qϕ(z | x) while still being able to backpropagate information through the network.\n2.3.2\nLoss function derivation for the R-VAE method\nThe loss function for the extended variational autoencoder shown in Figure 3b, R-VAE, is derived similarly using\nBayesian variational inference. Here, the inference model encodes not only the input space but also predicts a scalar\ntarget variable t. The latent space estimated by the encoder is then regularized by penalizing divergence from the\nlatent space reconstructed from the predicted target variable. The resulting N-dimensional reduced space is clustered\nusing k-means. Based on the assumptions encoded in the graphical model shown in Figure 3b, the joint probability\ndistributions of the model can then be written as:\npθ(x, z, t) = pθ(x | z)pθ(z | t)pθ(t), and qϕ(z, t | x) = qϕ(z | x)qϕ(t | x).\n(3)\nBased on these assumptions, the following loss function is derived as the KL divergence of the two probability\ndistributions, for the full derivation see appendix ??:\nL(x) = −DKL (qϕ(z, t | x) | pθ(z, x, t))\n(4)\n= Eqϕ(z|x) [log pθ(x | z)] − Eqϕ(t|x) [DKL(qϕ(z | x) | pθ(z | t))] − DKL (qϕ(t | x) | pθ(t)) .\n5\nRMM-VAE\nSPULER ET AL. 2024\nFigure 3: Different variational autoencoder models represented as probabilistic graphical models using plate notation.\na) A standard VAE with input variable x, latent variable z, prior Φz and parameters θ, b) the R-VAE method with an\nadditional target variable t, and c) the RMM-VAE method with probabilistic cluster assignment c with prior Πk. In all\npanels, dashed lines indicate the inference model and solid lines the generative model\nThe two components of the inference model, qϕ(z | x) and qϕ(t | x), are parametrized as N-dimensional Gaussian\ndistributions and estimated using non-linear functions with parameters ϕ. Similarly, the probabilistic decoder is\nparametrized as a Gaussian and the mean modelled as a nonlinear function with parameters θ. Under the assumption that\nthe decoder captures the nonlinearity of the generative model, a linear model for pθ(z | t) ∼ N(at, I) is implemented,\nwhere a is a vector of unit norm. This constrains the number of parameters the model has to fit overall.\nAs in the standard VAE model, the first term represents the reconstruction loss of the dimensionality reduction, while the\nthird term penalizes divergence of the predicted target variable qϕ(t | x) from the ground truth data p(t). The second\nterm holds the key to understanding this targeted approach to dimensionality reduction: there are two estimations of the\nlatent space in the model, one based on a pure dimensionality reduction of the original data qϕ(z | x), and one based\non the predicted target variable pθ(z | t). The second term penalizes the divergence between those two terms which\nrepresent the two objectives of the model, weighted by the estimate of the target variable qϕ(t | x). Finally, k-means is\napplied to the dimensionality reduced space z which is an output of the non-linear encoder.\n2.4\nRegression - Mixture Model Variational Autoencoder (RMM-VAE)\nWhile the R-VAE + k-means method directly includes a target variable in the identification of weather regimes, it\nimplements the targeted dimensionality reduction, using a multi-dimensional Gaussian to regularize the latent space,\nand the clustering in two separate steps, which is somewhat duplicative.\nTherefore, we propose a new approach, RMM-VAE, which fits a Gaussian mixture model, an established probabilistic\nclustering method [Murphy, 2022, Feldstein and Franzke, 2017], directly into the latent space instead of performing\nthe clustering in a separate step, thereby estimating both targeted and probabilistic weather regimes in one coherent\nstatistical model. More precisely, the multi-dimensional Gaussian chosen to regularize the latent space in the R-VAE\nmethod is replaced by k individual Gaussians with mean µk and standard deviation σk. In addition, the probability cik\nof the datapoint xi belonging to cluster k is estimated. This builds on architectures combining variational autoencoders\nwith mixture models presented, for example, by Ye and Bors [2020], Zhao et al. [2019b] and Jiang et al. [2017]. An\nillustration of the model developed in this paper that incorporates a targeted dimensionality reduction with a mixture\nmodel fit is shown in Figure 4.\nAs for the R-VAE method, the conditional independence assumptions embedded in the corresponding graphical model\nshown in Figure 3c are used to re-write the joint probability distribution of the model and derive the loss function of the\nmodel:\nL(x) = −DKL(qϕ(z, c, t | x) | pθ(x, z, t, c))\n=\nX\nk\nqϕ(ck | x)\n\u0014\nEqϕ(z|x)[log pθ(x | z)] − Eqϕ(t|x)[DKL(qϕ(z | x) | p(z | t))]\n− DKL(qϕ(t | x) | p(t)) − DKL(qϕ(z | x) | pθ(z | ck))\n\u0015\n− DKL(qϕ(ck | x) | p(ck)).\n(5)\nThe first three terms in brackets correspond to the terms of the R-VAE loss function for an individual mixture component:\nthe reconstruction loss, the divergence of the estimated target variable qϕ(t | x) from the ground truth data, and the\n6\nRMM-VAE\nSPULER ET AL. 2024\nFigure 4: Schematic diagram of the proposed RMM-VAE approach, which combines a regression VAE (R-VAE) with\nprobabilistic clustering using mixture models (MM) to identify the weather regimes\ndivergence between the latent spaces generated from the target variable p(z | t) and the latent space encoded from\nthe input data qϕ(z | x)), all weighted by the cluster assignment qϕ(ck | x). The fourth term of the loss function\nminimizes the divergence between the cluster mean k and the latent space estimated from the input data, again weighted\nby the probability of cluster k occurring, qϕ(ck | x). The final term regularizes the cluster assignment qϕ(ck | x) to the\nprevious cluster occurrence frequency p(ck).\nThe components of the inference model qϕ(z | x) and qϕ(t | x), and generative model pθ(x | z) and pθ(z | t), are\nparametrized as in the previous method. p(ck) is a categorical distribution populated by the occurrence frequency\nof the different clusters updated at each step. This occurrence frequency is used as prior for the probabilistic cluster\nassignment of an individual day qϕ(ck | x). Individual mixture components p(z|ck) are modelled as Gaussians with\nmean µ and the identity covariance matrix. The latter choice is made to constrain the number of parameters and avoid\nmodel overfitting. The same choices of layer number, epochs, and activation function as for the R-VAE method were\nadopted here.\n3\nExperiments\n3.1\nData\nWe compute weather regimes over the Mediterranean region (lat: 25°N - 50°N; lon: 20°W - 45°E) in extended winter\n(Nov - Mar). The study focuses on the extended winter months as most of the observed annual as well as extreme\nprecipitation and associated flood events over Morocco have occurred during this season [Loudyi et al., 2022]. As input\ndata, we use ERA5 reanalysis data from 1940 to 2022 [Hersbach et al., 2020] of geopotential height at 500hPa (z500)\nre-gridded to a resolution of 2.5°x2.5°. The data was standardized by subtracting the climatological daily mean and\ndividing the result by the standard deviation over the entire extended winter.\nAs the target variable, ERA5 reanalysis data of daily total precipitation in a region over Morocco (lat: 30°N — 36°N; lon:\n11°W — 0°E, resolution: 0.5°x0.5°) over the same period was used. Figure 5 shows the annual mean and 95th-percentile\nprecipitation over the selected region. Precipitation data was normalized by applying a Box-Cox transformation at each\ngrid cell [Box and Cox, 1964]. A three-day running average of daily total precipitation and a five-day running average\nof z500 were taken to reflect the duration of extreme precipitation events and associated weather systems during the\nobservational period [Dayan et al., 2015, Loudyi et al., 2022, Ullmann et al., 2014].\n3.2\nParameter choices and implementation\nThe encoders of both VAE methods are implemented using three dense layers of decreasing dimensionality of 128, 64\nand 28 respectively. A batch size of 64 and the ReLU activation function are chosen. For 100 epochs, the model is\n7\nRMM-VAE\nSPULER ET AL. 2024\nFigure 5: Extended winter precipitation (November - March) over the selected region over Morocco based on ERA5\nreanalysis data from 1940-2022. Left-side: daily mean precipitation. Right-side: 95th percentile of daily precipitation\nTable 1: Overview of methods for the identification of weather regimes and associated parameter choices.\nAbbreviation\nMethod\nβ\nPrecipitation data\nPCA\nPCA + k-means\n-\nNone\nCCA\nCCA + k-means\n-\nt - full daily precipitation field at 0.25° resolution\nR-VAE v1\nR-VAE + k-means\n1\nt - spatially averaged daily precipitation (scalar)\nR-VAE v2\nR-VAE + k-means\n0.1\n\" - \"\nRMM-VAE v1\nRMM-VAE\n1\n\" - \"\nRMM-VAE v2\nRMM-VAE\n0.5\n\" - \"\nfirst trained on a training set comprised of two-thirds of the data and tested on the remaining third, and subsequently\nfitted again using a random weights initialization on the entire dataset. For the implementation of the neural network\narchitectures, the Python package KERAS [Chollet et al., 2015] was used. For a number of the evaluation metrics as\nwell as the implementation of the two linear methods, the Python package SCIKIT-LEARN [Pedregosa et al., 2011] was\nemployed.\nTable 1 provides an overview of the compared methods along with relevant hyperparameters. A 10-dimensional latent\nspace was implemented for all the methods, and cluster numbers between 4 and 10 were investigated based on the\nunderstanding that the correct number of clusters will depend on the use case [Feldstein and Franzke, 2017] and cannot\nbe determined in a general sense in all regions. The sensitivity of the results to both these choices was investigated,\nwith the sensitivity of the clusters to sub-sampling for different choices of k shown in Appendix ??. Based on these\nresults, k=5 was identified as a reasonable choice of cluster number to visualise in the results section where required.\nFor both VAE methods, the inclusion of a hyperparameter β based on Higgins et al. [2017] is investigated. The\nhyperparameter is multiplied with the respective first terms in equations 4 and 5 which represent the reconstruction loss,\nthereby changing the weight of the reconstruction objective in the loss function. Two values of β are explored for each\nof the two methods, whereby v1 (β = 1) corresponds to the original loss function without the inclusion of an additional\nhyperparameter, and v2 (β < 1) decreases the importance of the reconstruction loss term in the loss function. Selected\nvalues for β are shown in table 1.\n4\nResults\nThe four methods PCA + k-means, CCA + k-means, R-VAE + k-means and RMM-VAE, are compared along different\nevaluation metrics chosen to cover three objectives of targeted clustering: representation of the complete phase space\nof atmospheric circulation, predictive skill, and cluster robustness. The identified weather regimes and associated\nprecipitation patterns over Morocco are presented in the final section of the analysis.\n4.1\nInvestigating the targeted dimensionality reduced space\nThe dimensionality-reduced spaces of different methods are investigated by projecting the 10-dimensional, already\ndimensionality-reduced space onto two dimensions using t-distributed stochastic nearest neighbour embedding (t-SNE)\n[Maaten and Hinton, 2008], a method commonly applied in the machine learning community for the visualisation of\nhigh-dimension datasets. In the case of PCA, for example, the first 10 principal components that span the latent space\nare projected onto two dimensions, visualised below. For the VAE methods, the 10-dimensional probabilistic latent\nspace pθ(z | x) is projected onto two dimensions. The resulting visualisation, shown in Figure 6, provides an intuition\n8\nRMM-VAE\nSPULER ET AL. 2024\nFigure 6: Visualisation of the 10-dimensional latent spaces in two dimensions using t-distributed stochastic nearest-\nneighbour embedding (t-SNE). Different values of perplexity were tested and perplexity=10 was chosen as it shows\nrepresentative results. Embedded data points are coloured according to the value of the target variable, total mean\nprecipitation (top row), and according to the cluster they are subsequently assigned to (bottom row)\nfor how the target variable is distributed in the dimensionality-reduced space, and how different clustering methods\ncapture this distribution.\nBoth targeted VAE methods, R-VAE and RMM-VAE, disentangle the dimension of the high-dimensional z500 input\ndataset associated with the scalar target variable t (dark dots in Figure 6, top row), which is in line with the findings\npresented by Zhao et al. [2019a] for the R-VAE method. The PCA latent space, on the other hand, shows little\norganisation with respect to the target variable, as expected, since the target variable is not part of the dimensionality\nreduction. In contrast, the CCA latent space appears to have more structure compared to PCA.\nHowever, the R-VAE + k-means and RMM-VAE methods structure the clusters differently in their respective latent\nspace (Figure 6, bottom row): the R-VAE + k-means method, which carries out dimensionality reduction and clustering\nin two separate steps, orders clusters in bands along a dimension associated with the target variable. In contrast, the\nRMM-VAE method, which fits probabilistic clusters while simultaneously disentangling the dimension associated\nwith the target variable, organises the clusters in a way that appears more consistent with the target of minimizing the\ndistance between points in one cluster, which is also the case for PCA + k-means and CCA + k-means. A possible\nexplanation for this is that the R-VAE method stretches the distance between points along the dimension associated with\nthe target variable in the reduced dimensionality space, so that the distance-based k-means algorithm identifies clusters\nthat appear as bands along the target dimension. This effect is not observed in the other methods as neither PCA nor\nCCA target their latent space in this specific way, while the RMM-VAE method fits the clusters while simultaneously\ntargeting the latent space, and therefore may not stretch the distance between points along the target dimension in the\nsame way. While the bands identified by the R-VAE + k-means method possibly aid the predictive skill of the clusters,\nthey also impact cluster persistence and robustness, which will be explored further below.\n4.2\nComparing reconstruction loss across methods\nThe performance of the dimensionality reduction component of the method is assessed by computing the mean squared\nerror (MSE) between input data and data reconstructed from the latent space. In the case of PCA, for example, the input\ndata point is compared to that same data point reconstructed using the first 10 principal components. In the case of the\nVAE methods, the input data point is compared to that same data point after passing it through the encoder and decoder\nof the model. The lower this value, the more information about the input space is captured by the dimensionality\nreduction method (PCA, CCA, R-VAE or RMM-VAE respectively). Figure 7 shows the distribution of this error across\nall data points.\n9\nRMM-VAE\nSPULER ET AL. 2024\nFigure 7: Distribution of mean squared error (MSE) between original input data and data reconstructed from the\ndimensionality-reduced space over all data points, for the different methods\nFigure 8: Gridded and normalized z500 anomalies, as detailed in Section 3, on an example day 1940-01-04, showing\nthe original data on the left and the reconstructions using different methods on the right\nBoth VAE v1 methods (with β=1) have a lower and less widely distributed RMSE compared to both PCA and CCA.\nThis means that despite targeting their respective latent spaces to an impact variable, the VAE v1 methods still capture\nmore information about the input space than the two linear methods.\nWhen increasing the importance of the prediction objectives in the VAE v2 models (with β<1), both R-VAE v2 and\nRMM-VAE v2 still outperform PCA and CCA but perform worse than their respective v1 counterparts. RMM-VAE v2\n(β=0.5) performs slightly better than R-VAE v2 (β=0.1) which is consistent with the different values for β chosen to\nensure convergence of the model.\nInvestigating the reconstruction of an individual data point, shown in Figure 8, we find that both v2 methods and CCA\nfocus the dimensionality reduction on the Western Mediterranean region surrounding Morocco. This result shows that a\ntrade-off between targeting the dimensionality reduction and reconstructing the full phase space exists, although the\ntwo VAE v1 methods that are based on targeted dimensionality reduction nevertheless perform best in reconstructing\nthe input space.\n10\nRMM-VAE\nSPULER ET AL. 2024\nFigure 9: Ranked Probability Skill Score for forecast of mean precipitation over Morocco given weather regimes for\ndifferent numbers of weather regimes k. a) Skill score for the forecast of the tercile of the precipitation distribution, and\nb) Skill score for a binary forecast above or below the 95th percentile. For probabilistic clustering, the skill score is\ncomputed using the most likely cluster at the given data point\n4.3\nEvaluating the predictive skill of weather regimes\nTo evaluate the informativeness of the weather regimes with respect to the target variable, and, in particular, their utility\nfor extended-range forecasting, we analyse the Ranked Probability Score (RPS) which is defined as\nRPS = 1\nN\nN\nX\nn=1\nm\nX\nj=1\n(δinj − pj)2 = − 1\nN\nN\nX\nn=1\n(1 − 2pin +\nm\nX\nj=1\np2\nj),\n(6)\nwhere m is the number of forecast categories and N the number of timesteps. δinj is the Kronecker delta which equals\n1 if the observation i at timestep n corresponds to category j, and 0 otherwise. The RPS is a strictly proper scoring rule\nto measure the accuracy of a probabilistic prediction of mutually exclusive discrete outcomes [Gneiting and Raftery,\n2007] and is widely used in forecast evaluation. The corresponding skill score (RPSS) is calculated with respect to a\nreference forecast, chosen here to be the climatology over the entire period, defined as\nRPSS = 1 −\nRPSforecast\nRPSclimatology\n.\n(7)\nA RPSS of 1 indicates a perfect forecast while low values indicate little, or no skill compared to the reference\nforecast. Here, a forecast of the target variable is constructed given the occurrence of a weather regime and the\nconditional probability of the target variable given that weather regime: each discrete target is forecast with a probability\ncorresponding to the probability of the weather regime at this given day, multiplied by the climatological conditional\nprobability of the target given the weather regime.\nUsing the RPSS, the predictive skill of the different weather regimes is evaluated in terms of predicting precipitation\nterciles (Figure 9a), as well as extreme precipitation, defined here as the 95th percentile of total precipitation over the\narea (Figure 9b). The predictive skill is overall higher for terciles compared to the 95th percentile threshold, which is to\nbe expected. Across both prediction targets, all targeted methods outperform PCA + k-means (blue line), highlighting\nthe potential of improving the predictive skill of standard weather regime definitions. R-VAE + k-means (green and red\nlines) performs best, followed by RMM-VAE (purple and brown lines) up to k=8. The better performance of R-VAE\ncan be attributed to RMM-VAE having more objectives to achieve simultaneously compared to R-VAE, as it aims\nto identify optimal clusters while disentangling the latent space with respect to the target variable at the same time.\nFor both VAE methods, increasing the importance of the prediction objective in the loss function (v2) further boosts\nthe predictive skill. This demonstrates the trade-off between the prediction and dimensionality reduction objectives\nbut again shows that the VAE v1 methods are effective in improving the predictive skill of clusters while capturing\ninformation about the input space more effectively than the baseline linear methods.\nIncreasing the number of clusters does not improve the skill except for CCA + k-means. For the two VAE methods,\nthis result is likely because the targeted dimensionality reduction already groups data points with similar precipitation\namounts in the reduced space. Unlike the other methods, CCA takes the full precipitation field as input. The ability to\n11\nRMM-VAE\nSPULER ET AL. 2024\nFigure 10: Cluster persistence and separability. a) Cluster persistence in days for k = 5 clusters. Violin plots show the\nkernel density estimation of the distribution, the distribution median (white point) as well as the interquartile range\n(black box). The ranking of different methods in terms of persistence remains the same for different choices of k. b)\nSilhouette score which is a measure of cluster separation for a range of cluster numbers k [Rousseeuw, 1987]. The\nsilhouette score is defined as the mean silhouette coefficient (b-a)/max(a,b), where a is the average intra-cluster distance\nand b is the average inter-cluster distance i.e. the average distance between all clusters\nextract spatial information about the precipitation field might enable the predictive skill to increase with cluster number,\nas will be discussed further below.\n4.4\nCluster persistence and separability\nPersistence, separability, and statistical robustness are required for the weather regimes to be meaningful and to provide\nextended-range predictive skill. Figure 10a shows the distribution of mean persistence for each of the k=5 clusters and\nFigure 10b the silhouette score which is a measure of cluster separability for a range of cluster numbers [Rousseeuw,\n1987]. The higher the silhouette score, the better the clusters are separated from one another, while a silhouette score\nclose to zero indicates that the separation between different clusters is not statistically significant. Furthermore, the\nsensitivity of cluster centres to subsampling is investigated with results shown in Appendix ??.\nMean persistence across clusters is highest for PCA, followed by RMM-VAE. However, the spread of the distribution is\nlower for PCA and CCA compared to the two VAE methods, in particular RMM-VAE. This result indicates that while\nall five PCA + k-means clusters have around the same average persistence, there are some clusters with a longer and\nsome with a shorter average persistence identified by the VAE methods. These results are qualitatively similar for other\nchoices of k (not shown). Sample time series of the cluster assignments in different methods are shown in appendix ??.\nAll targeted clusters perform worse in terms of cluster separability (Fig. 10b) compared to the baseline method PCA.\nRMM-VAE outperforms the other targeted methods while R-VAE performs the worst overall. This supports the initial\nexploration presented in Section 4.1, where the RMM-VAE clusters were found to be more coherently organized in the\nlatent space compared to the R-VAE clusters. Overall, these results indicate that RMM-VAE identifies more coherent\nand robust clusters compared to the other targeted methods. This highlights the benefit of performing the probabilistic\nclustering in one coherent statistical model, predicting the target variable and dimensionality reducing the input space\nin a single step, as opposed to separating the two steps, as in the R-VAE + k-means method.\n4.5\nCluster characteristics\nIn the final step of the analysis, the cluster centres identified by different methods are investigated, along with the\nassociated change in the conditional probability of extreme precipitation, shown in Figure 11. This provides insight\ninto the processes that the targeted weather regimes capture to enhance their predictive skill, as well as the differences\nbetween the targeted clustering methods investigated.\nThe cluster centres identified by PCA + k-means correspond to the weather regimes identified over the Mediterranean\nregion in other publications using this method such as Giuntoli et al. [2022] and Mastrantonas et al. [2022]. While the\nnumber of regimes investigated varies, both publications identify the meridional patterns observed in regimes 3 and\n12\nRMM-VAE\nSPULER ET AL. 2024\nFigure 11: Cluster centres of z500 geopotential height calculated using different methods with the cluster number\nspecified as k = 5 and z500 standardized as described in the section 3.1. For the probabilistic cluster method RMM-\nVAE, the means of the fitted mixture components are shown. For each method, the corresponding odds ratio of extreme\nprecipitation is shown below the cluster centre: for each grid cell, this corresponds to the ratio of the conditional\nprobability of the climatological 95th percentile of precipitation at the grid cell conditional on that weather regime,\ndivided by the unconditional probability of 95th percentile of precipitation (i.e. 0.05). The cluster centres are ordered in\ndecreasing order of mean precipitation during the days assigned to this cluster by the method\n13\nRMM-VAE\nSPULER ET AL. 2024\nFigure 12: Precipitation clusters computed on precipitation reanalysis data without pre-processing using the k-means\nclustering algorithm (top rows) and mean z500 anomalies during precipitation clusters (bottom rows)\n4, a high geopotential height anomaly (regime 5 - termed Mediterranean high in Mastrantonas et al. [2022]), and the\nwestern low anomalies seen in regimes 1 and 2, (termed Iberian and Biscay Low in Mastrantonas et al. [2022]). Regime\n1, associated with a geopotential height low over the west of Europe increases the probability of extreme precipitation\nby a factor of 3-4, which is consistent with the results found by Mastrantonas et al. [2020], while the other regimes\nshow no or marginal increases in the probability of extreme precipitation. Overall, the regimes identified by PCA +\nk-means have roughly similar frequencies of occurrence.\nCCA + k-means identifies multiple regimes associated with an increase in the conditional probability of extreme\nprecipitation by a factor of three or more in different regions of Morocco (regimes 1-3). The spatial pattern of extreme\nprecipitation appears to be modulated by the location of the geopotential height low around Morocco. In contrast,\nhigh geopotential height anomalies dominate over the western Mediterranean in the two regimes associated with a\nlower-than-average probability of extreme precipitation. The regimes associated with extreme precipitation (1-3) have a\nslightly lower frequency of occurrence than the other two (4-5). Recalling that CCA performed worst of all methods\nin reconstructing the input space, particularly over the Eastern Mediterranean, consequently, the main anomalies that\ndefine the CCA + k-means cluster centres are located in the Western Mediterranean region.\nIn contrast to the different spatial patterns of extreme precipitation associated with three weather regimes identified\nusing CCA + k-means, the R-VAE + k-means method identifies a single regime associated with a 5-6 times increase\nin the probability of extreme precipitation. Furthermore, we find that the cluster centre of regime 2, which occurs on\nalmost 30% of days, shows very little mean z500 anomaly, meaning it is quite close to a climatologically average day in\nextended winter. This supports the results presented in the previous sections that show that while R-VAE + k-means\nsucceeds at targeting the dimensionality reduction (see regime 1), it falls short in terms of identifying structure in the\natmospheric phase space compared to the other methods.\nThe RMM-VAE method, in terms of cluster centres, appears to strike a balance between the baseline method PCA +\nk-means, and the purely targeted method R-VAE + k-means. On the one hand, the method identifies a single regime\nassociated with an increased probability of extreme precipitation, similar to R-VAE + k-means, reflecting the common\norganisation of the dimensionality-reduced input space (see figure 6). On the other hand, the resulting cluster centres\nare visually more similar to the PCA + k-means cluster centres, reflecting the fact that the RMM-VAE method targets\nthe dimensionality-reduced space subject to concurrent clustering, hence balancing the two objectives.\nTo further investigate the geopotential height anomalies associated with different patterns of extreme precipitation,\nprecipitation is clustered directly using k-means clustering and the associated mean anomalies in geopotential height are\ncalculated, shown in figure 12. As discussed in section 1, clustering the impact variable directly compromises regime\npersistence and leads to an incomplete representation of the large-scale dynamics, and is therefore shown for illustration\npurposes only.\n14\nRMM-VAE\nSPULER ET AL. 2024\nIn agreement with the odds ratios associated with cluster centres shown in Figure 11, the location and intensity of the\nprecipitation events appear to be modulated by the location and intensity of a geopotential height low off the coast of\nSpain. This finding is consistent with the literature on extreme precipitation events in the Western Mediterranean which\nhighlights dynamically driven moisture flux from the Atlantic as a key driver [Dayan et al., 2015]. Toreti et al. [2010]\nshow that geopotential height anomalies associated with extreme precipitation over the Western Mediterranean, similar\nto those found in Figure 12, are associated with an alignment of the subtropical jet with the African coastline and\nanomalous southwesterly surface to mid-tropospheric flow which leads to large-scale ascending motions and instability\nover the Western Mediterranean region.\nThe two VAE methods cluster the different patterns of z500 anomalies identified in Figure 12 in one single weather\nregime, while CCA + k-means disaggregates some of the different spatial patterns of extreme precipitation into different\nweather regimes. This finding is consistent with the way the different methods incorporate the target variable: while\nCCA makes use of the entire precipitation field as input data and can hence extract more information about its spatial\nstructure, the VAE methods only receive a single scalar target variable, total precipitation, as input.\n5\nDiscussion and Conclusion\nIn this paper, we present a new machine learning method, RMM-VAE (Regression Mixture Model Variational Au-\ntoEncoder), for identifying weather regimes with respect to a scalar target variable. The novelty of the method lies\nin integrating the different objectives of targeted regimes, robust clustering and prediction of a target variable, in a\ncoherent statistical model by combining non-linear and targeted dimensionality reduction with probabilistic clustering\nusing mixture models based on a variational autoencoder architecture.\nThe RMM-VAE method is applied to identify weather regimes in 500 hPa geopotential height (z500) anomalies over\nthe Mediterranean region targeted to precipitation over Morocco. Results are compared to three alternative approaches:\nprincipal component analysis (PCA) combined with k-means clustering as the currently established standard practice\nfor identifying weather regimes [Bloomfield et al., 2020, Giuntoli et al., 2022], canonical correlation analysis (CCA)\ncombined with k-means as an established statistical method to relate two high-dimensional input spaces (implemented,\nfor example, by Vrac and Yiou [2010]), and R-VAE (regression variational autoencoder) combined with k-means\nclustering which extends a machine learning architecture presented by Zhao et al. [2019a]. We evaluated the performance\nof all four methods with respect to the predictive skill of the weather regimes, the ability of the dimensionality reduction\nto capture information about the high-dimensional input space, and the robustness and persistence of the identified\nclusters.\nOverall, the new RMM-VAE method performs well across all different objectives. It outperforms both linear methods\n(PCA + k-means and CCA + k-means) in terms of reconstructing the input space (Figure 7) and predicting the target\nvariable up to a certain cluster number (Figure 9). While a more efficient reconstruction of the input space is expected\nfrom a generic VAE architecture due to the higher degrees of freedom when fitting the encoding function [Murphy,\n2023], this result is non-obvious and relevant here, given that the presented RMM-VAE method additionally has the\ntwo other objectives of disentangling a scalar target variable and fitting probabilistic clusters. Compared to the other\nmachine learning method (R-VAE + k-means), the RMM-VAE method loses in predictive skill. However, it identifies\nmore persistent and separable clusters (Figure 10) compared to both targeted clustering methods, CCA + k-means and\nR-VAE + k-means. This is particularly relevant for climate applications such as extended-range forecasting where\nthere is an explicit interest in the persistence and transition probabilities between clusters. The cluster centres shown\nin Figure 11 visually demonstrate the balancing act performed by the RMM-VAE method, and the identified weather\nregimes associated with extreme precipitation are in line with existing literature on the dynamical conditions driving\nextreme precipitation in the Western Mediterranean [Dayan et al., 2015].\nOur analysis highlights multiple trade-offs when identifying targeted weather regimes. All targeted methods lose in\nterms of persistence and separability against the non-targeted baseline method PCA + k-means, although the RMM-VAE\nmethod still performs better than the other methods. Furthermore, a trade-off between reconstruction loss and predictive\nskill of the clusters is identified for the VAE architectures and made explicit by introducing a hyperparameter β into\nthe VAE models that allows to change the weight of the reconstruction term in the VAE loss functions. Improving the\npredictive skill of the target variable in the v2 versions (β < 1) comes at the cost of reconstructing the full phase space\nin this model.\nMaking these trade-offs explicit highlights that the most appropriate method to navigate the different objectives of\ntargeted clustering will depend on the use case at hand. For example, if there is research interest in the weather regimes\nthemselves and their teleconnections with low-frequency climate patterns, robust and persistent clusters might be\npreferable. However, if the research interest is primarily in a statistical model that relates large-scale dynamics to\nlocal-scale impact, identifying persistent clusters of atmospheric dynamics might not be important.\n15\nRMM-VAE\nSPULER ET AL. 2024\nOur novel RMM-VAE method explicitly incorporates these different objectives in a coherent probabilistic model rather\nthan implicitly addressing them through the choice of cluster number [Gadouali et al., 2020] or pre-filtering [Rouges\net al., 2023]. While the RMM-VAE method comes at the cost of rendering the approach more complicated and moving\naway from the explicit calculation performed in both PCA and CCA methods, it improves the performance of the\ntargeted clustering along multiple objectives, allows incorporation of co-variates and priors in an explicit probabilistic\nmodel, and makes the inherent trade-offs when identifying targeted weather regimes explicit.\nHowever, although both VAE methods, R-VAE + k-means and RMM-VAE, improve the predictive skill of clusters\nwith regard to the target variable compared to both CCA and PCA for lower cluster numbers (k < 9), CCA shows\na better performance for higher cluster numbers albeit at the cost of a worse reconstruction and cluster persistence\nand separability. This is due to CCA using the entire high-dimensional space of the target variable to identify targeted\nsubspaces and hence being able to distinguish different spatial patterns of extreme precipitation in different weather\nregimes, as can be seen in Figure 11. In contrast, RMM-VAE only considers a scalar target variable, which represents a\nlimitation of our current architecture. In future work, the current modelling framework could be expanded to develop a\njoint clustering of two high-dimensional variables, building on prior work conducted by Chalupka et al. [2016] and\nVrac and Yiou [2010].\nWhile the impact variable explored here is 3-day precipitation over Morocco, in principle any impact variable, such\nas renewable energy supply and number of people impacted by an extreme event, that has a justifiable link to the\nlarge-scale meteorological variables, could be used. Future work could apply the method to other regions and target\nvariables, in particular, more realistic and decision-relevant impact variables to explore its robustness and usefulness in\npractice. Furthermore, other limitations of existing methods such as their physical meaningfulness are not explicitly\naddressed in our method. However, additional meteorological variables such as moisture fluxes or the location of storm\ntracks conditional on the identified regimes can be analysed to investigate the physical basis underlying the identified\ntargeted regimes. Finally, a number of a priori choices that are common to all clustering methods such as the region,\npre-processing steps, the method of computing the anomalies and the low-frequency filter applied to the geopotential\nheight data remain. Sensitivities to these choices are explored in Appendix ?? and should, where possible, be explicitly\nincluded in the method rather than seen as opaque a priori choices.\nThe machine learning method presented in this paper contributes to an existing pool of methods to statistically relate\nlarge-scale atmospheric dynamics to regional extremes in local-scale impact variables, which has a number of relevant\napplications such as dynamical adjustment and extreme event attribution, downscaling and forecast post-processing. In\naddition to introducing a new method, this paper also highlights the commonalities, benefits and drawbacks of novel\nmachine learning methods compared to more established statistical methods, hopefully contributing to the further\ndevelopment of suitable machine learning methods to this application field.\nAcknowledgments\nThe authors thank Jakob Wessel for useful discussions and feedback. ERA5 reanalysis data\n[Hersbach et al., 2020] was downloaded from the Copernicus Climate Change Service (C3S) (2023). The results contain\nmodified Copernicus Climate Change Service information 2020. Neither the European Commission nor ECMWF is\nresponsible for any use that may be made of the Copernicus information or data it contains.\nFunding Statement\nTGS and MK were funded by the European Commission Horizon 2020 project XAIDA (Extreme\nEvents: Artificial Intelligence for Detection and Attribution), Grant Agreement No. 101003469. FRS is funded by the\nAdvancing the Frontiers of Earth System Prediction (AFESP) Doctoral Training Programme.\nCompeting Interests\nThe authors declare no competing interests exist.\nData Availability Statement\nThe data used in this study is available on Zenodo https://zenodo.org/records/\n10101006. The scripts necessary to reproduce the results in this study can be found on GitHub: https://github.\ncom/fiona511/RMM-VAE.\nEthical Standards\nThe research meets all ethical guidelines, including adherence to the legal requirements of the\nstudy country.\nReferences\nMaria Carmen Lemos, Christine J. Kirchhoff, and Vijay Ramprasad. Narrowing the climate information usability\ngap. Nature Climate Change, 2(11):789–794, November 2012. ISSN 1758-6798. doi:10.1038/nclimate1614. URL\nhttps://www.nature.com/articles/nclimate1614. Number: 11 Publisher: Nature Publishing Group.\n16\nRMM-VAE\nSPULER ET AL. 2024\nErin Coughlan de Perez, Laura Harrison, Kristoffer Berse, Evan Easton-Calabria, Joalane Marunye, Makoala Marake,\nSonia Binte Murshed, Shampa, and Erlich-Honest Zauisomue. Adapting to climate change through anticipatory\naction: The potential use of weather-based early warnings. Weather and Climate Extremes, 38:100508, December\n2022. ISSN 2212-0947. doi:10.1016/j.wace.2022.100508. URL https://www.sciencedirect.com/science/\narticle/pii/S2212094722000871.\nMichael Ghil and Andrew W. Robertson. “Waves” vs. “particles” in the atmosphere’s phase space: A pathway to\nlong-range forecasting? Proceedings of the National Academy of Sciences, 99(suppl_1):2493–2500, February 2002.\nISSN 0027-8424, 1091-6490. doi:10.1073/pnas.012580899. URL https://pnas.org/doi/full/10.1073/\npnas.012580899.\nAbdel. Hannachi, David M. Straus, Christian L. E. Franzke, Susanna Corti, and Tim Woollings. Low-frequency\nnonlinearity and regime behavior in the Northern Hemisphere extratropical atmosphere. Reviews of Geophysics, 55\n(1):199–234, 2017. ISSN 1944-9208. doi:10.1002/2015RG000509. URL https://onlinelibrary.wiley.com/\ndoi/abs/10.1002/2015RG000509. _eprint: https://onlinelibrary.wiley.com/doi/pdf/10.1002/2015RG000509.\nChristophe Cassou. Intraseasonal interaction between the Madden–Julian Oscillation and the North Atlantic Oscillation.\nNature, 455(7212):523–527, September 2008. ISSN 1476-4687. doi:10.1038/nature07286. URL https://www.\nnature.com/articles/nature07286. Number: 7212 Publisher: Nature Publishing Group.\nPaula L. M. Gonzalez, Emma Howard, Samantha Ferrett, Thomas H. A. Frame, Oscar Martínez-Alvarado, John\nMethven, and Steven J. Woolnough.\nWeather patterns in Southeast Asia: Enhancing high-impact weather\nsubseasonal forecast skill.\nQuarterly Journal of the Royal Meteorological Society, 2022.\nISSN 1477-\n870X. doi:10.1002/qj.4378. URL https://onlinelibrary.wiley.com/doi/abs/10.1002/qj.4378. _eprint:\nhttps://onlinelibrary.wiley.com/doi/pdf/10.1002/qj.4378.\nJ. Cattiaux, R. Vautard, C. Cassou, P. Yiou, V. Masson-Delmotte, and F. Codron.\nWinter 2010 in Europe:\nA cold extreme in a warming climate.\nGeophysical Research Letters, 37(20), 2010.\nISSN 1944-8007.\ndoi:10.1029/2010GL044613. URL https://onlinelibrary.wiley.com/doi/abs/10.1029/2010GL044613.\n_eprint: https://onlinelibrary.wiley.com/doi/pdf/10.1029/2010GL044613.\nDaniel E. Horton, Nathaniel C. Johnson, Deepti Singh, Daniel L. Swain, Bala Rajaratnam, and Noah S. Diffenbaugh.\nContribution of changes in atmospheric circulation patterns to extreme temperature trends. Nature, 522(7557):\n465–469, June 2015. ISSN 1476-4687. doi:10.1038/nature14550. URL https://www.nature.com/articles/\nnature14550. Number: 7557 Publisher: Nature Publishing Group.\nLaurent Terray. A dynamical adjustment perspective on extreme event attribution. Weather and Climate Dynamics, 2\n(4):971–989, October 2021. doi:10.5194/wcd-2-971-2021. URL https://wcd.copernicus.org/articles/2/\n971/2021/. Publisher: Copernicus GmbH.\nPierre Ailliot, Craig Thompson, and Peter Thomson. Space–Time Modelling of Precipitation by Using a Hidden\nMarkov Model and Censored Gaussian Distributions. Journal of the Royal Statistical Society Series C: Applied\nStatistics, 58(3):405–426, July 2009. ISSN 0035-9254. doi:10.1111/j.1467-9876.2008.00654.x. URL https:\n//doi.org/10.1111/j.1467-9876.2008.00654.x.\nD. Maraun, F. Wetterhall, A. M. Ireson, R. E. Chandler, E. J. Kendon, M. Widmann, S. Brienen, H. W. Rust,\nT. Sauter, M. Themeßl, V. K. C. Venema, K. P. Chun, C. M. Goodess, R. G. Jones, C. Onof, M. Vrac, and\nI. Thiele-Eich. Precipitation downscaling under climate change: Recent developments to bridge the gap between\ndynamical models and the end user. Reviews of Geophysics, 48(3):RG3003, September 2010. ISSN 8755-1209.\ndoi:10.1029/2009RG000314. URL http://doi.wiley.com/10.1029/2009RG000314.\nSam Allen, Gavin R. Evans, Piers Buchanan, and Frank Kwasniok. Incorporating the North Atlantic Oscillation into the\npost-processing of MOGREPS-G wind speed forecasts. Quarterly Journal of the Royal Meteorological Society, 147\n(735):1403–1418, 2021. ISSN 1477-870X. doi:10.1002/qj.3983. URL https://onlinelibrary.wiley.com/\ndoi/abs/10.1002/qj.3983. _eprint: https://onlinelibrary.wiley.com/doi/pdf/10.1002/qj.3983.\nHannah C. Bloomfield, David J. Brayshaw, Paula L. M. Gonzalez, and Andrew Charlton-Perez. Pattern-based condi-\ntioning enhances sub-seasonal prediction skill of European national energy variables. Meteorological Applications,\n28(4), July 2021. ISSN 1350-4827, 1469-8080. doi:10.1002/met.2018. URL https://onlinelibrary.wiley.\ncom/doi/10.1002/met.2018.\nF. Gadouali, N. Semane, Á.g. Muñoz, and M. Messouli. On the Link Between the Madden-Julian Oscillation, Euro-\nMediterranean Weather Regimes, and Morocco Winter Rainfall. Journal of Geophysical Research: Atmospheres, 125\n(8):e2020JD032387, 2020. ISSN 2169-8996. doi:10.1029/2020JD032387. URL https://onlinelibrary.wiley.\ncom/doi/abs/10.1029/2020JD032387. _eprint: https://onlinelibrary.wiley.com/doi/pdf/10.1029/2020JD032387.\nR. W. Lee, S. J. Woolnough, A. J. Charlton-Perez, and F. Vitart. ENSO Modulation of MJO Teleconnections to\nthe North Atlantic and Europe. Geophysical Research Letters, 46(22):13535–13545, 2019. ISSN 1944-8007.\n17\nRMM-VAE\nSPULER ET AL. 2024\ndoi:10.1029/2019GL084683. URL https://onlinelibrary.wiley.com/doi/abs/10.1029/2019GL084683.\n_eprint: https://onlinelibrary.wiley.com/doi/pdf/10.1029/2019GL084683.\nAndrew J. Charlton-Perez, Laura Ferranti, and Robert W. Lee. The influence of the stratospheric state on North\nAtlantic weather regimes. Quarterly Journal of the Royal Meteorological Society, 144(713):1140–1151, 2018. ISSN\n1477-870X. doi:10.1002/qj.3280. URL https://onlinelibrary.wiley.com/doi/abs/10.1002/qj.3280.\n_eprint: https://onlinelibrary.wiley.com/doi/pdf/10.1002/qj.3280.\nPaul-Antoine Michelangeli, Robert Vautard, and Bernard Legras. Weather Regimes: Recurrence and Quasi Stationarity.\nJournal of the Atmospheric Sciences, 52(8):1237–1256, April 1995. ISSN 0022-4928, 1520-0469. doi:10.1175/1520-\n0469(1995)052<1237:WRRAQS>2.0.CO;2. URL https://journals.ametsoc.org/view/journals/atsc/\n52/8/1520-0469_1995_052_1237_wrraqs_2_0_co_2.xml. Publisher: American Meteorological Society Sec-\ntion: Journal of the Atmospheric Sciences.\nRobert Vautard. Multiple Weather Regimes over the North Atlantic: Analysis of Precursors and Successors. 118\n(10), 1990. URL https://journals.ametsoc.org/view/journals/mwre/118/10/1520-0493_1990_118_\n2056_mwrotn_2_0_co_2.xml.\nIgnazio Giuntoli, Federico Fabiano, and Susanna Corti. Seasonal predictability of Mediterranean weather regimes in the\nCopernicus C3S systems. Climate Dynamics, 58(7):2131–2147, April 2022. ISSN 1432-0894. doi:10.1007/s00382-\n021-05681-4. URL https://doi.org/10.1007/s00382-021-05681-4.\nNikolaos Mastrantonas, Pedro Herrera-Lormendez, Linus Magnusson, Florian Pappenberger, and Jörg Matschullat.\nExtreme precipitation events in the Mediterranean: Spatiotemporal characteristics and connection to large-scale\natmospheric flow patterns. International Journal of Climatology, 41(4):2710–2728, 2020. ISSN 1097-0088.\ndoi:10.1002/joc.6985.\nURL https://onlinelibrary.wiley.com/doi/abs/10.1002/joc.6985.\n_eprint:\nhttps://onlinelibrary.wiley.com/doi/pdf/10.1002/joc.6985.\nRobert Neal, Joanne Robbins, Rutger Dankers, Ashis Mitra, A. Jayakumar, E. N. Rajagopal, and George\nAdamson.\nDeriving optimal weather pattern definitions for the representation of precipitation vari-\nability over India.\nInternational Journal of Climatology, 40(1):342–360, 2020.\nISSN 1097-0088.\ndoi:10.1002/joc.6215.\nURL https://onlinelibrary.wiley.com/doi/abs/10.1002/joc.6215.\n_eprint:\nhttps://onlinelibrary.wiley.com/doi/pdf/10.1002/joc.6215.\nSimon H. Lee, Michael K. Tippett, and Lorenzo M. Polvani.\nA New Year-Round Weather Regime Classifica-\ntion for North America.\nJournal of Climate, 36(20):7091–7108, September 2023.\nISSN 0894-8755, 1520-\n0442. doi:10.1175/JCLI-D-23-0214.1. URL https://journals.ametsoc.org/view/journals/clim/36/\n20/JCLI-D-23-0214.1.xml. Publisher: American Meteorological Society Section: Journal of Climate.\nDavid M. Straus, Susanna Corti, and Franco Molteni. Circulation Regimes: Chaotic Variability versus SST-Forced Pre-\ndictability. Journal of Climate, 20(10):2251–2272, May 2007. ISSN 0894-8755, 1520-0442. doi:10.1175/JCLI4070.1.\nURL https://journals.ametsoc.org/view/journals/clim/20/10/jcli4070.1.xml. Publisher: Ameri-\ncan Meteorological Society Section: Journal of Climate.\nAndrew W. Robertson, Nicolas Vigaud, Jing Yuan, and Michael K. Tippett. Toward Identifying Subseasonal Forecasts\nof Opportunity Using North American Weather Regimes. Monthly Weather Review, 148(5):1861–1875, May 2020.\nISSN 1520-0493, 0027-0644. doi:10.1175/MWR-D-19-0285.1. URL https://journals.ametsoc.org/view/\njournals/mwre/148/5/mwr-d-19-0285.1.xml. Publisher: American Meteorological Society Section: Monthly\nWeather Review.\nKevin Murphy. Probabilistic Machine Learning: An Introduction. 2022.\nA. Hannachi, I. T. Jolliffe, and D. B. Stephenson. Empirical orthogonal functions and related techniques in atmo-\nspheric science: A review. International Journal of Climatology, 27(9):1119–1152, 2007. ISSN 1097-0088.\ndoi:10.1002/joc.1499.\nURL https://onlinelibrary.wiley.com/doi/abs/10.1002/joc.1499.\n_eprint:\nhttps://onlinelibrary.wiley.com/doi/pdf/10.1002/joc.1499.\nSteven B. Feldstein and Christian L. E. Franzke.\nAtmospheric Teleconnection Patterns.\nIn Christian L. E.\nFranzke and Terence J. O’Kane, editors, Nonlinear and Stochastic Climate Dynamics, pages 54–104. Cam-\nbridge University Press, Cambridge, 2017.\nISBN 978-1-107-11814-0.\ndoi:10.1017/9781316339251.004.\nURL\nhttps://www.cambridge.org/core/books/nonlinear-and-stochastic-climate-dynamics/\natmospheric-teleconnection-patterns/AC059929DFD3096397A825D9F6BA3B3A.\nIan T. Jolliffe and Jorge Cadima. Principal component analysis: a review and recent developments. Philosophical trans-\nactions. Series A, Mathematical, physical, and engineering sciences, 374(2065):20150202, April 2016. ISSN 1364-\n503X. doi:10.1098/rsta.2015.0202. URL https://www.ncbi.nlm.nih.gov/pmc/articles/PMC4792409/.\n18\nRMM-VAE\nSPULER ET AL. 2024\nSwinda K J Falkena, Jana de Wiljes, Antje Weisheimer, and Theodore G Shepherd.\nA Bayesian Approach to\nAtmospheric Circulation Regime Assignment.\nJournal of Climate, ISSN 1520-0442 (in Press), 2023.\nURL\nhttps://centaur.reading.ac.uk/110936/.\nDiederik P. Kingma and Max Welling. Auto-Encoding Variational Bayes, 2013. URL http://arxiv.org/abs/1312.\n6114. arXiv:1312.6114 [cs, stat].\nAlessandro Baldo and Robin Locatelli. A probabilistic view on modelling weather regimes. International Journal of\nClimatology, 1(21), 2022. ISSN 1097-0088. doi:10.1002/joc.7942. URL https://onlinelibrary.wiley.com/\ndoi/abs/10.1002/joc.7942. _eprint: https://onlinelibrary.wiley.com/doi/pdf/10.1002/joc.7942.\nJ.\nDorrington\nand\nK.\nJ.\nStrommen.\nJet\nSpeed\nVariability\nObscures\nEuro-Atlantic\nRegime\nStructure.\nGeophysical\nResearch\nLetters,\n47(15):e2020GL087907,\n2020.\nISSN\n1944-8007.\ndoi:10.1029/2020GL087907. URL https://onlinelibrary.wiley.com/doi/abs/10.1029/2020GL087907.\n_eprint: https://onlinelibrary.wiley.com/doi/pdf/10.1029/2020GL087907.\nSwinda K.J. Falkena, Jana de Wiljes, Antje Weisheimer, and Theodore G. Shepherd. Revisiting the identification of\nwintertime atmospheric circulation regimes in the Euro-Atlantic sector. Quarterly Journal of the Royal Meteorological\nSociety, 146(731):2801–2814, 2020. ISSN 1477-870X. doi:10.1002/qj.3818. URL https://onlinelibrary.\nwiley.com/doi/abs/10.1002/qj.3818. _eprint: https://onlinelibrary.wiley.com/doi/pdf/10.1002/qj.3818.\nD. B. Stephenson,\nA. Hannachi,\nand A. O’Neill.\nOn the existence of multiple climate regimes.\nQuarterly Journal of the Royal Meteorological Society, 130(597):583–605, 2004.\nISSN 1477-870X.\ndoi:10.1256/qj.02.146. URL https://onlinelibrary.wiley.com/doi/abs/10.1256/qj.02.146. _eprint:\nhttps://onlinelibrary.wiley.com/doi/pdf/10.1256/qj.02.146.\nEmmanuel Rouges, Laura Ferranti, Holger Kantz, and Florian Pappenberger. European heatwaves: Link to large-\nscale circulation patterns and intraseasonal drivers. International Journal of Climatology, 1(21), 2023. ISSN\n1097-0088. doi:10.1002/joc.8024. URL https://onlinelibrary.wiley.com/doi/abs/10.1002/joc.8024.\n_eprint: https://onlinelibrary.wiley.com/doi/pdf/10.1002/joc.8024.\nHannah C. Bloomfield, David J. Brayshaw, and Andrew J. Charlton-Perez. Characterizing the winter meteorological\ndrivers of the European electricity system using targeted circulation types. Meteorological Applications, 27(1):\ne1858, 2020. ISSN 1469-8080. doi:10.1002/met.1858. URL https://onlinelibrary.wiley.com/doi/abs/\n10.1002/met.1858. _eprint: https://onlinelibrary.wiley.com/doi/pdf/10.1002/met.1858.\nA. Ullmann, B. Fontaine, and P. Roucou. Euro-Atlantic weather regimes and Mediterranean rainfall patterns: present-day\nvariability and expected changes under CMIP5 projections. International Journal of Climatology, 34(8):2634–2650,\n2014. ISSN 1097-0088. doi:10.1002/joc.3864. URL https://onlinelibrary.wiley.com/doi/abs/10.1002/\njoc.3864. _eprint: https://onlinelibrary.wiley.com/doi/pdf/10.1002/joc.3864.\nMathieu Vrac and Pascal Yiou. Weather regimes designed for local precipitation modeling: Application to the\nMediterranean basin.\nJournal of Geophysical Research, 115(D12):D12103, June 2010.\nISSN 0148-0227.\ndoi:10.1029/2009JD012871. URL http://doi.wiley.com/10.1029/2009JD012871.\nQingyu Zhao, Nicolas Honnorat, Ehsan Adeli, and Kilian M. Pohl. Variational Autoencoder with Truncated Mixture\nof Gaussians for Functional Connectivity Analysis. Information processing in medical imaging : proceedings\nof the ... conference, 11492:867–879, June 2019a. ISSN 1011-2499. doi:10.1007/978-3-030-20351-1_68. URL\nhttps://www.ncbi.nlm.nih.gov/pmc/articles/PMC7375028/.\nNikolaos Mastrantonas, Linus Magnusson, Florian Pappenberger, and Jörg Matschullat.\nWhat do large-scale\npatterns teach us about extreme precipitation over the Mediterranean at medium- and extended-range fore-\ncasts?\nQuarterly Journal of the Royal Meteorological Society, 148(743):875–890, 2022.\nISSN 1477-\n870X. doi:10.1002/qj.4236. URL https://onlinelibrary.wiley.com/doi/abs/10.1002/qj.4236. _eprint:\nhttps://onlinelibrary.wiley.com/doi/pdf/10.1002/qj.4236.\nA. Hannachi, S. Unkel, N. T. Trendafilov, and I. T. Jolliffe. Independent Component Analysis of Climate Data:\nA New Look at EOF Rotation. Journal of Climate, 22(11):2797–2812, June 2009. ISSN 0894-8755, 1520-\n0442. doi:10.1175/2008JCLI2571.1. URL https://journals.ametsoc.org/view/journals/clim/22/11/\n2008jcli2571.1.xml. Publisher: American Meteorological Society Section: Journal of Climate.\nRichard A. Johnson and Dean W. Wichern. Applied Multivariate Statistical Analysis: Pearson New International\nEdition. Pearson Higher Ed, August 2013. ISBN 978-1-292-03757-8. Google-Books-ID: xCipBwAAQBAJ.\nChristina Heinze-Deml, Sebastian Sippel, Angeline G. Pendergrass, Flavio Lehner, and Nicolai Meinshausen. Latent\nLinear Adjustment Autoencoder v1.0: a novel method for estimating and emulating dynamic precipitation at high res-\nolution. Geoscientific Model Development, 14(8):4977–4999, August 2021. ISSN 1991-959X. doi:10.5194/gmd-14-\n4977-2021. URL https://gmd.copernicus.org/articles/14/4977/2021/. Publisher: Copernicus GmbH.\n19\nRMM-VAE\nSPULER ET AL. 2024\nKevin P. Murphy. Probabilistic Machine Learning: Advanced Topics. MIT Press, 2023.\nFei Ye and Adrian G. Bors. Mixtures of Variational Autoencoders. In 2020 Tenth International Conference on\nImage Processing Theory, Tools and Applications (IPTA), pages 1–6, Paris, France, November 2020. IEEE. ISBN\n978-1-72818-750-1. doi:10.1109/IPTA50016.2020.9286619. URL https://ieeexplore.ieee.org/document/\n9286619/.\nQingyu Zhao, Ehsan Adeli, Nicolas Honnorat, Tuo Leng, and Kilian M. Pohl. Variational AutoEncoder For Regression:\nApplication to Brain Aging Analysis. Medical image computing and computer-assisted intervention : MICCAI\n... International Conference on Medical Image Computing and Computer-Assisted Intervention, 11765:823–831,\nOctober 2019b. doi:10.1007/978-3-030-32245-8_91. URL https://www.ncbi.nlm.nih.gov/pmc/articles/\nPMC7377006/.\nZhuxi Jiang, Yin Zheng, Huachun Tan, Bangsheng Tang, and Hanning Zhou. Variational Deep Embedding: An\nUnsupervised and Generative Approach to Clustering, June 2017. URL http://arxiv.org/abs/1611.05148.\narXiv:1611.05148 [cs].\nDalila Loudyi, Moulay Driss Hasnaoui, and Ahmed Fekri. Flood Risk Management Practices in Morocco: Facts and\nChallenges. In Tetsuya Sumi, Sameh A. Kantoush, and Mohamed Saber, editors, Wadi Flash Floods: Challenges\nand Advanced Approaches for Disaster Risk Reduction, Natural Disaster Science and Mitigation Engineering: DPRI\nreports, pages 35–94. Springer, Singapore, 2022. ISBN 9789811629044. doi:10.1007/978-981-16-2904-4_2. URL\nhttps://doi.org/10.1007/978-981-16-2904-4_2.\nHans Hersbach, Bill Bell, Paul Berrisford, Shoji Hirahara, András Horányi, Joaquín Muñoz-Sabater, Julien Nicolas,\nCarole Peubey, Raluca Radu, Dinand Schepers, Adrian Simmons, Cornel Soci, Saleh Abdalla, Xavier Abellan,\nGianpaolo Balsamo, Peter Bechtold, Gionata Biavati, Jean Bidlot, Massimo Bonavita, Giovanna De Chiara, Per\nDahlgren, Dick Dee, Michail Diamantakis, Rossana Dragani, Johannes Flemming, Richard Forbes, Manuel Fuentes,\nAlan Geer, Leo Haimberger, Sean Healy, Robin J. Hogan, Elías Hólm, Marta Janisková, Sarah Keeley, Patrick\nLaloyaux, Philippe Lopez, Cristina Lupu, Gabor Radnoti, Patricia de Rosnay, Iryna Rozum, Freja Vamborg, Sebastien\nVillaume, and Jean-Noël Thépaut. The ERA5 global reanalysis. Quarterly Journal of the Royal Meteorological\nSociety, 146(730):1999–2049, 2020. ISSN 1477-870X. doi:10.1002/qj.3803. URL https://onlinelibrary.\nwiley.com/doi/abs/10.1002/qj.3803. _eprint: https://onlinelibrary.wiley.com/doi/pdf/10.1002/qj.3803.\nG. E. P. Box and D. R. Cox. An Analysis of Transformations. Journal of the Royal Statistical Society. Series B\n(Methodological), 26(2):211–252, 1964. ISSN 0035-9246. URL https://www.jstor.org/stable/2984418.\nPublisher: [Royal Statistical Society, Wiley].\nU. Dayan, K. Nissen, and U. Ulbrich. Review Article: Atmospheric conditions inducing extreme precipitation over the\neastern and western Mediterranean. Natural Hazards and Earth System Sciences, 15(11):2525–2544, November\n2015. ISSN 1561-8633. doi:10.5194/nhess-15-2525-2015. URL https://nhess.copernicus.org/articles/\n15/2525/2015/nhess-15-2525-2015.html. Publisher: Copernicus GmbH.\nFrancois Chollet, , et al. Keras. 2015. URL https://keras.io.\nF. Pedregosa, G. Varoquaux, V. Michel, B. Thirion, O. Grisel, M. Blondel, P. Prettenhofer, R. Weiss, V. Dubourg,\nJ. Vanderplas, A. Passos, D. Cournapeau, M. Brucher, M. Perrot, and E. Duchesnay. Scikit-learn: Machine Learning\nin Python. Journal of Machine Learning Research, 12:2825–2830, 2011.\nIrina Higgins, Loic Matthey, Arka Pal, Christopher Burgess, Xavier Glorot, Matthew Botvinick, Shakir Mohamed, and\nAlexander Lerchner. beta-VAE: Learning basic visual concepts with a constrained variational framework. 2017.\nLaurens van der Maaten and Geoffrey Hinton. Visualizing Data using t-SNE. Journal of Machine Learning Research, 9\n(86):2579–2605, 2008. ISSN 1533-7928. URL http://jmlr.org/papers/v9/vandermaaten08a.html.\nTilmann Gneiting and Adrian E Raftery.\nStrictly Proper Scoring Rules, Prediction, and Estimation.\nJour-\nnal of the American Statistical Association, 102(477):359–378, March 2007.\nISSN 0162-1459, 1537-\n274X.\ndoi:10.1198/016214506000001437.\nURL http://www.tandfonline.com/doi/abs/10.1198/\n016214506000001437.\nPeter J. Rousseeuw. Silhouettes: A graphical aid to the interpretation and validation of cluster analysis. Journal\nof Computational and Applied Mathematics, 20:53–65, November 1987. ISSN 0377-0427. doi:10.1016/0377-\n0427(87)90125-7. URL https://www.sciencedirect.com/science/article/pii/0377042787901257.\nA. Toreti, E. Xoplaki, D. Maraun, F. G. Kuglitsch, H. Wanner, and J. Luterbacher. Characterisation of extreme\nwinter precipitation in Mediterranean coastal sites and associated anomalous atmospheric circulation patterns.\nNatural Hazards and Earth System Sciences, 10(5):1037–1050, May 2010. ISSN 1561-8633. doi:10.5194/nhess-10-\n1037-2010. URL https://nhess.copernicus.org/articles/10/1037/2010/nhess-10-1037-2010.html.\nPublisher: Copernicus GmbH.\n20\nRMM-VAE\nSPULER ET AL. 2024\nKrzysztof Chalupka, Pietro Perona, and Frederick Eberhardt. Multi-Level Cause-Effect Systems. In 19th International\nConference on Artificial Intelligence and Statistics, volume 41. JMLR: W&CP, 2016.\n21\n"
}