{
    "optim": "Optimal shielding for Einstein gravity\nBruno Le Floch1 and Philippe G. LeFloch2\n1 Laboratoire de Physique Th´eorique et Hautes ´Energies, Centre National de la\nRecherche Scientifique & Sorbonne Universit´e, 4 Place Jussieu, 75252 Paris, France.\n2 Laboratoire Jacques-Louis Lions, Centre National de la Recherche Scientifique &\nSorbonne Universit´e, 4 Place Jussieu, 75252 Paris, France.\nE-mail: bruno@le-floch.fr, contact@philippelefloch.org\nFebruary 2024\nAbstract.\nIn order to construct asymptotically Euclidean, Einstein’s initial data\nsets, we introduce the localized seed-to-solution method and establish the existence of\nclasses of data sets that exhibit the gravity shielding phenomenon (or localization).\nWe achieve optimal shielding in the sense that the gluing domain can be a collection\nof arbitrarily narrow nested cones while the metric and extrinsic curvature may be\ncontrolled at a super-harmonic rate, and may have arbitrarily slow decay (possibly\nbeyond the standard ADM formalism). We also uncover several notions of physical\nand mathematical interest: normalized asymptotic kernel elements, localized energy\nfunctionals, localized ADM modulators, and relative energy-momentum vectors.\n1. Shielding phenomena in Einstein gravity\nShielding.\nWe consider n-dimensional initial data sets for Einstein’s vacuum field\nequations of general relativity, namely spacelike hypersurfaces embedded in a vacuum\nspacetime, modeled by a Ricci flat, (n + 1)-dimensional Lorentzian manifold. Einstein’s\nconstraints form a set of n + 1 differential equations for the induced intrinsic geometry\nand extrinsic geometry.\nAn extensive literature in physics and in mathematics is\navailable on the construction of physically meaningful classes of solutions. In particular,\none important strategy referred to as the variational method was introduced by\nCorvino [10] and Corvino and Schoen [12] —who built on Fischer and Marsden’s work\nof the deformations of the scalar curvature operator.\nMotivated by the study of isolated gravitational systems, we are interested here in\nasymptotically Euclidean, initial data sets and in the so-called anti-gravity or shielding\nphenomenon.\nRecall that, by the positive mass theorem, any vacuum space that\ncoincides with the Euclidean space in the vicinity of an asymptotically Euclidean end is,\nin fact, globally isometric to the Euclidean space. In [6], Carlotto and Schoen made a\nremarkable discovery by distinguishing between different angular directions at infinity.\nNamely, there exist non-trivial solutions to the constraints that, in a neighborhood of\ninfinity, coincide with the Euclidean geometry in all angular directions except within a\narXiv:2402.17598v1  [gr-qc]  27 Feb 2024\nB. Le Floch and P.G. LeFloch\nOptimal shielding for Einstein gravity\n(a)\n(b)\n(c)\nFigure 1. Euclidean metric (orange) glued to the Schwarzschild metric (purple) across\na region that is conical at infinity. (a) Exact sub-harmonic localization. (b) Asymptotic\nsuper-harmonic localization. (c) Exact super-harmonic localization.\nconical domain with possibly arbitrarily small angle. Alternatively, the Euclidean and\nthe Schwarzschild solutions can be picked up at infinity and be glued together across a\nconical domain. Chru´sciel and Delay [8, 9, 14] presented a method that applied to more\ngeneral gluing domains and manifolds with hyperbolic ends. (Cf. the reviews [5, 7, 15]\nand Section 6, below.) In this Letter, we follow this line of investigation. Other recent\nimportant advances on the gluing problem include [1, 2, 11, 13, 23] and further references\nare cited throughout this text.\nAsymptotic shielding.\nThe gluing scheme proposed by Carlotto and Schoen [6] allowed\nthem to establish sub-harmonic estimates within the localization region, namely\nestimates in r−n+2+η with respect to a radial coordinate r at infinity for arbitrarily\nsmall exponent η > 0. Their result is illustrated in Figure 1(a). Carlotto and Schoen\nconjectured that the localization with harmonic estimates should be achievable, that is,\nwith η = 0. Next, P. LeFloch and Nguyen [21, 22] proposed a different approach to the\ngluing problem and formulated what they called the asymptotic localization problem, as\nopposed to the exact version in [6]. The notion of seed-to-solution map (cf. Section 2,\nbelow) was also introduced and sharp estimates at the (super-)harmonic level of decay\nwere established, so that the gluing at (super-)harmonic rate was achieved in the sense\nthat solutions enjoy the behavior required by the seed data in all angular directions at\nharmonic level at least, up to contributions with much faster radial decay. This result\nis illustrated in Figure 1(b).\nOptimal shielding.\nIn contrast with [6, 22], in [20], reported in this Letter, we are now\nable to achieve (super-)harmonic control together with the exact localization sought by\nCarlotto and Schoen in their conjecture —as well as other “optimal” features discussed\nnext. The optimal localization theory, as we call it, is based on the notion of localized\nseed-to-solution projection, a notion we outline in Section 2, below. Our method allows\nfor the construction of broad classes of solutions which are of physical interest, and\nprovide an approximation scheme readily applicable for computational simulations. It\nis based on a combination of physical insights, geometric analysis techniques, including\nthe study of the (linear and nonlinear) structure of the Einstein constraint equations.\n2\nB. Le Floch and P.G. LeFloch\nOptimal shielding for Einstein gravity\nMore precisely, we construct classes of solutions that\n(i) are defined by gluing within conical domains, possibly nested with narrow angles,\n(ii) may have arbitrarily slow decay, possibly with infinite ADM energy, and\n(iii) enjoy (super-)harmonic decay estimates.\nFor a schematic illustration of the decay we refer to Figure 1(c). In the course of our\nstudy, we uncover several notions of physical and mathematical interest: normalized\nasymptotic kernel elements, localized energy functionals, localized ADM modulators,\nand relative energy-momentum vectors. Importantly, this theory provides us with a\ncomplete and direct validation of Carlotto and Schoen’s conjecture. We now outline\nthe concepts leading to (i)–(iii) above, while referring to our companion paper [20] for\nfurther technical details and applications.\n2. Localized seed-to-solution projection\nEinstein constraints.\nFor n ≥ 3, we are interested in n-dimensional Riemannian\nmanifolds (M, g, k) with (one or) several asymptotic ends, endowed with a Riemannian\nmetric g and a symmetric (0, 2)-tensor field k, and instead of working with k directly\nwe consider the (2, 0)-tensor h defined by\nh = (k − Trg(k)g)♯♯,\n(1)\nwhere the sharp symbol refers to the duality between covariant and contravariant tensors\ninduced by g. The Hamiltonian and momentum constraints in vacuum read\nH(g, h) = Rg +\n1\nn − 1(Trg h)2 − |h|2\ng = 0,\nM(g, h) = Divgh = 0, (2)\nin which Rg denotes the scalar curvature of g, and Trg h and |h|g denote the trace and\nnorm of h, respectively, while Divg stands for the divergence operator.\nFrom seed data to initial data sets.\nWe introduce a parametrization of all solutions in\nthe “vicinity” of a given localization data set, as we call it, which serves to specify the\nunderlying geometry of interest, that is, both the gluing domain and the asymptotic\ndecay profile. A localization domain Ω ⊂ M is provided, together with a weight\nωp = λPrn/2−p.\n(3)\nIn each asymptotic end, this weight specifies a localization in angular directions based\non a function λ ≥ 0 vanishing linearly on the boundary of Ω, raised to some large\nenough power P, and also contains the factor rn/2−p concerning the radial decay in\nspacelike directions. Moreover, a “reference” data set (g0, h0) is chosen which plays\na secondary role in our construction (and satisfies the decay condition (8), below).\nOur parametrization is presented in terms of a localized seed-to-solution, variational\nprojection operator, as we call it, which is denoted by\nSolλ\nn,p: (gseed, hseed) ∈ seed(Ω, g0, h0, pG, pA, ϵ)\n7→ (g, h) ∈ [(gseed, hseed)],\n(4)\n3\nB. Le Floch and P.G. LeFloch\nOptimal shielding for Einstein gravity\nand which maps seed data sets (gseed, hseed) to “exact” data sets solving the Einstein\nconstraints.\nThis standpoint extends the (non-localized) formulation in [22].\nThe\ncharacterization of the projection is given in (6)–(7), below, and [(gseed, hseed)] stands\nfor the equivalence class associated by this projection.\nDecay exponents:\nprojection,\ngeometry,\nand accuracy.\nWe focus on the class\nof asymptotically Euclidean solutions and the gluing within a domain Ω with\nasymptotically conical domains described in certain preferred charts at infinity. It is\nessential to clearly distinguish between the roles (and the ranges) of several pointwise\ndecay exponents denoted by p, pG, pA and satisfying\np ∈ (p♭\nn, n − 2),\npG ∈ (0, +∞),\npA ≥ max(p, pG),\n(5)\nwhere p♭\nn = 1\n2(n − 2 − 1/(n − 2)).\n• The projection exponent p for the map Solλ\nn,p arises in the variational formulation\nof the linearized Einstein operator. In short, we seek a deformation of the form\ng = gseed + γ,\nh = hseed + η,\n(6)\nwhere, up to weights, (γ, η) belongs to the image of the adjoint dG∗\n(g0,h0) of the\nlinearization —at the reference point (g0, h0)— of the Hamiltonian and momentum\noperators (1). Specifically, there exist a scalar field u and a vector field Z so that\nγ = ω2\np dH∗\n(g0,h0)[u, Z],\nη = ω2\np+1 dM∗\n(g0,h0)[u, Z].\n(7)\n• The geometry exponent pG specifies the (possibly very low) decay of the seed metric\nand extrinsic curvature (gseed, hseed) relative to Euclidean data (δ, 0), namely\ngseed − δ = O(r−pG),\nhseed = O(r−pG−1).\n(8)\n• The accuracy exponent pA describes how well the seed data obeys the constraints\nin the vicinity of each asymptotic end, in the sense that\nH(gseed, hseed) = O(λPr−pA−3),\nM(gseed, hseed) = O(λPr−pA−3).\n(9)\nRigorous results are stated in suitably weighted and localized Lebesgue-H¨older norms,\nwhich we omit in this Letter and require dealing with Killing initial data sets [25]. The\nabove conditions are sufficient in order to establish the existence of the projection map\nSolλ\nn,p in (4) together with sub-harmonic estimates, as discovered in [6] and slightly\nextended in [20].\n3. Optimal shielding from within narrow gluing domains\nHarmonic stability.\nOur main observation concerns the derivation of sharp integral and\npointwise estimates, which involve (cf. (10))\n• the sharp decay exponent p⋆ ∈ (n − 2, pλ\nn,p) with p⋆ ≤ pA, which controls how the\ndifference (g −gseed, h−hseed) between the seed data set and actual solution decays.\n4\nB. Le Floch and P.G. LeFloch\nOptimal shielding for Einstein gravity\nHere, pλ\nn,p denotes an upper bound exponent which is super-harmonic and generally\ndepends upon the localization function λ. When applying the projection operator Solλ\nn,p,\nwe discover that (gseed, hseed) − (g, h) contains a harmonic contribution as part of the\nasymptotic structure of the solution at each asymptotic end. Namely, by examining\nan asymptotic version of the constraints at infinity (cf. Section 4), we unveil certain\n(asymptotic kernel) contributions associated with the sphere at infinity (cf. Section 5).\nOverview of the main theorem.\nWe only state here an informal version of our main\nconclusion. Consider a conical localization data set (M, Ω, g0, h0, r, λ) together with\n(projection, geometry, accuracy) exponents (p, pG, pA), as stated earlier. Assume the\nlocalization function λ satisfies, at each asymptotic end, suitably weighted Poincar´e and\nHardy-type inequalities which express certain Hamiltonian and momentum stability\nconditions restricted to the (n − 1)-dimensional sphere at infinity.\n• For any localized seed data set (gseed, hseed) that is sufficiently close to (g0, h0), there\nexists a solution (g, h) to the Einstein constraints defined in (6)–(7) by variational\nprojection of (gseed, hseed) which enjoys the pointwise decay estimates\ng = gmod\nseed + O(λPr−p⋆),\nh = hmod\nseed + O(λPr−p⋆−1)\n(10)\nfor some large exponent P with P < P.\n• In (10), the modulated seed data set (gmod\nseed, hmod\nseed), as we call it, is defined in (17)–\n(19), below, and coincides with the prescribed seed data set (gseed, hseed) up to\n“modulators” belonging to the finite-dimensional kernels of the harmonic operators\nassociated with the Hamiltonian and momentum operators; cf. Section 5, below.\n• Importantly,\nthe Poincar´e and Hardy stability conditions required on the\nlocalization function λ allows for gluing domains that are possibly nested and\narbitrarily narrow in one direction, as illustrated by Figure 2.\nWe refer to these results as the optimal shielding theory, since we allow for solutions\nthat are arbitrarily localized, are generated from data with arbitrarily slow decay, and\nyet enjoys estimates at the super-harmonic level of decay. The interested reader should\nrefer to [20, Theorem 1.1] for the details. In the rest of this text we present several key\nnotions of our method.\n4. Harmonic-spherical decompositions and stability conditions\nNotation.\nAfter a suitable reduction to one asymptotic end (labelled ι) and by treating\nvarious terms as asymptotic perturbations, we are led to consider a single truncated\nconical domain ωι ≃ ΩR of the Euclidean space (Rn, δ), consisting of a cone in Rn with\na support denoted by Λι ⊂ Sn−1, intersected by the exterior of a ball with radius R > 0.\nThe weight ωιp = (λι(x/r))Prn/2−p decays as the radial distance r ≥ R approaches\ninfinity, and the weight λι vanishes linearly near the boundary of its support Λι.\nThe localization exponent P should be sufficiently large, and the projection exponent\n5\nB. Le Floch and P.G. LeFloch\nOptimal shielding for Einstein gravity\nFigure 2.\nExample of a gluing domain with four asymptotic ends (orange)\ndiffeomorphic to thin truncated cones, and connected by an interior region (blue).\np ∈ (0, n − 2). The weighted Sobolev space H2\n−P(Λι) (used in (16), below) is defined\nwith respect to the measure dχι = λ2P\nι dbx where dbx is the standard volume form of the\n(n − 1)-dimensional unit sphere Sn−1. The weighted average of a function f: Λι → R is\ndenoted by\n⟨f⟩ι =\n \nΛι\nf dχι =\n1\nAreaλι\nˆ\nΛι\nf dχι,\nAreaλι =\nˆ\nΛι\ndχι.\n(11)\nA decomposition of the Einstein constraints.\nThe asymptotic properties of the seed-\nto-solution map are controlled by the linearization of the constraints around Euclidean\ndata, evaluated on the deformation (γ, η) given in (7). This leads to fourth- and second-\norder (squared) localized Hamiltonian and momentum operators\nH λι[u] = ω−2\nιp\n\u0010\n(n − 1) ∆(ω2\nιp ∆u) + ∂i∂j(ω2\nιp)∂i∂ju − ∆(ω2\nιp)∆u\n\u0011\n,\nM λι[Z]i = −1\n2 (∆Zi + ∂j∂iZj) − (∂j log ωι,p+1) (∂jZi + ∂iZj),\n(12)\nin which u: ΩR → R is scalar-valued and Z: ΩR → Rn is vector-valued, and where\nrepeated indices are implicitly summed.\nIn the present discussion, let us focus our\nattention on the Hamiltonian. For the study of the (super-)harmonic decay of solutions,\nwe introduce the following harmonic-spherical decomposition, as we call it,\nr4H λι[u] = A[u] + /A\nλι[u] + //A\nλι[u].\n(13)\nThe part A[u] contains only radial derivatives, while the “double slashed” operator is\ndefined by plugging functions ν r−2(n−2−p) (harmonic contributions to the metric):\n//Aλι[ν] = r2(n−p)H λι[ν r−2(n−2−p)],\n(14)\nwhich is an elliptic but non-self-adjoint operator. Integrating it against ν dχι yields the\ncorresponding quadratic functional\n//A\nλι[ν] =\n \nΛι\n\u0010\n(n−2)( /∆ν)2 +| /∇2ν|2 +2(1+an,p)| /∇ν|2 −cn,p ν /∆ν\n\u0011\ndχι(15)\nwith an,p = 2(n − 2 − p) and cn,p = an,p(1 + (n − 2)(n − 2 − an,p)). Here, /∇, /∇2, and /∆\ndenote the covariant derivative, Hessian, and Laplacian on Sn−1.\n6\nB. Le Floch and P.G. LeFloch\nOptimal shielding for Einstein gravity\nStability conditions on the localization function.\nIn order to establish harmonic\nestimates, we uncover the stability conditions to be required on the function λι and\ntake the form of weighted Poincar´e-Hardy-type inequalities on the sphere at infinity. For\ninstance, our harmonic stability condition for the Hamiltonian reads\n//A\nλι[ν] ≳ ∥ν∥2\nH2\n−P (Λι),\nν ∈ H2\n−P(Λι) with ⟨ /∆νι − dn,pν⟩ι = 0\n(16)\nwith bn,p = 2 + (n − 3)(n − 2 − an,p) and dn,p = (n − 1)an,pbn,p/(n2 − 4n + 5).\nWe\nprove that this condition ensures that the kernel ker( //A\nλι) is of dimension 1 and we\nselect a normalized element νnorm\nι\nat the end labelled ι, characterized by the condition\n⟨ /∆νnorm\nι\n−dn,p νnorm\nι\n⟩ι = ζλι with ζλι Areaλι = 4 |Sn−1|/(n2−4n+5). For the asymptotic\noperator associated with the momentum M λ, we arrive at a kernel with dimension n\ninstead and normalized kernel elements denoted by ξnorm(j)\nι\n∈ ker ( //Bλι) for j = 1, . . . , n.\n5. Localized ADM modulators and relative energy-momentum vectors\nModulation at infinity.\nFinally,\nthe seed-to-solution map generates terms with\nharmonic decay that we now describe.\nStarting from the localized seed data set\n(gseed, hseed) we introduce the modulated seed data set (used in (10))\ngmod\nseed = gseed +\nX\nι\nκι g∞\nι ,\nhmod\nseed = hseed +\nX\nι\nκι h∞\nι ,\n(17)\nin which κι denotes a partition of unity associated with the collection of asymptotic end\nΩι, and for each ι one has localized modulators (g∞\nι , h∞\nι ) parametrized by a constant\nspacetime vector consisting of a scalar m∞\nι\nand a vector J∞\nι , with\ng∞\nι\n= λ2P\nι rn−2p(∂i∂ju∞\nι − δij∆u∞\nι ),\nu∞\nι = m∞\nι\nνnorm\nι\n(x/r)\nran,p\n,\n(18)\nh∞\nι = −1\n2 λ2P\nι rn−2p−2(∂iZ∞\nιk +∂kZ∞\nιi )1≤i,k≤n,\nZ∞\nι\n= J∞\nιj\nξnorm(j)\nι\n(x/r)\nran,p\n.(19)\nHere, νnorm\nι\n∈ ker ( //Aλι) and ξnorm(j)\nι\n∈ ker ( //Bλι) denote the normalized elements.\nRelative ADM invariants.\nWhen the seed and solution have sufficiently strong decay,\nthe spacetime vectors (m∞\nι , J∞\nι ) are given by differences of ADM invariants of these two\ndata sets. Our formalism, however, allows for very slow decay of the metric and extrinsic\ncurvature, which leads us to introduce a notion of relative invariants, as follows. Given\ntwo pairs (g, h) and (g′, h′) of symmetric two-tensors on the same asymptotically flat\nmanifold, the relative energy and the relative momentum vector are defined (at each\nend, whenever the limits exist) as\nm(Ωι, g − g′) = 1\n2c∗\nlim\nr→+∞ rn−1\nˆ\nSn−1\nn\nX\ni,j=1\nxj\nr ((g − g′)ij,i − (g − g′)ii,j)\n\f\f\f\n|x|=rdbx,\n(20)\nJ(Ωι, h − h′)j = 1\nc∗\nlim\nr→+∞ rn−1\nˆ\nSn−1\nX\n1≤k≤n\nxk\nr (h − h′)jk\n\f\f\f\n|x|=rdbx\n(21)\n7\nB. Le Floch and P.G. LeFloch\nOptimal shielding for Einstein gravity\nwith c∗ = (n − 1) |Sn−1|.\nOur definition makes sense even when the initial data\nset does not admit a standard notion of mass-energy and momentum, since we only\nrequire that the difference has sufficient decay.\nFor instance, m(Ωι, g − g′) is well-\ndefined when g and g′ agree at the rate r−a with a > (n − 2)/2.\nWhile we have\nm(Ωι, g − g′) = m(Ωι, g) − m(Ωι, g′) provided both masses are finite, it is possible for\nthe relative mass to be finite for metrics g and g′ having infinite mass.\nThanks to our choice of normalization of the kernel elements, the energy-momentum\nvector (m∞\nι , J∞\nι ) can be interpreted as the relative energy-momentum associated with\nthe prescribed data set and the actual solution, that is,\nm∞\nι = m(Ωι, κι(g − gseed)),\nJ∞\nι\n= J(Ωι, κι(g − gseed)).\n(22)\n6. Concluding remarks\nRelated results.\nThe construction and analysis of physically relevant solutions to the\nEinstein constraints is a central topic in the physical, mathematical, and numerical\nliterature; cf. the recent reviews by Carlotto [5] and Galloway et al. [15], as well\nas Henneaux [17].\nBeig and Chru´sciel [3] treated the gluing problem in linearized\ngravity. In addition to the variational method, Lichnerowicz and followers proposed the\nconformal method, which we do not attempt to review here [16, 18, 19, 24]. In particular,\nIsenberg [18] provides one with a parametrization of all closed manifolds representing\ndata sets with constant mean curvature, a result generalized by Maxwell [24].\nPerspectives.\nThe proposed framework should have interesting applications beyond\nthe localization problem discussed in the present paper.\nFrom a physics viewpoint,\nthe asymptotic kernels may help uncover the structure of Einstein’s constraints at\ninfinity within a (possibly narrow) angular domain.\nFurthermore, our construction\nin [20] relies on weighted energy functionals associated with the (squared) localized\nHamiltonian and momentum operators (12).\nIn combination with interior elliptic\nregularity estimates, these enable the desired estimates of the (integral, pointwise) decay\nof solutions associated with the operators H λ and M λ. Beyond their technical use,\nthey may be interesting concepts in their own right.\nNumerics.\nThe projection map could be analyzed numerically, as it naturally leads to a\nwell-posed, boundary value problem for a coupled system of nonlinear elliptic equations\nposed in a domain with singular behavior at the boundary, and our framework (stability\ninequalities, energy functionals, etc.) is amenable to numerical analysis techniques.\nThere are interesting recent developments in the numerical literature such as [4], which\nwe do not attempt to review here.\nAcknowledgments.\nThe authors were supported by the project Einstein-PPF: “Einstein\nconstraints: past, present, and future” funded by the Agence Nationale de la Recherche, as well\nas the project 101131233: Einstein-Waves: “Einstein gravity and nonlinear waves: physical\n8\nB. Le Floch and P.G. LeFloch\nOptimal shielding for Einstein gravity\nmodels, numerical simulations, and data analysis”, funded by the European Research Council\n(MSCA staff exchange).\nBibliography.\n[1] J. Anderson, J. Corvino, and F. Pasqualotto, Multi–localized time-symmetric initial data\nfor the Einstein vacuum equations, arXiv:2301.08238.\n[2] S. Aretakis, S. Czimek, and I. Rodnianski, The characteristic gluing problem for the Einstein\nequations and applications, arXiv:2107.02441.\n[3] R. Beig and P.T. Chru´sciel, Shielding linearised-gravity, Phys. Rev. D 95 (2017), 064063.\n[4] F. Beyer, J. Frauendiener, and J. Ritchie, Asymptotically flat vacuum initial data sets\nfrom a modified parabolic-hyperbolic formulation of the Einstein vacuum constraint equations,\nPhys. Rev. D 101 (2020), 084013.\n[5] A. Carlotto, The general relativistic constraint equations, Living Rev. Relativity (2021), 24:2.\n[6] A. Carlotto and R. Schoen, Localizing solutions of the Einstein constraint equations, Invent.\nMath. 205 (2016), 559–615.\n[7] P.T. Chru´sciel, Anti-gravit´e `a la Carlotto-Schoen [after Carlotto and Schoen], S´eminaire\nBourbaki, Vol. 2016/2017, Exp. 1120, Ast´erisque 407 (2019), 1–25.\n[8] P.T. Chru´sciel and E. Delay, On mapping properties of the general relativistic constraints\noperator in weighted function spaces with applications, M´em. Soc. Math. France, Vol 94, 2003.\n[9] P.T. Chru´sciel and E. Delay, On Carlotto-Schoen-type scalar-curvature gluings, Bull. Soc.\nMath. France 149 (2021), 641–662.\n[10] J. Corvino, Scalar curvature deformation and a gluing construction for the Einstein constraint\nequations, Comm. Math. Phys. 214 (2000), 137–189.\n[11] J. Corvino and L.-H. Huang, Localized deformation for initial data sets with the dominant\nenergy condition, Calc. Variations PDEs 59 (2020), 42.\n[12] J. Corvino and R. Schoen, On the asymptotics for the vacuum Einstein constraint equations,\nJ. Diff. Geom. 73 (2006), 185–217.\n[13] S. Czimek and I. Rodnianski, Obstruction-free gluing for Einstein equations, arXiv:2210.09663.\n[14] E. Delay, Localized gluing of Riemannian metrics in interpolating their scalar curvature,\nDifferential Geom. Appl. 29 (2011), 433–439.\n[15] G. Galloway, P. Miao, and R. Schoen, Initial data and the Einstein constraint equations, in\n“General relativity and gravitation”, Cambridge Univ. Press, Cambridge, 2015, pp. 412–448.\n[16] R. Gicquaud, The conformal method is not conformal, in preparation.\n[17] M.\nHenneaux,\nCorvino-Schoen\ntheorem\nand\nsupertranslations\nat\nspatial\ninfinity,\narXiv:2306.12505.\n[18] J. Isenberg, Constant mean curvature solutions of the Einstein constraint equations on closed\nmanifolds, Class. Quant. Grav. 12 (1995), 2249–2274.\n[19] J. Isenberg, D. Maxwell, and D. Pollack, A gluing construction for non-vacuum solutions\nof the Einstein-constraint equations, Adv. Theor. Math. Phys. 9 (2005), 129–172.\n[20] B.\nLe\nFloch\nand\nP.G.\nLeFloch,\nOptimal localization for the Einstein constraints,\narXiv:2312.17706.\n[21] P.G. LeFloch and T.-C. Nguyen, The seed-to-solution method for the Einstein constraints\nand the asymptotic localization problem, arXiv:1903.00243 (March 2019).\n[22] P.G. LeFloch and T.-C. Nguyen, The seed-to-solution method for the Einstein constraints\nand the asymptotic localization problem, J. Funct. Analysis 285 (2023), 110106.\n[23] Y.-C. Mao and Z.-K. Tao, Localized initial data for Einstein equations, arXiv:2210.09437.\n[24] D. Maxwell, Initial data in general relativity described by expansion, conformal deformation\nand drift, Comm. Anal. Geom. 29 (2021), 207–281.\n[25] V. Moncrief, Spacetime symmetries and linearization stability of the Einstein equations. I, J.\nMath. Phys. 16 (1975), 493.\n9\n"
}