{
    "optim": "Computing eigenfrequency sensitivities near exceptional points Felix Binkowski,1 Julius Kullig,2 Fridtjof Betz,1 Lin Zschiedrich,3 Andrea Walther,1, 4 Jan Wiersig,2 and Sven Burger1, 3 1Zuse Institute Berlin, 14195 Berlin, Germany 2Institut f¨ur Physik, Otto-von-Guericke-Universit¨at Magdeburg, 39106 Magdeburg, Germany 3JCMwave GmbH, 14050 Berlin, Germany 4Department of Mathematics, Humboldt-Universit¨at zu Berlin, 10099 Berlin, Germany Exceptional points are spectral degeneracies of non-Hermitian systems where both eigenfrequen- cies and eigenmodes coalesce. The eigenfrequency sensitivities near an exceptional point are signif- icantly enhanced, whereby they diverge directly at the exceptional point. Capturing this enhanced sensitivity is crucial for the investigation and optimization of exceptional-point-based applications, such as optical sensors. We present a numerical framework, based on contour integration and algorithmic differentiation, to accurately and efficiently compute eigenfrequency sensitivities near exceptional points. We demonstrate the framework to an optical microdisk cavity and derive a semi-analytical solution to validate the numerical results. The computed eigenfrequency sensitiv- ities are used to track the exceptional point along an exceptional surface in the parameter space. The presented framework can be applied to any kind of resonance problem, e.g., with arbitrary geometry or with exceptional points of arbitrary order. I. INTRODUCTION Resonance phenomena play a crucial role in the field of photonics. The interaction of light with photonic nanoresonators leads to a strong increase of the electro- magnetic fields. This effect can be used for, e.g., prob- ing single molecules with ultrahigh sensitivity [1], design- ing nanoantennas with a tailored directivity and large spontaneous emission rate [2], or realizing efficient single- photon sources [3]. Resonances are characterized by loss mechanisms, such as damping or open boundaries, yield- ing non-Hermitian systems with complex-valued eigen- frequencies [4, 5]. In general, the resonances are nu- merically computed by solving the source-free Maxwell’s equations [6–8]. For the investigation of photonic sys- tems, not only the resonances are of interest, but also their partial derivatives, the so-called sensitivities, with respect to certain system parameters. These enable a better understanding of the underlying physical effects [9] and an efficient optimization of corresponding photonic devices [10, 11]. An impressive signature of the non-Hermitian physics of resonant photonic systems are degeneracies where not only the complex eigenfrequencies but simultane- ously also the involved eigenmodes coalesce; for a review see [12]. Commonly, parametric fine-tuning is needed to achieve such non-Hermitian degeneracies, which is why they are also called exceptional points (EPs) in parame- ter space [13]. In the past years, EPs have been connected to a plethora of interesting effects and suggested ap- plications including ultra-sensitive sensors [14–24], loss- induced revival of lasing [25], orbital-angular momen- tum microlasers [26], chiral perfect absorbers [27], con- trol of light transport [28], single-mode lasing [29], elec- tromagnetically induced transparency [30], optical am- plifiers [31], and optical filters with sharp transmission peaks [32, 33]. The research on EPs is still a vital field with open problems, such as sensor-performance limita- tions or Petermann factor divergence at EPs [34–38]. The eigenfrequencies near an EP show a characteris- tic complex-root topology [13]. Consequently, near the EP, small parametric changes of the system are ampli- fied to a strong response of the eigenfrequencies. This EP-enhanced eigenfrequency sensitivity is challenging in experiments and may also spoil the accuracy of numerical simulations. On the other hand, calculation of the eigen- frequency sensitivities near an EP is crucial for applica- tions such as sensors or optimization schemes. Hence, ac- curate and efficient numerical methods for photonic sys- tems operating near an EP are of fundamental interest in research and engineering. In this work, we address this challenge by combin- ing contour integration with algorithmic differentiation (AD). Contour integration gives access to eigenfrequen- cies in non-Hermitian systems by solving Maxwell’s equa- tions with source terms at frequencies on a contour in the complex frequency plane. For the corresponding scat- tering problems, AD is exploited so that the calcula- tion of eigenfrequency sensitivities is numerically accu- rate and efficient. Although the eigenfrequency sensitiv- ities diverge near an EP, which is sketched in Fig. 1, the presented framework allows to capture the EP-enhanced eigenfrequency sensitivity. We apply the framework to an optical microdisk cavity with an EP of second order. The two coalescing eigenfrequencies and the correspond- ing sensitivities are computed near the EP. The sensi- tivities are further used for an optimization scheme to track the EP along a surface in the underlying parame- ter space. Such exceptional surfaces are used to combine the sensitivity of EPs with robustness against fabrication tolerances [39–41]. II. THEORETICAL BACKGROUND In photonics, in the steady-state regime, light scat- tering by an open system can be described by the time- arXiv:2402.17648v1  [physics.comp-ph]  27 Feb 2024 2 p Parameter p p p EP Real Imag FIG. 1. Eigenfrequencies ωl and their sensitivities ∂ωl/∂p in the complex frequency plane with respect to a parameter p of an optical microdisk cavity. A specific change in the parame- ter cause the eigenfrequencies and the associated eigenmodes to coalesce at the EP. The sensitivities of the eigenfrequencies diverge near the EP. harmonic Maxwell’s equation equipped with open bound- ary conditions, ∇ × µ−1 0 ∇ × E(r, ω) − ω2ϵ(r, ω)E(r, ω) = iωJ(r), (1) where E(r, ω) ∈ C3 is the electric field, J(r) ∈ C3 is a source term corresponding to an optical source, ω ∈ C is the angular frequency, and r ∈ R3 is the spatial posi- tion. For optical frequencies, the permeability µ(r, ω) = µr(r, ω)µ0 typically equals the vacuum permeability µ0. The permittivity ϵ(r, ω) = ϵr(r, ω)ϵ0, where ϵr(r, ω) is the relative permittivity and ϵ0 is the vacuum permittivity, describes the material dispersion and the spatial distri- bution of material. Problems given by Eq. (1) are called scattering problems. Resonance problems are given by Eq. (1) but without a source term. Note that, in the following, we consider non-Hermitian systems based on open boundaries. However, the inclusion of damping as loss channel is also possible. A. Contour integration for computing eigenfrequency sensitivities near exceptional points Electromagnetic quantities q(E(r, ω)) ∈ C, such as reflection or transmission coefficients, are measured for real excitation frequencies ω ∈ R. To compute complex- valued eigenfrequencies and their sensitivities in non- Hermitian systems, we consider the analytical continu- ation of q(E(r, ω ∈ R)) into the complex frequency plane ω ∈ C, which we denote by q(ω) as a short notation of q(E(r, ω ∈ C)) [42]. The L eigenfrequencies inside a chosen contour C are given by the eigenvalues ωl of the generalized eigenproblem [43–45] H<X = HXΩ, (2) where Ω = diag(ω1, . . . , ωL) is a diagonal matrix contain- ing the eigenvalues, the columns of the matrix X ∈ CL×L are the eigenvectors, and H =   s0 . . . sL−1 ... ... sL−1 . . . s2L−2   , H< =   s1 . . . sL ... ... sL . . . s2L−1   are Hankel matrices with the contour-integral-based ele- ments sk = 1 2πi I C ωkq(ω)dω = L X l=1 ωk l al. (3) The second equality results from applying Cauchy’s residue theorem, where al are the residues of q(ω) cor- responding to the eigenfrequencies ωl, and it holds for simple eigenfrequencies. Once the elements sk are computed, there is not only access to the eigenfrequencies by solving the eigenprob- lem given in Eq. (2), but also to the eigenfrequency sen- sitivities ∂ωl/∂p, where p is some parameter. Computing the derivatives in Eq. (3) yields the linear system of equa- tions for the unknowns ∂ωl/∂p and ∂al/∂p, ∂sk ∂p = 1 2πi I C ωk ∂q(ω) ∂p dω = L X l=1 \u0012 kωk−1 l ∂ωl ∂p al + ωk l ∂al ∂p \u0013 , (4) where ωl and al are known due to solving Eq. (2) and using diag(a1, . . . , aL) = XT HX(V T X)−2 with the Van- dermonde matrix [42] V =   1 . . . 1 ω1 . . . ωL ... ... ωL−1 1 . . . ωL−1 L   . The eigenfrequencies at EPs are not simple. How- ever, experimental and numerical realizations show al- ways an eigenfrequency splitting due to fabrication inac- curacies [39] or numerical approximation [46]. For this practical reason, we can consider Eq. (4) to compute eigenfrequency sensitivities in EP-based systems. The elements sk of the Hankel matrices and their sensi- tivities ∂sk/∂p are obtained by numerical quadrature [47] of the contour integrals in Eq. (3) and Eq. (4), respec- tively, where q(ω) and ∂q(ω)/∂p are computed for com- plex frequencies on the integration contour C. The quan- tities q(ω) and ∂q(ω)/∂p only have to be computed once for each integration point and then all contour integrals can be evaluated. The integrands differ only in the weight functions ωk. Information on the numerical realization of the contour integration can be found in the Refs. [48, 49]. 3 n3 = 1 R1 R n2 n1 (a) Open System Microdisk x z y (b) max min x R x R FIG. 2. Optical microdisk cavity with an EP of second order. (a) Sketch of the two-dimensional system. Two con- centric layers of different refractive indices form the cavity. (b) Electric field intensity of the eigenmode Ez 8,1 correspond- ing to the EP. The associated eigenfrequency is given by ω8,1 ≈ ω8,2 = (6.96185 − 0.089761i) × c/R. The underlying parameters of the microdisk are n1 = 3.1239791, n2 = 1.5, and R1 = 0.4970147 × R. B. Structure exploiting algorithmic differentiation To evaluate q(ω) and ∂q(ω)/∂p on the integration con- tour, the electric field E(r, ω) and the corresponding sen- sitivity ∂E(r, ω)/∂p have to be computed. For this, we solve Maxwell’s equation given in Eq. (1) using the fi- nite element method (FEM) with the implementation of the software package JCMsuite [50]. The spatial dis- cretization of Eq. (1) yields the linear system of equa- tions AE = f, where A ∈ Cn×n is the FEM system matrix, E ∈ Cn is the scattered electric field in a finite- dimensional FEM basis, and f ∈ Cn realizes the source term. For the computation of ∂E(r, ω)/∂p, an approach based on directly using the FEM system matrix is ap- plied [11, 51, 52]. With this direct differentiation ap- proach, the sensitivities of scattering solutions can be computed by ∂E ∂p = A−1 \u0012∂f ∂p − ∂A ∂p E \u0013 . Instead of directly computing A−1, an LU-decomposition of A is calculated to efficiently solve the linear system AE = f. The LU-decomposition is used to obtain E and also ∂E/∂p. In the FEM context, an LU-decomposition is usually a computationally expensive step, so reusing it significantly reduces computational effort [11]. Several approaches could be used to evaluate the sen- sitivities of the system matrix, ∂A/∂p, and of the source term, ∂f/∂p. The required derivative information can be provided analytically by means of corresponding com- puter algebra systems if the considered functional depen- dence is not too complicated. Alternatively, one may employ finite differences to approximate the gradient in- formation. However, the resulting computational effort scales linearly with the number of parameters p [11]. Fur- thermore, finite differences only yield an approximation of the required derivative information, a fact that may cause problems if the accuracy of the derivatives is es- sential. For this reason, we propose AD to provide the required sensitivities within working accuracy in an ef- ficient way [53]. Suppose a function F : Rn 7→ Rm, y = F(p), is given in a computer language like C or C++. Then, the evaluation of F(p) can be decomposed into so- called elementary functions, the derivatives of which are well known and easy to implement in a software pack- age. The basic differentiation rules, such as the product rule, the quotient rule, etc., can be applied to each state- ment of the given code segment to calculate the overall derivatives. Hence, exploiting the chain rule yields the derivatives of the whole sequence of statements with re- spect to the input variables. One distinguishes two basic modes of AD, namely the forward mode and the reverse mode. The former one evaluates derivatives together with the function evalua- tion. In mathematical terms, one obtains, for a given direction ˙p, the Jacobian-vector product ˙y = F ′(p) ˙p. Hence, for a unit vector ˙p = ei ∈ Rn, one obtains the ith column of the Jacobian ∇F(p). When applying the reverse mode of AD, one propagates derivative informa- tion from the dependents y to the independents p af- ter the evaluation of the function F(p). This yields, for a given weight vector ¯y, the vector-Jacobian prod- uct ¯p = ¯y⊤F ′(p). Similar to the forward mode, for a unit vector ¯y = ej ∈ Rm, one obtains the jth row of the Jacobian ∇F(p). Over the past decades, extensive research activities led to a thorough understanding and analysis of these two basic modes of AD, where the complexity results with respect to the required runtime are based on the oper- ation count OF , i.e., the number of floating point oper- ations required to evaluate F(p). The forward mode of AD yields one column of the Jacobian ∇F for no more than three times OF [54, 55]. Using the reverse mode of AD, one row of ∇F is obtained for no more than four 4 x c/R x R x R x c/R x c/R2 x c/R2 (b) (c) (d) (a) FIG. 3. Variation of the parameter R1 near the EP with the parameters n1 = 3.1239791, n2 = 1.5, and R1 = 0.4970147 × R. For each R1, two eigenfrequencies ω8,1 and ω8,2 are obtained. The values for R1 result from an equidistant spacing in the interval [0.999, 1.001] × R1 with 50 points, where the first point leads to ωA 8,1 and ωA 8,2 and the 25th point leads to ωB 8,1 and ωB 8,2. The numerical results can be compared with the semi-analytical solution. (a) Real parts of the eigenfrequencies ω8,l. (b) Imaginary parts of ω8,l. (c) Real parts of the eigenfrequency sensitivities ∂ω8,l/∂R1. (d) Imaginary parts of ∂ω8,l/∂R1. times OF , also see Ref. [54]. It is important to note that this bound for the reverse mode is completely indepen- dent of the number n of input variables. Hence, if m = 1, the gradient of the then scalar-valued function F can be calculated for four function evaluations. This observa- tion is called cheap gradient result and is used extensively for derivative-based optimization approaches. However, the reverse mode requires the knowledge of intermediate results computed during the function evaluation. There- fore, the basic implementation of the reverse mode leads to a memory requirement that is proportional to the op- eration count OF . For a considerable amount of applica- tions, this fact does not cause any problems. For prob- lems of larger scale, checkpointing strategies have been developed, see, e.g., Ref. [56]. Here, instead of storing all intermediates, only a few of them are recorded. Subse- quently, the missing intermediate values are recomputed using the data stored in the checkpoints. Hence, these checkpointing strategies seek for a compromise between storing and recomputing data. Besides the theoretical foundation, numerous AD tools have been developed, e.g., CppAD [57], ADOL-C [58], and Tapenade [59]. Due to the language features, the implementation of the AD packages is based on source transformation for Fortran codes and operator overloading for C or C++ codes. When applying these AD-tools in a black box fashion to large-scale simulation codes, one usually does not ob- serve the theoretical runtime factors mentioned above, e.g., due to memory issues. Therefore, a structure ex- ploiting approach, where AD is only applied to relevant parts of the code, as used in this work, is very often ben- eficial for the efficient calculation of the derivatives. This includes also the appropriate choice of the mode of AD. For the application considered here, where, e.g., deriva- tives of a matrix with respect to a parameter vector are required, the forward mode is the method of choice. III. APPLICATION TO A MICRODISK CAVITY We apply the presented framework to a two- dimensional optical microdisk cavity with two concentric layers of different refractive indices embedded in an open environment [60]. The system is sketched in Fig. 2(a). The interest lies in the electric fields which are perpen- dicular to the cavity plane (TM polarization). This sim- plifies the time-harmonic Maxwell’s equations (1) to the scalar Helmholtz equation ∇2Ez m,l(x, y) + n2(x, y) ω2 m,l c2 Ez m,l(x, y) = 0, (5) where Ez m,l(x, y) is the z-component of the l-th eigen- mode with the azimuthal mode number m ∈ Z, the re- fractive index n(x, y) = √ϵrµr describes the material in the region of interest, ωm,l ∈ C is the eigenfrequency, and c is the speed of light. 5 EP x c/R C x c/R (a) (b) (c) x R FIG. 4. Computing eigenfrequencies and their sensitivities near the EP. (a) Complex frequency plane with integration contour C. The center of the contour is at ωEP and the radius is given by 0.01 × Re(ωEP). Four eigenfrequencies from Fig. 3(a) are shown, where ωA 8,1 and ωA 8,2 or ωB 8,1 and ωB 8,2 are the result of a contour integration with a different R1 in each case. (b) Relative error |ω8,1−ωqex|/|ωqex| with respect to the number of integration points on the contour C, where ωqex is the quasiexact solution computed with 64 integration points. The maximum side length of the FEM mesh is 0.05 × R. (c) Relative error with respect to maximum side length of the FEM mesh, where ωqex is the quasiexact solution computed with a maximum side length of 0.0125 × R. The number of integration points is 16. Legend as before. A. Semi-analytical solution Semi-analytical results for Maxwell’s equations can be obtained in the case of two concentric dielectric disks [61]. As the system is rotational invariant, the eigenfre- quencies are characterized by an azimuthal mode number m ∈ Z. Therefore, combining the continuity conditions at the dielectric interfaces with the outgoing wave con- dition results in a conditional equation Sm(ωm,l) = 0 for the eigenfrequency ωm,l. In the case of TM polarization, the function Sm(ω) is given by Sm(ω) = n2Jm(k1R1)H(1)′ m (k3R) h H(2)′ m (k2R1)H(1) m (k2R) − H(1)′ m (k2R1)H(2) m (k2R) i − n2 2Jm(k1R1)H(1) m (k3R) h H(2)′ m (k2R1)H(1)′ m (k2R) − H(1)′ m (k2R1)H(2)′ m (k2R) i − n1J′ m(k1R1)H(1)′ m (k3R) h H(2) m (k2R1)H(1) m (k2R) − H(1) m (k2R1)H(2) m (k2R) i + n1n2J′ m(k1R1)H(1) m (k3R) h H(2) m (k2R1)H(1)′ m (k2R) − H(1) m (k2R1)H(2)′ m (k2R) i , (6) where kj = njω/c and J(1) m , J(2) m , H(1) m , H(2) m are Bessel- and Hankel functions of first and second kind and or- der m, respectively. The complex roots of Sm(ω) need to be determined numerically, e.g., by Newton’s method, where an initial guess can be taken from a single disk with modified refractive index [61]. With the implicit function theorem, the derivative of the eigenfrequency ωm,l with respect to a parameter p ∈ {n1, n2, n3, R1, R} can be cal- culated as ∂ωm,l ∂p = − \u0014∂Sm ∂ω (ωm,l) \u0015−1 ∂Sm ∂p (ωm,l). The partial derivatives ∂Sm/∂ω and ∂Sm/∂p are inde- pendent of the eigenfrequency. Therefore, they can be calculated analytically with a common computer algebra system from Eq. (6), see also Ref. [49]. B. Numerical solution To numerically solve Eq. (5), the software RPEx- pand [48] is applied. The eigenfrequencies ωm,l and the corresponding sensitivities ∂ωm,l/∂p with respect to a parameter p are computed by using the contour- integral-based framework. Here, the quantity q(ω) is the z-component of the electric field at the position 6 (a) x c/R x c/R EP (b) x R n2 = 1.5 FIG. 5. Tracking the EP in the parameter space. (a) Numer- ical and semi-analytical results for the trajectory of the eigen- frequency ωEP. The arrow indicates the eigenfrequency ωEP from Ref. [60]. (b) Corresponding parameter combinations. For each point in the parameter space, the parameter n2 is shifted by 0.0025. [x, y] = [0, 0.9 × R] resulting from an z-polarized plane wave travelling in y-direction. RPExpand contains an interface to the software JCMsuite. The approach of AD is utilized within JCMsuite. Convergence with re- spect to the FEM parameters is ensured by refining the spatial mesh, where the degree of the polynomial ansatz functions is set to four. For computational efficiency, the mirror symmetries of the system are exploited. Fur- ther information on the numerical implementation can be found in Ref. [49]. We study an EP of second order [60]. Two eigen- modes with an azimuthal mode number m = 8 and the corresponding eigenfrequencies coalesce at the pa- rameter combination n1 = 3.1239791, n2 = 1.5, and R1 = 0.4970147 × R. The electric field intensity of a cor- responding eigenmode Ez 8,1 is shown in Fig. 2(b). The eigenfrequency is given by ω8,1 ≈ ω8,2 = (6.96185 − 0.089761i)×c/R. In the following, for a simpler notation, we denote this specific eigenfrequency by ωEP. The eigenfrequencies ω8,l and their sensitivities ∂ω8,l/∂R1 near the EP are investigated. Figure 3(a) shows the trajectories of the real parts of the eigenfre- quencies ω8,l when the parameter R1 is varied and n1 and n2 are fixed. For each radius R1, a contour integral is computed leading to two eigenfrequencies. The super- script letters A and B describe two points in the param- eter space that differ in the radius R1. When R1 is in- creased, i.e., going from ωA 8,1 to ωB 8,1 or ωA 8,2 to ωB 8,2, then the two eigenfrequencies converge. Figure 3(b) shows the imaginary parts and Fig. 3(c) and Fig. 3(d) show the corresponding sensitivities. The results can be compared with the semi-analytical solution ωan. For ωB 8,1, the rela- tive error |Re(ωB 8,1−ωan)/Re(ωan)| is smaller than 7×10−7 and, for the corresponding imaginary part, the relative error is smaller than 5 × 10−5. The relative error for the underlying sensitivities is smaller than 2 × 10−3 for real and imaginary part. It can be observed that the sensitiv- ities diverge in the vicinity of the EP. The divergence can be explained by the square root dependence of the eigen- frequencies on perturbations when the system is near the EP [13]. For all calculations corresponding to Fig. 3, the con- tour C shown in Fig. 4(a) with 16 integration points and a maximum side length of the FEM mesh of 0.05×R are used. Figure 4(a) also sketches the locations of the eigen- frequencies ωA 8,1, ωA 8,2, ωB 8,1, and ωB 8,2 with the trajectories when R1 is varied in the direction of the parameter for the EP. To demonstrate the accuracy of the approach, Fig. 4(b) shows the relative error of the absolute value of ωA 8,1, ∂ωA 8,1/∂R1, ωB 8,1, and ∂ωB 8,1/∂R1 with respect to the number of integration points on the contour C. Fig- ure 4(c) shows the relative error with respect to the max- imum side length of the FEM mesh. It can be observed that the relative error for the sensitivities is smaller for ωA 8,1, which lies further away from the EP. The closer the two calculated eigenfrequencies lie to each other, the less accurate the results are. With only 16 integration points, it is possible to obtain a maximum relative error of smaller than 10−5 for the eigenfrequency sensitivities ∂ω8,1/∂R1 for both points A and B in the parameter space. Using a maximum side length of the FEM mesh of 0.05 × R is sufficient to achieve a maximum relative error of smaller than 3 × 10−3. Note that, for simplicity, we only show the sensitivi- ties ∂ω8,l/∂R1. The results for ∂ω8,l/∂n1 and ∂ω8,l/∂n2 exhibit a similar behavior. C. Exceptional surface We track the EP in the parameter space by using Newton’s method with the sensitivities ∂ω8,l/∂n1 and ∂ω8,l/∂R1. We are looking for the zeros of the squared eigenfrequency splitting (ω8,1 − ω8,2)2. The reason for choosing the square of the splitting is the square root dependency of the eigenfrequencies near the EP. The starting point is the parameter combination correspond- ing to ωB 8,1 and ωB 8,2 shown in Fig. 3(a), given by n1 = 3.1239791, n2 = 1.5, and R1 = 0.497004557 × R. With a fixed n2 = 1.5, a certain tolerance, and a few iterations of Newton’s method, the two eigenfrequencies ωEP 8,1 = (6.961993 − 0.089638i) × c/R and ωEP 8,2 = (6.961996 − 0.089642i) × c/R with the parameters n1 = 3.123979246 and R1 = 0.497014753 × R are obtained. Then, the parameter n2 is shifted by a constant value of 0.0025 and Newton’s method is restarted with the shifted n2 together with the previously calculated values for the 7 parameters n1 and R1, and with a new integration con- tour centered at the previously computed eigenfrequency. The results of this procedure are shown in Fig. 5, where Fig. 5(a) contains the trajectory of ωEP and Fig. 5(b) shows the corresponding parameter combinations. Although the sensitivities diverge near the EP, the nu- merical calculations of the sensitivities are still accurate enough for Newton’s method to work very well. There- fore, the exceptional surface is identified as a curve in the parameter space spanned by R1 and n1. Figure 5 also contains the semi-analytical solution and it agrees with the numerical results. IV. CONCLUSION Eigenfrequency sensitivities near EPs were investi- gated. For this purpose, we developed a framework based on contour integration with AD. We applied a numerical implementation of the framework to an optical microdisk cavity with an EP of second order. It was shown that the eigenfrequency sensitivities near the EP can be cap- tured accurately and efficiently. The sensitivities were applied to track the EP in the parameter space. A semi- analytical solution for the system was derived and used to validate the numerical results. The presented contour-integral-based framework can- not only be applied to a benchmark problem as studied in this work, but also to any resonant system, e.g., with complex geometry or with an EP of arbitrary order. The combination of contour integration with AD makes the framework very general since the approach is essentially based on solving scattering problems. The treatment of the corresponding linear systems of equations is a stan- dard task for state-of-the-art software packages used in the field of computational physics. Computing eigenfrequency sensitivities near EPs can aid in optimizing setups for EP-based sensors. For ex- ample, exceptional surfaces [62] in higher dimensional parameter spaces can be identified, which can then be used to optimize an EP along such a surface to maximize sensitivity to a targeted perturbation while minimizing the response to other perturbations that may arise from fabrication tolerances or noise. For such an optimization scheme, the numerically accurate and efficient computa- tion of eigenfrequency sensitivities with respect to spe- cific system parameters is crucial. DATA AND CODE AVAILABILITY Supplementary data tables and source code for the nu- merical experiments for this work can be found in the open access data publication [49]. Links to further AD tools and comprehensive information on AD can be found at www.autodiff.org. ACKNOWLEDGEMENTS We acknowledge funding by the Deutsche Forschungs- gemeinschaft (DFG, German Research Foundation) un- der Germany’s Excellence Strategy - The Berlin Mathe- matics Research Center MATH+ (EXC-2046/1, project ID: 390685689) and by the German Federal Ministry of Education and Research (BMBF Forschungscampus MODAL, project 05M20ZBM). [1] S. Nie and S. R. Emory, Probing Single Molecules and Single Nanoparticles by Surface-Enhanced Raman Scat- tering, Science 275, 1102 (1997). [2] G. M. Akselrod, C. Argyropoulos, T. B. Hoang, C. Cirac`ı, C. Fang, J. Huang, D. R. Smith, and M. H. Mikkelsen, Probing the mechanisms of large Purcell enhancement in plasmonic nanoantennas, Nat. Photonics 8, 835 (2014). [3] P. Senellart, G. Solomon, and A. White, High- performance semiconductor quantum-dot single-photon sources, Nat. Nanotechnol. 12, 1026 (2017). [4] P. Lalanne, W. Yan, K. Vynck, C. Sauvan, and J.-P. Hugonin, Light Interaction with Photonic and Plasmonic Resonances, Laser Photonics Rev. 12, 1700113 (2018). [5] S. Dyatlov and M. Zworski, Mathematical theory of scattering resonances (American Mathematical Society, Providence, Rhode Island, 2019). [6] P. Lalanne, W. Yan, A. Gras, C. Sauvan, J.-P. Hugo- nin, M. Besbes, G. Dem´esy, M. D. Truong, B. Gralak, F. Zolla, A. Nicolet, F. Binkowski, L. Zschiedrich, S. Burger, J. Zimmerling, R. Remis, P. Urbach, H. T. Liu, and T. Weiss, Quasinormal mode solvers for res- onators with dispersive materials, J. Opt. Soc. Am. A 36, 686 (2019). [7] G. Dem´esy, A. Nicolet, B. Gralak, C. Geuzaine, C. Cam- pos, and J. E. Roman, Non-linear eigenvalue problems with GetDP and SLEPc: Eigenmode computations of frequency-dispersive photonic open structures, Comput. Phys. Commun. 257, 107509 (2020). [8] T. Wu, D. Arrivault, W. Yan, and P. Lalanne, Modal analysis of electromagnetic resonators: User guide for the MAN program, Comput. Phys. Commun. 284, 108627 (2023). [9] W. Yan, P. Lalanne, and M. Qiu, Shape Deformation of Nanoresonator: A Quasinormal-Mode Perturbation The- ory, Phys. Rev. Lett. 125, 013901 (2020). [10] J. Jensen and O. Sigmund, Topology optimization for nano-photonics, Laser Photonics Rev. 5, 308 (2011). [11] F. Binkowski, F. Betz, M. Hammerschmidt, P.-I. Schnei- der, L. Zschiedrich, and S. Burger, Computation of eigen- frequency sensitivities using Riesz projections for effi- cient optimization of nanophotonic resonators, Commun. Phys. 5, 202 (2022). [12] M.-A. Miri and A. Al`u, Exceptional points in optics and photonics, Science 363, eaar7709 (2019). 8 [13] T. Kato, Perturbation Theory for Linear Operators, 2nd ed. (Springer-Verlag Berlin Heidelberg, 1995). [14] J. Wiersig, Enhancing the Sensitivity of Frequency and Energy Splitting Detection by Using Exceptional Points: Application to Microcavity Sensors for Single-Particle Detection, Phys. Rev. Lett. 112, 203901 (2014). [15] J. Wiersig, Sensors operating at exceptional points: Gen- eral theory, Phys. Rev. A 93, 033809 (2016). [16] W. Chen, S¸. K. ¨Ozdemir, G. Zhao, J. Wiersig, and L. Yang, Exceptional points enhance sensing in an op- tical microcavity, Nature 548, 192 (2017). [17] H. Hodaei, A. Hassan, S. Wittek, H. Carcia-Cracia, R. El-Ganainy, D. Christodoulides, and M. Khajavikhan, Enhanced sensitivity at higher-order exceptional points, Nature 548, 187 (2017). [18] Y.-H. Lai, Y.-K. Lu, M.-G. Suh, Z. Yuan, and K. Vahala, Observation of the exceptional-point-enhanced Sagnac effect, Nature 576, 65 (2019). [19] C. Zeng, Y. Sun, G. Li, Y. Li, H. Jiang, Y. Yang, and H. Chen, Enhanced sensitivity at high-order exceptional points in a passive wireless sensing system, Opt. Express 27, 27562 (2019). [20] M. P. Hokmabadi, A. Schumer, D. N. Christodoulides, and M. Khajavikhan, Non-Hermitian ring laser gyro- scopes with enhanced Sagnac sensitivity, Nature 576, 70 (2019). [21] J. Wiersig, Review of exceptional point-based sensors, Photon. Res. 8, 1457 (2020). [22] J.-H. Park, A. Ndao, W. Cai, L. Hsu, A. Kodigala, T. Lepetit, Y.-H. Lo, and B. Kant´e, Symmetry-breaking- induced plasmonic exceptional points and nanoscale sens- ing, Nat. Phys. 16, 462 (2020). [23] J. Kullig and J. Wiersig, Microdisk cavities with a Brew- ster notch, Phys. Rev. Res. 3, 023202 (2021). [24] J. Kullig, D. Grom, S. Klembt, and J. Wiersig, Higher- order exceptional points in waveguide-coupled microcav- ities: perturbation induced frequency splitting and mode patterns, Photon. Res. 11, A54 (2023). [25] B. Peng, S¸. K. ¨Ozdemir, S. Rotter, H. Yilmaz, M. Liertzer, F. Monfi, C. M. Bender, F. Nori, and L. Yang, Loss-induced suppression and revival of lasing, Science 17, 328 (2014). [26] P. Miao, Z. Zhang, J. Sun, W. Walasik, S. Longhi, N. M. Litchinitser, and L. Feng, Orbital angular momentum mi- crolaser, Science 353, 464 (2016). [27] W. R. Sweeney, C. W. Hsu, S. Rotter, and A. D. Stone, Perfectly Absorbing Exceptional Points and Chiral Ab- sorbers, Phys. Rev. Lett. 122, 093901 (2019). [28] Y. Xu, L. Li, H. Jeong, S. Kim, I. Kim, J. Rho, and Y. Liu, Subwavelength control of light transport at the exceptional point by non-Hermitian metagratings, Sci. Adv. 9, eadf3510 (2023). [29] H. Hodaei, M.-A. Miri, M. Heinrich, D. N. Christodoulides, and M. Khajavikhan, Parity- time–symmetric microring lasers, Science 346, 975 (2014). [30] C. Wang, X. Jiang, G. Zhao, M. Zhang, C. W. Hsu, B. Peng, A. D. Stone, L. Jiang, and L. Yang, Electromag- netically induced transparency at a chiral exceptional point, Nat. Phys. 16, 334 (2020). [31] Q. Zhong, S. Ozdemir, A. Eisfeld, A. Metelmann, and R. El-Ganainy, Exceptional-Point-Based Optical Ampli- fiers, Phys. Rev. Appl. 13, 014070 (2020). [32] S. Tao, S. Mao, J. Song, Q. Fang, M. Yu, G. Lo, and D. Kwong, Ultra-high order ring resonator system with sharp transmission peaks, Opt. Express 18, 393 (2010). [33] P. Chamorro-Posada, F. Fraile-Pelaez, and F. J. Diaz- Otero, Micro-Ring Chains With High-Order Resonances, J. Lightwave Technol. 29, 1514 (2011). [34] Z. Xiao, H. Li, T. Kottos, and A. Al`u, Enhanced Sensing and Nondegraded Thermal Noise Performance Based on PT -Symmetric Electronic Circuits with a Sixth-Order Exceptional Point, Phys. Rev. Lett. 123, 213901 (2019). [35] J. Wiersig, Prospects and fundamental limits in ex- ceptional point-based sensing, Nat. Commun. 11, 2454 (2020). [36] H. Wang, Y.-H. Lai, Z. Yuan, M.-G. Suh, and K. Vahala, Petermann-factor sensitivity limit near an exceptional point in a Brillouin ring laser gyroscope, Nat. Commun. 11, 1610 (2020). [37] R. Kononchuk, J. Cai, F. Ellis, R. Thevamaran, and T. Kottos, Exceptional-point-based accelerometers with enhanced signal-to-noise ratio, Nature 607, 697 (2022). [38] J. Wiersig, Petermann factors and phase rigidities near exceptional points, Phys. Rev. Res. 5, 033042 (2023). [39] Q. Zhong, J. Ren, M. Khajavikhan, D. N. Christodoulides, S¸. K. ¨Ozdemir, and R. El-Ganainy, Sensing with Exceptional Surfaces in Order to Combine Sensitivity with Robustness, Phys. Rev. Lett. 122, 153902 (2019). [40] Q. Zhong, S. Nelson, S¸. K. ¨Ozdemir, and R. El-Ganainy, Controlling direction absorption with chiral exceptional surfaces, Opt. Lett. 44, 5242 (2019). [41] S. Soleymani, Q. Zhong, M. Mokim, S. Rotter, R. El- Ganainy, and S¸. K. ¨Ozdemir, Chiral and degenerate per- fect absorption on exceptional surfaces, Nat. Commun. 13, 599 (2022). [42] F. Binkowski, F. Betz, R. Colom, P. Genevet, and S. Burger, Poles and zeros in non-Hermitian systems: Ap- plication to photonics, Phys. Rev. B 109, 045414 (2024). [43] L. M. Delves and J. N. Lyness, A numerical method for locating the zeros of an analytic function, Math. Comp. 21, 543 (1967). [44] P. Kravanja and M. V. Barel, Computing the Zeros of Analytic Functions, Lect. Notes Math. 1727 (Springer, New York, 2000). [45] A. P. Austin, P. Kravanja, and L. N. Trefethen, Numer- ical Algorithms Based on Analytic Function Values at Roots of Unity, SIAM J. Numer. Anal. 52, 1795 (2014). [46] J. Wiersig, Revisiting the hierarchical construction of higher-order exceptional points, Phys. Rev. A 106, 063526 (2022). [47] L. N. Trefethen and J. Weideman, The Exponentially Convergent Trapezoidal Rule, SIAM Rev. 56, 385 (2014). [48] F. Betz, F. Binkowski, and S. Burger, RPExpand: Soft- ware for Riesz projection expansion of resonance phe- nomena, SoftwareX 15, 100763 (2021). [49] F. Binkowski, J. Kullig, F. Betz, L. Zschiedrich, A. Walther, J. Wiersig, and S. Burger, Source code and simulation results: Computing eigenfrequency sen- sitivities near exceptional points, Zenodo (2024), doi: 10.5281/zenodo.10715639. [50] J. Pomplun, S. Burger, L. Zschiedrich, and F. Schmidt, Adaptive finite element method for simulation of optical nano structures, Phys. Status Solidi B 244, 3419 (2007). 9 [51] N. Nikolova, J. Bandler, and M. Bakr, Adjoint techniques for sensitivity analysis in high-frequency structure CAD, IEEE Trans. Microw. Theory Techn. 52, 403 (2004). [52] S. Burger, L. Zschiedrich, J. Pomplun, F. Schmidt, and B. Bodermann, Fast simulation method for parameter reconstruction in optical metrology, Proc. SPIE 8681, 868119 (2013). [53] A. Griewank, K. Kulshreshtha, and A. Walther, On the numerical stability of algorithmic differentiation, Com- puting 94, 125 (2012). [54] A. Griewank and A. Walther, Evaluating Derivatives: Principles and Techniques of Algorithmic Differentiation (SIAM, Philadelphia, 2008). [55] U. Naumann, The Art of Differentiating Computer Pro- grams: An Introduction to Algorithmic Differentiation (SIAM, Philadelphia, 2012). [56] A. Griewank and A. Walther, Algorithm 799: revolve: an implementation of checkpointing for the reverse or ad- joint mode of computational differentiation, ACM Trans. Math. Softw. 26, 19 (2000). [57] B. Bell, CppAD, https://github.com/coin-or/CppAD. [58] A. Walther and A. Griewank, Getting started with ADOL-C, in Combinatorial Scientific Computing, edited by U. Naumann and O. Schenk (Chapman-Hall CRC Computational Science, 2012) Chap. 7, pp. 181–202. [59] L. Hasco¨et and V. Pascual, The Tapenade automatic differentiation tool, principles, model, and specification, ACM Trans. Math. Softw. 39, 43 (2013). [60] J. Kullig, C.-H. Yi, M. Hentschel, and J. Wiersig, Excep- tional points of third-order in a layered optical microdisk cavity, New J. Phys. 20, 083016 (2018). [61] M. Hentschel and K. Richter, Quantum chaos in optical systems: The annular billiard, Phys. Rev. E 66, 056207 (2002). [62] H. Kim, S. Gwak, H.-H. Yu, J. Ryu, C.-M. Kim, and C.- H. Yi, Maximization of a frequency splitting on continu- ous exceptional points in asymmetric optical microdisks, Opt. Express 31, 12634 (2023). "
}