{
    "optim": "Prepared for submission to JCAP Optimization of foreground moment deprojection for semi-blind CMB polarization reconstruction A. Carones,a,b M. Remazeillesc aDipartimento di Fisica, Universit`a di Roma “Tor Vergata”, via della Ricerca Scientifica 1, I-00133, Roma, Italy bSezione INFN Roma 2, via della Ricerca Scientifica 1, I-00133, Roma, Italy cInstituto de F´ısica de Cantabria (CSIC-UC), Avda. los Castros s/n, 39005 Santander, Spain E-mail: alessandro.carones@roma2.infn.it, remazeilles@ifca.unican.es Abstract. Upcoming Cosmic Microwave Background (CMB) experiments, aimed at measuring pri- mordial CMB polarization B-modes, require exquisite control of instrumental systematics and Galac- tic foreground contamination. Blind minimum-variance techniques, like the Needlet Internal Linear Combination (NILC), have proven effective in reconstructing the CMB polarization signal and mit- igating foregrounds and systematics across diverse sky models without suffering from foreground mismodelling errors. Still, residual foreground contamination from NILC may bias the recovered CMB polarization at large angular scales when confronted with the most complex foreground sce- narios. By adding constraints to NILC to deproject statistical moments of the Galactic emission, the Constrained Moment ILC (cMILC) method has been demonstrated to further enhance foreground subtraction, albeit with an associated increase in overall noise variance. Faced with this trade-off be- tween foreground bias reduction and overall variance minimization, there is still no recipe on which moments to deproject and which are better suited for blind variance minimization. To address this, we introduce the optimized cMILC (ocMILC) pipeline, which performs full automated optimization of the required number and set of foreground moments to deproject, pivot parameter values, and de- projection coefficients across the sky and angular scales, depending on the actual sky complexity, available frequency coverage, and experiment sensitivity. The optimal number of moments for de- projection, before paying significant noise penalty, is determined through a data diagnosis inspired by the Generalized NILC (GNILC) method. Validated on B-mode simulations of the PICO space mis- sion concept with four challenging foreground models, ocMILC exhibits lower Galactic foreground contamination compared to NILC and cMILC at all angular scales, with limited noise penalty. This multi-layer optimization enables the ocMILC pipeline to achieve unbiased posteriors of the tensor- to-scalar ratio, regardless of foreground complexity. Keywords: CMBR polarization – CMBR experiments arXiv:2402.17579v1  [astro-ph.CO]  27 Feb 2024 Contents 1 Introduction 1 2 Sky simulations 3 3 Diagnosis of foreground complexity with GNILC 5 3.1 Methodology 5 3.2 Needlet frame implementation 7 3.3 Diagnostic maps 8 4 The optimized cMILC (ocMILC) method 10 4.1 Baseline cMILC approach 10 4.2 Optimization of moment deprojection 15 5 Discussion 22 6 Conclusions 25 A Results for PICO CBE sensitivities 26 1 Introduction Accurate measurements of the temperature anisotropies of the Cosmic Microwave Background (CMB) have yielded stringent constraints on viable cosmological models [1, 2]. Future CMB experiments, featuring enhanced sensitivity, will provide additional insights into CMB polarization anisotropies [3–6]. On the one hand, an accurate reconstruction of the CMB E-mode polarization anisotropies will lead to a cosmic-variance limited measurement of the optical depth to last scattering surface τ [5, 6], providing new constraints on the cosmic reionization history [7, 8] and the sum of neutrino masses [3, 9, 10]. On the other hand, a detection of the primordial CMB B-mode polarization may open a new window on the physics of the early Universe by setting constraints on the tensor-to-scalar ratio r, thereby shedding light on the cosmic inflation scenario [11]. To achieve these goals, future CMB experiments require exquisite control of the contamination from Galactic foregrounds and instrumental systematics. In recent years, several component sep- aration pipelines, both parametric [12–17] and blind [18–24], have been developed or customized for this purpose. Given the huge amplitude discrepancy between Galactic foregrounds and CMB B-modes, these pipelines need to demonstrate robustness against the complex and unknown proper- ties of Galactic foreground emissions, including spatial variations in their spectral energy distribution (SED) along and across the lines of sight [25], as well as resulting foreground spectral distortions [26] and spectral decorrelation [27]. Parametric component separation methods are engineered to yield minimal uncertainty in the retrieval of CMB B-modes, as long as the assumed parametric foreground model aligns with the actual foregrounds in the data. However, given the aforementioned intricacies in the foreground properties, parametric methods are also prone to potential biases in the recovery of the CMB B-mode signal when confronted with incorrect or incomplete modelling of poorly understood foregrounds [28]. In contrast, blind minimum-variance approaches to component separation, like the Needlet Internal Lin- ear Combination (NILC) method [21], offer the possibility of extracting the CMB polarization E- and – 1 – B-mode fields from multifrequency data without making any assumption about the foregrounds, thus avoiding mismodelling errors. However, if the polarized Galactic foregrounds turn out to be highly complex, as in the case of multi-layer contributions to thermal dust emission along the line-of-sight and spectral decorrelation [29], minimum-variance methods like NILC may return CMB polariza- tion maps that are still significantly contaminated by Galactic foreground residuals, as highlighted in [23, 24, 30]. To overcome these issues, intermediate approaches at the intersection of parametric and blind methods can be pursued, using either partial information on Galactic foregrounds or some effective modelling. For instance, information on the spatial variations of the foregrounds across the sky can be inferred from the data and exploited to optimize the domains over which the NILC variance is minimized, as implemented in the Multi-Clustering NILC method [24]. As an alternative semi- blind approach, the Constrained Moment ILC (cMILC) method [23] relies on effective foreground modelling through statistical moment expansion around fixed pivot spectral parameters to project out some of these moments through nulling constraints added to NILC, while leaving higher-order moments and unmodelled foregrounds for blind variance minimization. Through nulling constraints for moment deprojection, the cMILC method facilitates the handling of foreground moments and SED distortions resulting from line-of-sight and beam averaging of spatial variations in foreground spectral properties by CMB instruments. In addition, it allows for imperfect parameterization of the foregrounds by leaving any higher-order correction to the moment expansion or any omitted foreground to blind variance minimization. This semi-blind technique has proven more effective than NILC in reducing Galactic contamination in the recovered CMB B-mode map when applied to complex foreground simulations of future CMB satellite experiments such as LiteBIRD and PICO [23, 31]. However, the reduction of the residual foreground contamination bias in the cMILC CMB solu- tion is counterbalanced by an increase of the overall variance associated with instrumental noise and unconstrained foreground moments, since each additional nulling constraint in cMILC effectively re- duces the number of frequency channels available for variance minimization. Faced with this trade-off between bias reduction and variance increase, certain foreground moments may be more conducive to variance minimization than deprojection, particularly when they exert a dominant influence on the overall variance in the data, while other subdominant moments may be better addressed through deprojection. However, no recipe for determining which moments to deproject and which to retain for variance minimization has been provided thus far. In the baseline cMILC approach, the depro- jection of zeroth-order moments is prioritized, anticipating their significant contribution to the bulk of Galactic foreground emission. Nonetheless, the optimal solution might favour the deprojection of higher-order components, relegating dominant moments to blind variance minimization. Moreover, if the actual SED of polarized thermal dust and synchrotron emissions significantly deviates from the prevalent parameterization of a single modified blackbody (MBB) and a power-law, respectively, then the deprojection of SED moments with fixed values of pivot spectral parameters across the sky and angular scales may prove less effective. In this work, we introduce the optimized cMILC (ocMILC) pipeline, where the choice of mo- ments to deproject, the values of pivot parameters, and the amount of deprojection of each moment is optimized through a fully data-driven approach. Specifically, the optimal number of moments to deproject before paying significant noise penalty is determined depending on the experimental config- uration by applying the strategy of the Generalized Needlet ILC (GNILC) method [32]. This method provides a blind diagnosis of the actual complexity of the Galactic foreground emission across the sky and angular scales, yielding maps of the local number of independent foreground degrees of freedom as byproducts. Such a diagnostic tool is valuable for informing the foreground model parameter- – 2 – ization and tuning component separation pipelines according to the observed sky complexity and experimental configuration. The new ocMILC framework is tested and validated on a set of complex foreground scenarios using comprehensive simulations of the Probe of Inflation and Cosmic Origins (PICO) mission concept [6]. We choose this experimental configuration as a proof of concept, given its high sensitivity and broad frequency coverage, allowing us to thoroughly assess the robustness of the proposed approach against various thermal dust and synchrotron models. The paper is organized as follows: In Section 2, we provide a description of the PICO sky simulations involving four different foreground models. Section 3 outlines our strategy, inspired by GNILC, for conducting a data-driven diagnosis of foreground complexity. Based on this diagnos- tic, Section 4 introduces the ocMILC pipeline for optimizing foreground moment deprojection and presents the results for different Galactic dust scenarios. Section 5 explores the application of the ocMILC methodology when incorporating various polarized synchrotron and anomalous microwave emission (AME) models. Our conclusions are summarized in Section 6. 2 Sky simulations As a proof of concept, we perform simulations of multifrequency sky maps based on the experimental setup of the PICO mission. PICO, a NASA probe-scale space mission concept, is anticipated to be the most sensitive among the proposed next-generation CMB space missions, targeting a sensitivity on the tensor-to-scalar ratio of r ≤ 0.0002 at a 95% confidence level (CL) and aiming for a cosmic- variance limited measurement of the optical depth to last scattering, σ(τ) = 0.002 [6]. To meet these objectives, PICO will conduct full-sky observations in 21 frequency channels spanning from 21 to 799 GHz with high signal-to-noise to disentangle Galactic foreground emission from the CMB polarization signal. Given its extensive frequency coverage and high sensitivity, PICO serves as an ideal experimental framework to assess the robustness and flexibility of the proposed optimization of moment deprojection across various thermal dust and synchrotron models. The PICO sky maps are generated by co-adding simulated maps of CMB, Galactic foregrounds, and instrumental noise across the 21 frequency bands, according to the instrument specifications reported in [6]. CMB polarization anisotropies are generated using the HEALPix Python package1 [33, 34], based on the CMB angular power spectra of the Planck 2018 best-fit parameters [35] with a tensor- to-scalar ratio r = 0, and include the contribution from the gravitational lensing effect. The instrumental noise is simulated as white and isotropic Gaussian realizations, with standard deviations in each pixel corresponding to the polarization sensitivities of the baseline PICO configu- ration as reported in [6]. The combined noise level for this configuration is equal to 0.87 µK · arcmin. In [6, 30], it has been demonstrated that the targeted sensitivity r < 0.0002 (95% CL) can be achieved for most foreground scenarios with the so-called Current Best Estimate (CBE) PICO configuration, featuring a combined noise level of 0.61 µK·arcmin. However, for the purpose of our study relying on the more conservative baseline PICO configuration, with a combined noise level of 0.87 µK · arcmin, we estimate a target sensitivity of about r < (0.87)2/(0.61)2 × 0.0002 = 0.0004 (95% CL). Here, the noise levels are squared, as the tensor-to-scalar ratio parameter is associated with power spectrum rather than map noise. In Appendix A, we show that, by adopting the CBE PICO configuration, we can indeed achieve r < 0.0002 (95% CL) with the ocMILC method. Maps of polarized Galactic emission are generated using the PySM Python package [36, 37]. Given the current lack of knowledge about the polarized Galactic emission at the targeted sensitivity, we explore a range of foreground sky models that remain consistent with existing observations. Four 1https://github.com/healpy/healpy – 3 – distinct models of Galactic thermal dust emission are examined in this study and are described below, using the terminology of the PySM: • d1: The thermal dust emission at each line-of-sight ˆn and each frequency ν is characterized by a modified blackbody (MBB) SED in intensity units Xd(ˆn, ν) = Xd(ˆn, νd)  ν νd !βd(ˆn) Bν (Td(ˆn)) Bνd(Td (ˆn)) , (2.1) where X = {Q, U} are Stokes parameters, Bν(T) is the blackbody spectrum, βd is the dust spec- tral index, Td is the dust temperature, and Xd(ˆn, νd) represents the dust template at a reference frequency νd. Both βd and Td vary across the sky, as estimated from the Planck data analysis using the Commander algorithm [38]. The thermal dust template is given by the Commander dust Q and U maps at 353 GHz of the Planck 2015 data release, smoothed with a Gaussian beam of full width at half maximum (FWHM) 2.6◦, with stochastic small-scale fluctuations added via the procedure described in [36]. • d4: In this model, the thermal dust emission is composed of two distinct MBB components, as fitted to Planck and DIRBE/IRAS data in [39]. The temperatures of these two components vary across the sky, while the spectral indices remain constant with values β(1) d = 1.63 and β(2) d = 2.82. The Q and U templates at the reference frequency are obtained by scaling the dust intensity templates of [39] to 353 GHz and applying the polarization fraction and polarization angles of the d1 model. Gaussian small-scale fluctuations are generated similarly to the d1 model. • d7: Simulations of thermal dust emission are based on a physical model of dust grains with a distribution of sizes, composition, and temperatures. Additionally, an environmental radiation strength field is assumed across the sky based on the dust temperature map obtained in [38]. The model also accounts for magnetic dipole radiation from iron grains [40], resulting in a SED that deviates from a simple MBB spectrum. • d12: In this model, the dust emission is composed of six distinct emitting layers [29], so that the effective SED varies not only across the sky but also along the line-of-sight, leading to spectral decorrelation across frequencies. It represents the most complex dust model among the four considered in this study. Specifically, the maps of Stokes parameters at a frequency ν are given by the superposition of six templates scaled with a MBB law, each associated with a different map of spectral indices and temperatures: Xd(ˆn, ν) = 6 X k=1 X(k) d (ˆn, ν0)  ν ν0 !β(k) d (ˆn) Bν \u0010 T (k) d (ˆn) \u0011 , (2.2) such that it matches the total dust emission of the Planck GNILC intensity and polarization maps at 353 GHz [41]. Galactic synchrotron emission is simulated using the PySM s1 model, which assumes a power- law SED in brightness temperature units [42] Xs(ˆn, ν) = Xs(ˆn, νs)  ν νs !βs(ˆn) , (2.3) – 4 – where βs is the synchrotron spectral index, varying with the position ˆn in the sky. Xs(ˆn, νs) represents the synchrotron template at a reference frequency νs. The chosen templates are the WMAP 9-year 23- GHz Q and U maps [43], smoothed with a Gaussian kernel of FWHM 5◦, with small-scale fluctuations added using the procedure outlined in [36]. The synchrotron spectral index map is derived through a spectral fit to the Haslam 408-MHz data and the WMAP 23-GHz 7-year data [44]. In summary, four distinct PICO data sets, hereafter referred to as d1, d4, d7, and d12, are created by combining the respective dust model maps with the PySM s1 synchrotron maps and the random realizations of CMB and instrumental noise. For each data set, 50 simulations are generated, each featuring distinct realizations of CMB and instrumental noise. All maps are generated at the HEALPix resolution Nside = 512, and the resulting PICO frequency maps are smoothed to a common resolution of FWHM = 38′ before undergoing component separation analysis. 3 Diagnosis of foreground complexity with GNILC The complex properties of the polarized Galactic foregrounds at microwave frequencies are not yet fully understood at the anticipated sensitivity levels of future CMB experiments. It has also been shown that any slight mismodelling of the foregrounds can strongly bias the estimated tensor-to- scalar ratio due to huge amplitude discrepancies between foregrounds and CMB B-modes [28]. Fur- thermore, the integration of foreground emission along the line-of-sight and within the beam by CMB instruments leads to spatial averaging of each foreground spectral parameter, which results in spec- tral distortions of the expected foreground SEDs [26, 45] and spectral decorrelation of the foreground emission across frequencies [25, 27]. Additional spectral averaging occurs during data processing steps such as spherical harmonic transforms. All these processes effectively augment the list of ex- pected foreground parameters, adding further complexity to the modelling of the foregrounds. While these effects are small compared to the amplitude of the foreground emission, they can be large com- pared to the amplitude of the primordial CMB B-mode polarization, hence can no longer be neglected for accurate component separation. To avoid making incorrect assumptions about the number of foregrounds and their spectral properties, it is useful to adopt a data-driven approach which can inform us on the actual complexity of foregrounds in sky observations. The Generalized Needlet ILC (GNILC) method [32, 46] of- fers an avenue, by providing maps of the effective number of independent foreground components across the sky and different angular scales as byproducts, based on the experiment’s sensitivity and frequency coverage. These GNILC byproduct maps, revealing the effective dimension of the fore- ground subspace, can in turn inform the Constrained Moment ILC (cMILC) method [23] about the optimal number of nulling constraints or moments to deproject without incurring significant noise penalty, depending on the sky area and the range of angular scales. Besides, parametric component separation methods may also benefit from these diagnostic maps to gauge the expected volume of the foreground parameter space depending on the sky regions. 3.1 Methodology Instead of making spectral assumptions, GNILC relies on statistical decorrelation to estimate the number of independent foreground degrees of freedom and perform component separation. It cap- italizes on the fact that while the noise is largely uncorrelated across frequencies, the foreground emission, fν(ˆn), remains strongly correlated, such that it can be decomposed, at any frequency ν, onto a common basis of a few independent templates {ti(ˆn)}i∈[1,m]: fν(ˆn) = m X i=1 αν,i(ˆn) ti(ˆn) , (3.1) – 5 – where the number m of independent templates is typically smaller than the number of frequency channels. The effective number m of these independent templates may vary depending on local signal-to-noise variations across the sky and angular scales. The focus is on mapping this number m rather than the templates themselves to provide insight into the complexity of the foreground sky. In polarization, we can assume that data at different frequencies, dν, are the superposition of three distinct types of components: dν(ˆn) = c(ˆn) + fν(ˆn) + nν(ˆn) , (3.2) where (assuming CMB temperature units) c(ˆn) denotes frequency-independent CMB anisotropies, fν(ˆn) is the Galactic foreground emission, nν(ˆn) the instrumental noise, and ν = 1, . . . , Nν, with Nν the number of available frequency channels. From Equation 3.2, the elements of the Nν × Nν data covariance matrix for frequency pairs (ν, ν′) read as Cνν′(ˆn) = ⟨dν(ˆn) dν′(ˆn)⟩ = CCMB νν′ (ˆn) + Fνν′(ˆn) + Nνν′(ˆn) , (3.3) where CCMB, F, and N denote respectively the CMB, foreground, and noise covariance matrices. In Equation 3.3 we fairly assume that the three components are statistically uncorrelated. In practice, the ensemble average of Equation 3.3 is substituted with a sample average: Cνν′(ˆn) = X ˆn′ W \u0000ˆn, ˆn′\u0001 dν \u0000ˆn′\u0001 dν′ \u0000ˆn′\u0001 , (3.4) where W (ˆn, ˆn′) are the weights associated to a Gaussian convolution kernel centred at ˆn, with a standard deviation large enough to sample an adequate number of modes. Considering that our focus is on Galactic foregrounds, we rewrite Equation 3.3 as C(ˆn) = F(ˆn) + CN(ˆn) , (3.5) where CN is the nuisance covariance matrix collecting the contribution from CMB and instrumental noise covariance matrices. Unlike the foreground covariance matrix, the nuisance covariance matrix can be estimated from simulations based on the knowledge of the instrument and the CMB statistics. The estimated nuisance covariance matrix, ˆCN(ˆn), is then used as an input of the GNILC pipeline to compute the whitened data covariance matrix: ˜C(ˆn) = \u0010 ˆC−1/2 N C ˆC−1/2 N \u0011 (ˆn) ≃ \u0010 ˆC−1/2 N F ˆC−1/2 N \u0011 (ˆn) + 1 , (3.6) where the last equality follows from Equation 3.5 and is exact if the estimated nuisance covariance matrix perfectly captures the statistics of the CMB and noise components, and 1 denotes the identity matrix. Therefore, the eigendecomposition and diagonalization of the whitened data covariance matrix must have the following structure: ˜C(ˆn) ≃ \u0010 UF(ˆn) | UN(ˆn) \u0011  λ1(ˆn) + 1 ... λm(ˆn)(ˆn) + 1 1 ... 1   UF(ˆn)T UN(ˆn)T ! , (3.7) – 6 – where all eigenvalues significantly greater than one correspond to the independent eigenmodes of the Galactic emission which locally dominate over the variance of the noise and CMB components. Therefore, in each point of the sky ˆn, we are able to estimate the number of independent Galac- tic foreground modes, m(ˆn), given the sensitivity of the considered experiment through this model- independent approach where we only need to assume the two-point statistics of the noise and CMB components in the polarization data. The m independent foreground eigenmodes are simply collected in the Nν × m matrix UF. We note that, in the above treatment, we considered the CMB as a nuisance whose covariance matrix can be predicted. This may not be exactly the case at large angular scales for CMB B-modes since the value of the tensor-to-scalar ratio r is unknown. However, this issue can be addressed by considering only the noise in the nuisance covariance matrix (CN = N), in which case our method outputs the number of independent modes from both foregrounds and CMB that dominate over the noise: m(ˆn) = mfgds(ˆn) + mCMB(ˆn) , (3.8) with mCMB(ˆn) = 0 or 1, as the CMB is fully correlated between frequencies. Given the sensitivity of future CMB experiments, we expect the lensing CMB B mode signal to dominate over instrumental noise across the range of observed angular scales (see e.g. figure 1 of [30]). Therefore, m(ˆn) = mfgds(ˆn) + 1 . (3.9) The GNILC approach thus allows one to perform a blind diagnosis of the complexity of the Galactic foreground emission in the observed sky and to possibly compare it with that expected from various foreground models. 3.2 Needlet frame implementation We expect the ’foregrounds-to-noise’ ratio, as traced by the whitened covariance matrix ˜C(ˆn) (Equa- tions 3.6 and 3.7), to vary not only across the sky but also across angular scales. Most likely, mfgds will be higher at large angular scales where diffuse Galactic emission is brighter than CMB and noise by orders of magnitude, while it will be lower at small angular scales where the noise dominates the covariance budget. This reasoning supports an implementation of our diagnostic tool in wavelet do- main. The GNILC pipeline has been developed in a framework of specific spherical wavelets called needlets [47, 48]. In such a framework, the data dν(ˆn) are convolved by a set of needlet bandpass filters in harmonic domain in order to form needlet coefficient maps, βj ν(ˆn), including sky emission from specific ranges of angular scales: β j ν(ˆn) = X ℓ,m \u0010 aℓm,ν bj ℓ \u0011 Yℓm(ˆn) , (3.10) where aℓm,ν are the spherical harmonic coefficients of the frequency maps dν(ˆn), b j ℓ is the jth needlet bandpass, and Yℓm(ˆn) are spherical harmonics. In this work, we employ cosine-shaped needlet bandpasses defined as bj ℓ =  cos   ℓ j peak − ℓ ℓ j peak − ℓ j−1 peak π 2 ! if ℓ j−1 peak ≤ ℓ < ℓ j peak cos   ℓ − ℓ j peak ℓ j+1 peak − ℓ j peak π 2 ! if ℓ j peak ≤ ℓ < ℓ j+1 peak , (3.11) – 7 – 3 5 10 50 100 200 500 0.0 0.2 0.4 0.6 0.8 1.0 bj Figure 1. Cosine needlet bandpass windows in harmonic domain used in this work. where ℓpeak = 0, 50, 100, 200, 300 for j = 1, . . . , 5. These needlet bandpasses in harmonic domain are plotted in Figure 1, with each of them covering a specific range of multipoles. By construction, these needlet bands satisfy P j(bj ℓ)2 = 1 for all multipoles, so that the inverse needlet transform dν(ˆn) = X j X ℓ,m b j ℓ \u0010 aℓm,ν bj ℓ \u0011 Yℓm(ˆn) (3.12) retrieves the initial data. Since the needlet bands have compact support in harmonic domain, the needlet coefficient maps, β j ν(ˆn), are obtained at a HEALPix Nside equal to the smallest power of 2 larger than ℓ j max/2, where ℓ j max is the maximum multipole of the jth needlet band. The methodology presented above is applied to the multifrequency needlet coefficient maps, β j ν(ˆn), instead of the original sky maps, dν(ˆn). The data and nuisance covariance matrices, C j(ˆn) and C j N(ˆn) of Equation 3.5, are thus computed separately for each range of angular scales selected by the needlet bands. This implementation allows us to produce maps of the number of independent foreground modes, m j fgds(ˆn), across the sky and in different ranges of angular scales. 3.3 Diagnostic maps We perform our GNILC diagnosis on the simulated PICO d1, d4, d7, and d12 data sets, each rep- resenting different foreground scenarios detailed in Section 2. In this analysis, the CMB signal is considered part of the nuisance budget of GNILC, allowing us to estimate the number, mfgds, of in- dependent degrees of freedom associated with Galactic emission detectable by a telescope like PICO for each foreground scenario. We perform this diagnosis for both E- and B-modes, presenting results for the baseline realization nsim = 0, although similar conclusions can be drawn for other realizations. – 8 – mfgds d1s1 (E) 1 5 mfgds d1s1 (B) 1 5 mfgds d4s1 (E) 1 5 mfgds d4s1 (B) 1 5 mfgds d7s1 (E) 1 5 mfgds d7s1 (B) 1 5 mfgds d12s1 (E) 1 5 mfgds d12s1 (B) 1 5 Figure 2. Maps of the detected number, m j fgds, of independent foreground E-mode components (left) and B- mode components (right) at needlet scale j = 5. The results are shown for four distinct foreground scenarios, d1 (first row), d4 (second row), d7 (third row), and d12 (fourth row), and they reveal varying degrees of complexity. These diagnostic maps, which partition the sky into clusters of uniform foreground complexity, were generated using the GNILC methodology outlined in Section 3, applied to full-sky frequency maps of PICO E- and B-modes. – 9 – Maps of m j fgds(ˆn) for the fifth needlet scale (j = 5) are shown in Figure 2 for the four distinct data sets (d1, d4, d7, and d12). They provide the effective number of independent foreground com- ponents detected across the sky in both in E- and B mode fields at this scale, thereby partitioning the sky into clusters of uniform foreground complexity. These diagnostic maps reveal different degrees of complexity across the sky depending on the underlying foreground scenario, even though all con- sidered foreground models are consistent with Planck observations. In particular, d12 and d1 models exhibit a larger number of independent foreground modes detected across more extensive sky regions compared to d4 and d7 models, with indications of higher complexity for d12. These results hold for both E- and B-modes. The effective lower complexity of d4 with two MBB components for dust compared to the single-MBB d1 model, is attributed to the absence of spatial variations of each MBB spectral index in d4. The highest level of complexity detected for d12 can be attributed to the multi- layer structure of the dust emission in this model. Therefore, with high polarization sensitivity, as in the case of PICO, our approach offers a reliable tool for discriminating between different foreground models. Moreover, the observed decrease in the effective number of independent foreground modes towards high Galactic latitudes aligns with the spatial extent of Galactic emission in the sky and the prevalence of noise in the data at these latitudes. In E-modes, we also observe larger values of mfgds than in B-modes over larger regions of the sky. This discrepancy arises from the foreground E/B ratio, which exceeds 2. However, this trend is partially compensated by the even higher CMB E/B ratio, mitigating the discrepancy between E- and B-modes concerning the number of independent foreground modes. In Table 1 we report the excursion set of mfgds observed in the four PICO data sets at the five different needlet scales. For each value, the corresponding sky fraction is also reported in parenthe- ses. As expected, the effective number of independent degrees of freedom of the Galactic emission decreases towards smaller angular scales, where the foreground power decreases while the CMB and noise have relatively larger power. Differences among the four data sets are noticeable. The d1 and d12 data sets exhibit larger values of mfgds at the largest angular scales and over larger portions of the sky at intermediate and small angular scales, both in E- and B-modes. Compared to other data sets, the d12 data set, which incorporates multilayer dust emission, exhibits higher complexity in broader regions of the sky for all needlet scales. Again, in general, higher values of mfgds are found on larger portions of the sky for E-modes. By diagnosing the number of independent modes of the Galactic foreground emission above the noise level, the blind approach outlined in this section can be leveraged to enhance the optimization of CMB component separation. In the following, we exploit this information to optimize the selection of deprojected moments for the Galactic foregrounds within the framework of the semi-blind cMILC component separation method. Besides, the distribution of mfgds values has the potential to inform parametric component separation methods on the expected dimension of the parameter space for the foreground model to be fitted in specific sky regions and at particular angular scales, minimizing the impact of significant statistical uncertainty in the reconstructed maps of different components. 4 The optimized cMILC (ocMILC) method 4.1 Baseline cMILC approach As demonstrated in [23], although the blind NILC method provides the CMB solution with mini- mum overall variance, it does not achieve minimum foreground variance. This minimum foreground variance can be attained through the more constrained semi-blind cMILC method, which involves the deprojection of certain foreground components. Achieving minimum foreground variance is essential to alleviate systematic biases in the recovered tensor-to-scalar ratio, especially in cases where residual – 10 – Table 1. Number mfgds of independent modes characterizing Galactic foreground emission, as de- tected by GNILC within each needlet band, for the PICO baseline configuration and four distinct foreground scenarios. The results are presented separately for E-modes (top table) and B-modes (bottom table). In cases where multiple values are observed, the corresponding sky fraction (in per- centage) associated with each value of mfgds is provided in parentheses. E-modes Model mfgds (fsky(%)) j = 1 j = 2 j = 3 j = 4 j = 5 d1s1 6 5 (97), 6 (3) 3 (3), 4 (81), 5 (16) 3 (36.8), 4 (63), 5 (0.2) 1 (0.5), 2 (30.3), 3 (46.2), 4 (23) d4s1 5 4 (1.2), 5 (98.8) 3 (54), 4 (31), 5 (15) 3 (82), 4 (18) 1 (2), 2 (30), 3 (63), 4 (5) d7s1 5 5 3 (13), 4 (71), 5 (16) 3 (62), 4 (37.9), 5 (0.1) 2 (31.3), 3 (67), 4 (1.7) d12s1 6 5 (11), 6 (89) 4 (70), 5 (26), 6 (4) 3 (18), 4 (80), 5 (3) 1 (1), 2 (27.8), 3 (26.5), 4 (44.5), 5 (0.2) B-modes Model mfgds (fsky(%)) j = 1 j = 2 j = 3 j = 4 j = 5 d1s1 6 4 (13), 5 (87) 3 (4), 4 (95), 5 (1) 2 (11.5), 3 (28), 4 (60.5) 1 (0.7), 2 (68), 3 (16.3), 4 (15) d4s1 5 4 (16), 5 (84) 3 (59), 4 (40), 5 (1) 2 (12), 3 (72), 4 (16) 1 (3), 2 (67), 3 (25.5), 4 (4.5) d7s1 5 4 (13), 5 (87) 3 (17), 4 (82), 5 (1) 2 (12), 3 (53), 4 (35) 2 (71.5), 3 (27), 4 (1.5) d12s1 6 (82), 7 (18) 5 (17), 6 (83) 4 (77), 5 (23) 2 (9), 3 (15.3), 4 (75), 5 (0.7) 1 (2), 2 (51), 3 (20.4), 4 (26.6) foreground contamination after component separation surpasses the CMB and noise power at large angular scales. Such unfavourable outcome was observed in the case of NILC for the multi-layer dust scenario with PICO [30] and for less complex foreground skies in experimental configurations with narrower frequency coverage [31]. Galactic emission exhibits three-dimensional characteristics [25], extending along the line of sight, and its spectral parameters vary spatially both along and across the lines of sight. When in- tegrated along the line of sight and within the instrumental beam by CMB instruments, the super- position of emitting elements with varying spectral parameters results in spectral distortions of the baseline SEDs of the Galactic components. As demonstrated in the seminal work of [26], these fore- ground distortions can be accurately captured through a Taylor moment expansion of the baseline SEDs around pivot values of the spectral parameters. Foreground subtraction can then be enhanced by deprojecting certain moments of the Galactic foreground emission from the output CMB solution, a technique introduced by the cMILC method [23]. Referring to Equation 2.3, the Galactic synchrotron emission can be expanded around a baseline power-law SED up to second order in βs(ˆn) as: Xs(ˆn, ν) = Xs(ˆn, νs) \" fsync(ν, ¯βs) + \u0010 βs(ˆn) − ¯βs \u0011 ∂βs fsync(ν, ¯βs) + 1 2 \u0010 βs(ˆn) − ¯βs \u00112 ∂2 βs fsync(ν, ¯βs) + O \u0012\u0010 βs(ˆn) − ¯βs \u00113\u0013 # , (4.1) where fsync(ν, ¯βs) =  ν νs !¯βs (4.2) – 11 – is a power-law with fixed pivot spectral index ¯βs. Equation 4.1 highlights moments of the synchrotron spectral index, (βs(ˆn) − ¯βs)k, with uniform SEDs ∂k βs fsync(ν, ¯βs). Similarly, from Equation 2.1, the moment expansion of the thermal dust emission around a baseline MBB SED up to second order reads as: Xd(ˆn, ν) = Xd(ˆn, νd) \" fdust(ν, ¯βd, ¯Td) + \u0010 βd(ˆn) − ¯βd \u0011 ∂βd fdust(ν, ¯βd, ¯Td) + \u0010 Td(ˆn) − ¯Td \u0011 ∂Td fdust(ν, ¯βd, ¯Td) + 1 2 \u0010 βd(ˆn) − ¯βd \u00112 ∂2 βd fdust(ν, ¯βd, ¯Td) + \u0010 βd(ˆn) − ¯βd \u0011 \u0010 Td(ˆn) − ¯Td \u0011 ∂βd∂Td fdust(ν, ¯βd, ¯Td) + 1 2 \u0010 Td(ˆn) − ¯Td \u00112 ∂2 Td fdust(ν, ¯βd, ¯Td) + O \u0012\u0010 βd(ˆn) − ¯βd \u00113 , \u0010 Td(ˆn) − ¯Td \u00113\u0013 # , (4.3) where fdust(ν, ¯βd, ¯Td) =  ν νd !¯βd+1 exp \u0010 hνd/k ¯Td(ˆn) \u0011 − 1 exp \u0010 hν/k ¯Td(ˆn) \u0011 − 1 (4.4) is the MBB function for data in brightness temperature units, with fixed pivot values of the spectral index and temperature ¯βd and ¯Td. We assume the observed averages of spectral parameters across the sky as pivot values to ensure that most of the Galactic emission projects onto the zeroth-, first-, and second-order moments of the expansion: ¯βs ≃ −3 [41, 44, 49, 50], ¯βd ≃ 1.5, and ¯Td ≃ 20 K [41]. However, further refinement of the most suitable pivot values for spectral parameters could be achieved by considering the observed average in the sky area outside the Galactic mask used in the analysis or by requiring the cancellation of first-order moments in the average [51]. The cMILC weights are built to deproject some of these foreground moments by adding to NILC nulling constraints against their homogeneous SEDs, while the remaining unconstrained con- tamination is left to blind variance minimization:  minw \u0010 wTC w \u0011 wT · aCMB = 1 wT · f sync(¯βs) = 0 wT · ∂βs f sync(¯βs) = 0 wT · f dust(¯βd, ¯Td) = 0 wT · ∂βd f dust(¯βd, ¯Td) = 0 wT · ∂Td f dust(¯βd, ¯Td) = 0 ... , (4.5) where w = {w j ν(ˆn)} represents the vector of frequency-dependent, pixel-dependent, and scale-dependent cMILC weights, C = {C j νν′(ˆn)} denotes the data covariance matrix with the same dependencies as the weights, ∂kβd∂nTd f dust(¯βd, ¯Td) = {∂k βd∂n Td fdust(ν, ¯βd, ¯Td)} and ∂kβs f sync(¯βs) = {∂k βs fsync(ν, ¯βs)} are the frequency-dependent but pixel-independent dust and synchrotron moment SEDs, and aCMB = {aCMB,ν} stands for the CMB SED, which is independent of frequency in CMB temperature units. The number of nulling constraints on moments in Equation 4.5 is only limited by the number of available frequency channels and the sensitivity of the experiment. – 12 – By collecting the SED vectors of the CMB and selected foreground moments into the mixing matrix A = \u0010 aCMB f sync(¯βs) f dust(¯βd, ¯Td) ∂βd f dust(¯βd, ¯Td) . . . \u0011 and the deprojection coefficients into the vector: e = (1 0 0 0 . . .)T , (4.6) the cMILC weights can be expressed in the compact form: w = eT h ATC−1 A i−1 ATC−1 . (4.7) The cMILC method, initially introduced in [23], has since been applied in various subsequent works [31, 52–56]. In such a framework, NILC represents simply a subcase of cMILC where only the first element of e and first column of A are employed in Equation 4.7. Adding constraints to null some of the foreground moments and, thereby, remove systematic biases generally results in an increase of the variance of the noise and unconstrained foreground components, such as non-included higher-order moments. There is thus a trade-off between depro- jection and blind variance minimization, where components that significantly contribute to the overall variance in the data may be better suited for variance minimization rather than deprojection. How- ever, in the baseline cMILC approach, there is no inherent procedure for selecting which moments should be prioritized for deprojection and which ones should be left for variance minimization. To illustrate some limitations of the baseline cMILC approach, we applied both NILC and cMILC pipelines to different PICO data sets as discussed in Section 2, using the needlet frame im- plementation presented in Section 3.2. For each data set, we considered 50 simulations with dis- tinct random realizations of the CMB and instrumental noise, and we implemented three versions of cMILC: 1. cMILC-0, where all zeroth-order moments are deprojected. 2. cMILC-01, where all zeroth- and first-order moments are deprojected. 3. cMILC-012, where all zeroth-, first-, and second-order moments are deprojected. In all cases, the pivot values of the spectral parameters were held fixed to their average across the sky in the PySM d1s1 model: ¯βs = −3, ¯βd = 1.54, and ¯Td = 19.6 K. Foreground and noise residuals are calculated by applying the NILC and cMILC weights de- rived from the specified data set to the foreground and noise inputs of that simulation, serving il- lustrative purposes. Throughout this paper, to alleviate residual foreground contamination along the Galactic plane, the angular power spectra for d1, d4, and d7 are computed over fsky = 70% of the sky using the publicly available Planck GAL70 mask applied to the maps. For d12, a more conservative masking strategy is employed, by extending the Planck GAL70 mask through smoothing the average d12 foreground residuals with a 5◦ beam and thresholding them to achieve a final sky fraction of fsky = 40%. Although the d12 mask is constructed from foreground residuals that may not be ac- cessible in real data analysis, it is employed solely for comparing outcomes from different pipelines within the same clean 40% region of the sky. The angular power spectra are computed using the py- master Python package2 of the MASTER estimator [57, 58], which facilitates proper deconvolution of masking and beam smoothing effects [59]. 2https://namaster.readthedocs.io/en/latest/ – 13 – 5 10 50 100 200 500 10 9 10 7 10 5 10 3 10 1 CBB [ K2] d1, fsky=70% NILC cMILC-0 cMILC-01 cMILC-012 foregrounds noise CMB input r [0.4 10 3, 4 10 3] 5 10 50 100 200 500 10 9 10 7 10 5 10 3 10 1 CBB [ K2] d7, fsky=70% NILC cMILC-0 cMILC-01 foregrounds noise CMB input r [0.4 10 3, 4 10 3] Figure 3. Angular power spectra of foreground (solid) and noise (dashed) residuals in B-modes resulting from the application of NILC (blue), cMILC-0 (orange), and cMILC-01 (green) to PICO d1 (left) and d7 (right) data sets. For the d1 case, results of cMILC-012 (red) are also presented. All the power spectra are binned with ∆ℓ = 5 and computed over 70% of the sky. The grey shaded area denotes the range of primordial tensor CMB B-mode power spectra corresponding to tensor-to-scalar ratio values r ∈ [0.0004, 0.004]. The results for PICO data sets d1 and d7 are reported in Figure 3, showing the angular power spectra of foreground and noise residuals when applying NILC, cMILC-0, cMILC-01, and cMILC- 012. Residuals from the most constrained version cMILC-012 are exclusively shown for the d1 data set. The comparison is made against the primordial CMB B-mode signal across a range of tensor- to-scalar ratio values, r ∈ [0.4 × 10−3, 4 × 10−3], where r = 0.4 × 10−3 represents the actual upper bound at 95% CL targeted by PICO for its baseline instrumental configuration, as adopted in this work (refer to Section 2 for details on rescaling PICO CBE to baseline sensitivity). The results from Figure 3 lead to several conclusions. For the PICO d1 data set, the cMILC foreground residuals are lower than those of NILC at intermediate and small angular scales. How- ever, on the largest angular scales, the averaging processes significantly distort the foreground SEDs, and the rigid cMILC deprojection fails to adequately suppress these low-ℓ distortions of the Galactic emission compared to simple variance minimization. As previously demonstrated in [23], imposing the deprojection of more moments in Equation 4.5 results in a penalty to the residual noise bud- get. This is particularly noticeable when examining the residuals from the application of cMILC-012 (where all zeroth-, first-, and second-order moments are deprojected) to the PICO d1 data set: the CMB solution, derived from the linear combination of 21 frequency channels with nine fully depro- jected moments, suffers from a significant increase in noise contamination. Therefore, a compromise in the optimal number of moments to deproject must be found. Moreover, in this baseline cMILC ap- proach, the moments have been projected out in the natural order of the expansion. However, there is no a priori reason to filter out lower-order moments first in the context of minimum-variance method- ologies. It may be more effective to leave some major low-order contributions for blind variance minimization, as they are anyway prevailing in the budget of the observed data covariance matrix of Equation 3.3. When considering PICO maps with different dust models, such as d7 (right panel), the cMILC foreground residuals might even appear brighter compared to NILC in some cases (cMILC- 01), indicating that the employed moment deprojection may not entirely capture the actual deviations of the dust model from the MBB SED. These results suggest that there is room for optimization of the moment deprojection in the cMILC method, as anticipated and preliminarily explored in [23]. This optimization could be tackled in four ways: (i) allowing the number of deprojected moments to vary across sky regions and multi- pole ranges based on information from GNILC diagnostic maps (Section 3); (ii) selecting moments – 14 – for deprojection independently of the natural order of the expansion; (iii) allowing the pivot values to vary across sky regions and multipole ranges to reduce the significance of higher-order moments in the moment expansion; (iv) partially filtering out the contribution of specific moments by modifying the deprojection vector in Equation 4.6 as follows: e = (1 ϵ1 ϵ2 ϵ3 . . .)T , (4.8) with |ϵi| < 1. This last adjustment aims to strike a balance between reducing bias and increasing noise variance, drawing inspiration from [60]. 4.2 Optimization of moment deprojection In this section, we present the ocMILC (optimized cMILC) method, an improved version of cMILC, which optimizes moment deprojection and variance minimization by leveraging information from GNILC diagnostic maps regarding expected foreground complexity (Section 3). The method is fully data-driven. The first stage in the ocMILC pipeline involves conducting the GNILC diagnosis to determine how many independent modes of the Galactic emission have greater power than noise across the sky and angular scales. For each range of angular scales (needlet scale j), this provides a partitioning of the sky into clusters of uniform dimension, m j fgds, of the expected foreground subspace. Each cluster of the partition, as illustrated in Figure 2, offer constraints on the optimal number of mo- ments to deproject in that region of the sky and range of angular scales without incurring significant noise penalty. In ocMILC, this information is fully leveraged, and only m(j) fgds(ˆn) moments are fil- tered out at pixel ˆn and needlet scale j. For B-mode diagnosis, the nuisance covariance matrix CN (Equation 3.5) in GNILC is derived from instrumental noise simulations but does not include CMB, as the tensor-to-scalar ratio (and consequently, the CMB covariance) is unknown a priori. There- fore, one of the independent modes identified by GNILC is attributed to CMB (Equation 3.9), and m j fgds(ˆn) = m j fgds+CMB(ˆn) − 1 moments are deprojected by ocMILC in each region. Once the optimal number of nulling constraints to deproject moments is determined in each GNILC region and needlet scale, ocMILC selects the optimal configuration of m j fgds moments, pivot values, and deprojection coefficients among the following sets of 1. moment SEDs: h fdust, fsync, ∂βd fdust, ∂βs fsync, ∂Td fdust, ∂2 βd fdust, ∂βd∂Td fdust, ∂2 βs fsync, ∂2 Td fdust i , (4.9) 2. dust pivot parameter values: ¯βd ∈ [1.2, 1.8] with ∆¯βd = 0.05, ¯Td ∈ [17 K, 22 K] with ∆ ¯Td = 0.25, (4.10) 3. and deprojection values: ϵk ∈ [−0.05, −0.01, −0.005, −0.001, −0.0005, 0., 0.0005, 0.001, 0.005, 0.01, 0.05]. (4.11) The optimal combination of moments, pivots, and deprojection coefficients is determined so as to minimize the cMILC output variance corrected for residual noise variance in each GNILC cluster: ⟨c2 cMILC⟩ − ⟨n2 res⟩ = wT cMILC (C − N) wcMILC , (4.12) where C represents the data covariance matrix and N denotes the instrumental noise covariance ma- trix. The GNILC partitioning of the sky into clusters of pixels characterized by uniform foreground – 15 – 5 10 50 100 200 500 10 9 10 7 10 5 10 3 10 1 CBB [ K2] d7, fsky=70% NILC ocMILC-v0 ocMILC-v1 ocMILC-v2 ocMILC foregrounds noise CMB input r [0.4 10 3, 4 10 3] Figure 4. Angular power spectra of foreground (solid) and noise (dashed) residuals over fsky = 70% of the sky resulting from the application of NILC (blue), ocMILC-v0 (cyan), ocMILC-v1 (red), ocMILC-v2 (green), and ocMILC (magenta) to the PICO d7 B-mode data set. This illustrates the progressive improvement in residuals achieved by combining several layers of optimization in ocMILC. complexity (Figure 2) is used to recalculate the local covariance matrix of the data and ocMILC weights in each cluster independently, drawing inspiration from the multiclustering strategy of [24]. The covariance matrices in Equation 4.12 and the optimization procedure are thus computed within each independent GNILC region, representing a connected set of pixels sharing the same value of mfgds. Therefore, the ocMILC CMB solution is the solution with minimum local foreground variance obtained by partially (or fully) deprojecting m j fgds moments with varying pivot parameters across the sky and angular scales. The improvement induced by combining the various layers of optimization in ocMILC, in- cluding the selection of moments and their number, pivot values, and deprojection coefficients, is demonstrated by comparing the power spectrum of ocMILC residuals with those obtained when op- timization is exclusively applied to specific layers. This comparison is performed with the following intermediate ocMILC pipelines using the example of the PICO d7 data set (similar results are ob- tained for other models): • ocMILC-v0, where optimization focuses on the number of moments, based on information from GNILC diagnostic maps, deprojecting the first mfgds moments in the natural order of the Taylor expansion (Equation 4.9); • ocMILC-v1, where optimization involves both the number and the set of moments, deproject- ing the set of mfgds moments that lead to the lowest denoised output variance (Equation 4.12); • ocMILC-v2, where optimization extends to the number of moments, set of moments, and pivot values. The comparison results, shown in Figure 4, reveal that deprojecting the first mfgds moments in the nat- ural order of the Taylor expansion (ocMILC-v0) does not improve foreground subtraction across most – 16 – 5 10 50 100 200 500 10 9 10 7 10 5 10 3 10 1 CBB [ K2] d1, fsky=70% NILC ocMILC (mfgds 1) ocMILC (mfgds) ocMILC (mfgds + 1) ocMILC (mfgds + 2) foregrounds noise CMB input r [0.4 10 3, 4 10 3] Figure 5. Angular power spectra of foreground (solid) and noise (dashed) residuals over fsky = 70% of the sky obtained from the application of NILC (blue) and ocMILC (others) to the PICO d1 B-mode data set, with variations in the number of moments deprojected compared to the number mfgds diagnosed by GNILC. The results of ocMILC are shown for four different cases, where, respectively, mfgds (magenta), mfgds − 1 (cyan), mfgds + 1 (red), and mfgds + 2 (green) foreground moments are deprojected across the sky and needlet scales. scales, especially when the dust model, like d7, deviates substantially from a MBB. In such cases, nulling constraints result in a notable penalty in residual foreground variance attributed to higher- order moments. This suggests that the mitigation of foregrounds could have been better handled if some of the low-order moments had been left for variance minimization, while the higher-order moments had been deprojected. Optimizing the choice of moments (ocMILC-v1) indeed brings im- provement, further enhanced by allowing the values of pivot parameters to vary freely (ocMILC-v2), enabling a more effective accommodation of the dust model through moment expansion. Enabling the weights to also partially deproject specific moments (ocMILC) provides additional flexibility to the blind variance minimization process, allowing for the mitigation of foreground modes not ade- quately captured by the moment expansion. This final refinement, in conjunction with the previous optimization steps, enables ocMILC to reconstruct the cleanest CMB solution among all considered intermediate pipelines for all data sets, achieving minimum foreground variance with limited noise penalty. This increased flexibility proves advantageous in effectively handling various thermal dust models through moment expansion. To validate the accuracy of the GNILC diagnosis in determining the optimal number mfgds of moments to deproject before incurring significant noise penalties, we apply ocMILC to the PICO d1 data set while imposing the deprojection of mfgds − 1, mfgds + 1, and mfgds + 2 moments in each point of the sky and for each needlet scale. The resulting angular power spectra are compared with those of NILC and the proper ocMILC, with mfgds moments deprojected, in Figure 5. The outcomes clearly demonstrate that deprojecting one or two additional moments, beyond what is suggested by the GNILC diagnosis, leads to a significant increase in residual noise. Conversely, deprojecting mfgds − 1 moments results in larger Galactic contamination on intermediate and small scales. These – 17 – results highlight the efficacy of the GNILC diagnosis in providing a data-driven assessment of the optimal number of moments for deprojection with ocMILC. 5 10 50 100 200 500 10 9 10 7 10 5 10 3 10 1 CBB [ K2] d1, fsky=70% NILC ocMILC foregrounds noise CMB input r [0.4 10 3, 4 10 3] 10 5 10 4 10 3 10 2 r 0.2 0.4 0.6 0.8 1.0 / max r=0.0003±0.0001 r < 0.0004, 95% CL 5 10 50 100 200 500 10 9 10 7 10 5 10 3 10 1 CBB [ K2] d4, fsky=70% NILC ocMILC foregrounds noise CMB input r [0.4 10 3, 4 10 3] 10 5 10 4 10 3 10 2 r 0.2 0.4 0.6 0.8 1.0 / max r=7e-05±6e-05 r < 0.0002, 95% CL 5 10 50 100 200 500 10 9 10 7 10 5 10 3 10 1 CBB [ K2] d7, fsky=70% NILC ocMILC foregrounds noise CMB input r [0.4 10 3, 4 10 3] 10 5 10 4 10 3 10 2 r 0.2 0.4 0.6 0.8 1.0 / max r=6e-05±6e-05 r < 0.0003, 95% CL 5 10 50 100 200 500 10 9 10 7 10 5 10 3 10 1 CBB [ K2] d12, fsky=40% NILC ocMILC foregrounds noise CMB input r [0.4 10 3, 4 10 3] 10 5 10 4 10 3 10 2 r 0.2 0.4 0.6 0.8 1.0 / max r=0.0005±0.0003 r < 0.0015, 95% CL Figure 6. Left: Angular power spectra of foreground (solid) and noise (dashed) B-mode residuals obtained from the application of NILC (blue) and ocMILC (magenta) to PICO d1 (top), d4 (second row), d7 (third row), and d12 (bottom) data sets. Power spectra have been computed over fsky = 70% of the sky for models d1, d4, and d7, and over fsky = 40% of the sky for model d12. Right: Posterior distributions of the recovered tensor-to-scalar ratio for both pipelines. In all plots, the grey shaded area represents the range of values of the tensor-to-scalar ratio: r ∈ [0.0004, 0.004]. – 18 – The full ocMILC pipeline, integrating all layers of optimization, has been applied to all PICO B-mode data sets, encompassing diverse foreground scenarios outlined in Section 2. The angular power spectra of ocMILC residuals are compared with those of NILC for all foreground scenarios in Figure 6. For the d1, d4, and d7 models, ocMILC yields significantly lower foreground residuals across all angular scales compared to NILC, with only a moderate increase in noise contamination relative to NILC. These improvements in terms of residual foreground contamination, regardless of the foreground model, can be attributed to the several layers of optimization in ocMILC: multiclus- tering from GNILC, varying number and set of deprojected moments, varying pivot parameters, and varying deprojection coefficients, across the sky and angular scales. For the most challenging fore- ground model d12, which includes multi-layer dust components along the line-of-sight and spectral decorrelation [29], the reduction of residual foreground contamination is more modest than in other foreground scenarios but still outperforms NILC across angular scales overall. Across all the consid- ered data sets, the reduced residual foreground contamination of the ocMILC CMB B-mode solution is achieved with only a moderate noise penalty relative to NILC, thanks to the information provided by the GNILC diagnosis. These results showcase the flexibility of ocMILC in effectively handling deviations of thermal dust emission from a simple MBB through optimized moment deprojection. To further assess the quality of the CMB B-mode reconstruction, we examine the impact of NILC and ocMILC residuals on the estimation of the tensor-to-scalar ratio, r. We estimate the tensor- to-scalar ratio from the recovered B-mode power spectra using the inverse-Wishart log-likelihood [61]: log L(r) = − fsky 2ℓ + 1 2 \" ˆCℓ Cℓ(r) + logCℓ(r) − 2ℓ − 1 2ℓ + 1 log ˆCℓ # . (4.13) Here ˆCℓ = AlensClens ℓ + Cfgds ℓ + Cnoi ℓ represents the angular power spectrum of the output CMB B- mode map, averaged over all realizations, with Clens ℓ the lensing power spectrum, Al its residual amplitude after some expected level of delensing, Cfgds ℓ and Cnoi ℓ the foreground and noise residual power, while Cℓ(r) = r C r=1 ℓ + AlensClens ℓ + Cnoi ℓ represents our theoretical power spectrum model, where C r=1 ℓ is the primordial CMB B-mode power spectrum for tensor perturbations with r = 1. We adopt Alens = 0.27 to align with the expected 73% delensing capability of PICO [30]. As our simulations do not include primordial tensor perturbations, the best-fit value of r is only driven by residual foreground contamination, while its uncertainty is influenced by residual lensing, noise, and foregrounds. While the likelihood function in Equation 4.13 is not exact for a masked sky as it neglects correlations between different multipoles induced by masking, we ensure that these off- diagonal terms of the covariance matrix are negligible by binning the angular power spectrum with a constant binning scheme of ∆ℓ = 10. The resulting r-posteriors for NILC and ocMILC across the four distinct foreground scenarios are displayed in the right panels of Figure 6. Biased estimates of the tensor-to-scalar ratio (r) are reported when the value r = 0 falls outside the 68% confidence level. Notably, ocMILC, in contrast to NILC, produces unbiased posteriors for r across all considered foreground scenarios even for such large fractions of sky. This bias removal is characterized by both a shift in the distribution’s peak towards lower values of r due to reduced foreground contamination and an increase in the distribu- tion’s width due to increased noise. The biased r-distribution observed in NILC results from more pronounced residual Galactic contamination across all multipoles. While previous PICO forecasts in the literature [23, 30] demonstrated that NILC and cMILC can achieve unbiased recovery of r for a 50% sky fraction with most foreground models, our results highlight that over larger sky fractions (70%) these methods, without optimization, exhibit biases in r due to lingering foreground residuals. In contrast, ocMILC remains unbiased over such extended sky fractions for all foreground models. – 19 – 10 5 10 4 10 3 10 2 r 0.2 0.4 0.6 0.8 1.0 / max d1 r=0.0003±0.0001 r < 0.0004, 95% CL r=0.0003±0.0001 r < 0.0004, 95% CL r=0.0005±0.0001 r=0.0002±0.0002 fsky = 70% fsky = 80% fsky = 90% 10 5 10 4 10 3 10 2 r 0.2 0.4 0.6 0.8 1.0 / max d4 r=7e-05±6e-05 r < 0.0002, 95% CL r=8e-05±6e-05 r < 0.0002, 95% CL r=0.00012±7e-05 r < 0.0003, 95% CL fsky = 70% fsky = 80% fsky = 90% 10 5 10 4 10 3 10 2 r 0.2 0.4 0.6 0.8 1.0 / max d7 r=6e-05±6e-05 r < 0.0003, 95% CL r=8e-05±6e-05 r < 0.0003, 95% CL r=0.0001±6e-05 r < 0.0002, 95% CL fsky = 70% fsky = 80% fsky = 90% 10 5 10 4 10 3 10 2 r 0.2 0.4 0.6 0.8 1.0 / max d12 r=0.0005±0.0003 r < 0.0015, 95% CL r=0.0007±0.0003 r < 0.0015, 95% CL r=0.0014±0.0004 r=0.0007±0.0006 fsky = 40% fsky = 50% fsky = 60% Figure 7. Recovered posterior distributions of the tensor-to-scalar ratio obtained from NILC (blue) and ocMILC (magenta) with increasing sky fractions. The grey shaded region corresponds to the range r ∈ [0.0004, 0.004], where the lower bound (r = 0.0004) aligns with the targeted sensitivity at 95% confidence level for the adopted PICO baseline instrumental configuration. It is interesting to note that our results, along with those from [30], exhibiting poorer constraints on r for d1 and d12 compared to d4 and d7 foreground scenarios, align with the GNILC diagnosis in Section 3 which indeed revealed lower foreground complexity in the d4 and d7 data sets. For all considered Galactic models, except the intricate d12 model, ocMILC achieves upper bounds on the tensor-to-scalar ratio that align with the sensitivity targeted by PICO with the adopted baseline in- strumental configuration (r < 0.0004 at 95% CL). In Appendix A, we demonstrate on the d1 data set that ocMILC, when applied with the more sensitive PICO CBE instrumental configuration, meets the specified requirement of r < 0.0002 at 95% CL for this particular configuration. Thanks to optimized moment deprojection, ocMILC enables the observation of larger regions of uncontaminated sky compared to NILC and cMILC, without significant bias introduced by residual foregrounds. This is demonstrated in Figure 7, showing the variation of the recovered posterior on r with increasing sky fractions, ranging from fsky = 70% to 90% for d1, d4, and d7, and from fsky = 40% to 60% for d12. Across all foreground models, ocMILC consistently yields lower unbiased upper bounds on the tensor-to-scalar ratio compared to NILC, whose posteriors exhibit consistent bias at high significance across all data sets over such large sky fractions. Lastly, it is important to highlight that ocMILC successfully handles the intricate multi-layer dust model d12 [29], avoiding the residual bias reported for NILC in previous PICO forecasts [30] concerning this specific foreground model. Table 2 presents the optimal moment configurations determined by ocMILC across different sky regions and angular scales for each foreground data set. For each needlet band and GNILC cluster (sky region with uniform foreground complexity), the table includes information on the optimal num- ber and combination of moments for deprojection, along with the corresponding optimal values of deprojection coefficients and dust pivot parameters. Examining these optimal configurations allows – 20 – Table 2. Optimal configuration of moments and dust pivot parameters for deprojection, as determined by ocMILC across various sky regions and needlet scales for each foreground data set. The optimal deprojection coefficient for each moment SED is indicated in parentheses. As detailed in Section 4.2, the optimal combination of these parameters is chosen by minimizing the denoised output variance of Equation 4.12. Band mfgds d1s1 d4s1 d7s1 d12s1 j = 1 5 ¯βd = 1.75, ¯Td = 19.0; \u0002∂βd(−0.01),∂βs(0.),∂Td(0.), ∂2 βs(0.001),∂2 βdTd(0.0005)\u0003 ¯βd = 1.4, ¯Td = 17.0; \u0002fd(0.01),∂βs(0.),∂Td(0.), ∂2 βd(0.05),∂2 βs(−0.005)\u0003 6 ¯βd = 1.3, ¯Td = 17.25; \u0002fd(0.001),fs(0.),∂βs(0.), ∂Td(0.),∂2 βs(0.01),∂2 Td(0.01)\u0003 ¯βd = 1.25, ¯Td = 18.25 \u0002fd(0.),fs(0.),∂βd(−0.005), ∂βs(0.),∂Td(0.),∂2 βs(0.05)\u0003 j = 2 4 ¯βd = 1.2, ¯Td = 17.5; \u0002fs(0.),∂βs(−0.0005), ∂2 βd(0.05),∂2 βs(0.05)\u0003 ¯βd = 1.75, ¯Td = 21.5; \u0002∂βd(−0.0005),∂βs(0.0005), ∂Td(−0.001),∂2 βd(0.01)\u0003 ¯βd = 1.35, ¯Td = 21.75; \u0002 fd(0.01),∂βs(−0.001), ∂2 βs(0.),∂2 Td(0.)\u0003 5 ¯βd = 1.7, ¯Td = 21.75; \u0002fd(0.),∂βd(0.001),∂Td(0.), ∂βs(0.001),∂2 βd(0.01)\u0003 ¯βd = 1.75, ¯Td = 19.5; \u0002∂βd(−0.01),∂βs(0.),∂Td(0.), ∂2 βs(0.005),∂2 βdTd(0.0005)\u0003 ¯βd = 1.35, ¯Td = 21.5; \u0002fd(0.01),∂βs(0.), ∂2 βd(0.05),∂2 βs(0.001), ∂2 Td(0.)\u0003 ¯βd = 1.7, ¯Td = 17.5 \u0002fs(−0.0005),∂βs(0.001), ∂Td(0.), ∂2 βd(−0.0005), ∂2 βs(0.05)\u0003 j = 3 3 ¯βd = 1.5, ¯Td = 19.0; \u0002fs(−0.001),∂Td(0.), ∂2 βs(0.05)\u0003 ¯βd = 1.45, ¯Td = 17.0; \u0002∂βd(−0.01),∂βs(−0.001), ∂Td(0.)\u0003 ¯βd = 1.45, ¯Td = 21.0; \u0002fs(0.001),∂Td(0.), ∂2 βdTd(0.0005)\u0003 4 ¯βd = 1.65, ¯Td = 17.25; \u0002∂βd(0.001),∂βs(0.005), ∂2 βs(0.05), ∂2 Td(0.)\u0003 ¯βd = 1.45, ¯Td = 21.75; \u0002∂βd(−0.01),∂βs(0.005), ∂2 βs(0.05),∂2 Td(0.)\u0003 ¯βd = 1.4, ¯Td = 20.0; \u0002∂βs(0.001),∂Td(0.), ∂2 βdTd(0.0005),∂2 Td(0.)\u0003 ¯βd = 1.75, ¯Td = 19.25 \u0002∂βs(0.005),∂2 βd(−0.0005), ∂2 βs(0.05),∂2 βdTd(0.0005)\u0003 5 ¯βd = 1.35, ¯Td = 19.0 \u0002∂βd(−0.001),∂βs(0.01), ∂Td(0.), ∂2 βdTd(0.), ∂2 Td(0.)\u0003 j = 4 2 ¯βd = 1.2, ¯Td = 17.0; \u0002fs(−0.005),∂2 Td(0.)\u0003 ¯βd = 1.3, ¯Td = 18.25; \u0002fd(0.01),∂βs(0.005)\u0003 ¯βd = 1.65, ¯Td = 17.25; \u0002fd(−0.01), fs(−0.005)\u0003 ¯βd = 1.75, ¯Td = 21.75; \u0002∂2 βd(0.01),∂2 βdTd(−0.001)\u0003 3 ¯βd = 1.25, ¯Td = 17.75; \u0002∂βd(−0.01),∂βs(0.01), ∂2 βdTd(0.0005)\u0003 ¯βd = 1.45, ¯Td = 17.5; \u0002∂βd(−0.01),∂βs(0.005), ∂2 βdTd(0.)\u0003 ¯βd = 1.6, ¯Td = 20.25; \u0002∂βd(−0.01),∂βs(0.005), ∂2 βdTd(0.0005)\u0003 ¯βd = 1.5, ¯Td = 21.25 \u0002fs(−0.001),∂βd(−0.0005), ∂2 Td(0.)\u0003 4 ¯βd = 1.6, ¯Td = 17.75; \u0002∂βd(0.0005),∂βs(0.001), ∂Td(0.), ∂2 Td(0.)\u0003 ¯βd = 1.75, ¯Td = 20.5; \u0002∂βd(−0.001),∂βs(0.01), ∂2 βd(0.01),∂2 βdTd(−0.001)\u0003 ¯βd = 1.4, ¯Td = 19.5; \u0002∂βs(0.001),∂Td(0.), ∂2 βdTd(0.0005), ∂2 Td(0.)\u0003 ¯βd = 1.6, ¯Td = 17.0 \u0002∂βs(0.01), ∂Td(0.), ∂2 βd(0.01),∂2 βdTd(0.)\u0003 j = 5 1 ¯βd = 1.2, ¯Td = 17.0; \u0002∂2 βs(0.005)\u0003 ¯βd = 1.2, ¯Td = 17.0; \u0002fs(−0.005)\u0003 ¯βd = 1.45, ¯Td = 17.0; \u0002∂2 Td(0.)\u0003 2 ¯βd = 1.2, ¯Td = 17.0; \u0002fs(0.0005), ∂2 Td(0.)\u0003 ¯βd = 1.75, ¯Td = 17.0; \u0002fd(0.001), fs(0.0005)\u0003 ¯βd = 1.4, ¯Td = 17.0; \u0002fs(0.), ∂2 Td(0.)\u0003 ¯βd = 1.75, ¯Td = 21.75; \u0002∂βd(0.001), ∂2 βdTd(−0.001)\u0003 3 ¯βd = 1.75, ¯Td = 21.75; \u0002fs(0.001),∂βd(0.001), ∂2 Td(0.)\u0003 ¯βd = 1.4, ¯Td = 21.75; \u0002∂βd(−0.01),∂βs(0.01), ∂2 Td(0.)\u0003 ¯βd = 1.35, ¯Td = 17.0; \u0002fs(0.),∂βs(0.001), ∂2 Td(0.)\u0003 ¯βd = 1.3, ¯Td = 21.5 \u0002fs(0.0005),∂βd(−0.005), ∂2 Td(0.)\u0003 4 ¯βd = 1.55, ¯Td = 21.75; \u0002fs(−0.0005),∂βd(−0.001), ∂βs(0.001),∂2 Td(0.)\u0003 ¯βd = 1.3, ¯Td = 17.25; \u0002fs(0.0005),∂βd(−0.0005), ∂Td(0.0005), ∂2 βdTd(0.)\u0003 ¯βd = 1.6, ¯Td = 21.75; \u0002fs(−0.0005),∂βd(−0.005), ∂βs(0.005), ∂2 Td(0.)\u0003 ¯βd = 1.6, ¯Td = 17.0 \u0002∂βs(0.01),∂Td(0.), ∂2 βd(0.01),∂2 βdTd(0.)\u0003 – 21 – us to draw conclusions consistent with the discussions in previous sections: • The optimal pivot values of the spectral parameters vary for different foreground models, sky regions, and ranges of angular scales. • Higher-order moments are sometimes preferred for deprojection (e.g. d4s1), while the sub- traction of lower-order components can be effectively handled by minimum variance. • Most moments require only partial deprojection. The ranges of mfgds values derived from the GNILC diagnosis for different Galactic models and angular scales, as reported in Table 2 and used by ocMILC, are similar to those shown in Table 1. However, minor differences exist in a few cases, particularly at large and intermediate scales and for small clusters. This discrepancy arises because ocMILC and Table 2 adopt the more conservative estimate mfgds = mGNILC − 1, where mGNILC is computed considering only instrumental noise as a nuisance component, and one mode is subtracted to account for the expected CMB contribution. In contrast, Table 1 reports mfgds = mGNILC, including CMB in the nuisance term. These minor variations result from the fact that, on large and intermediate angular scales, the CMB lensing B- modes are not consistently detected across the entire sky as an independent component above the PICO noise level. This is expected, as lensing modes primarily contribute at small scales. However, these differences are negligible and do not impact the performance of the ocMILC technique. 5 Discussion The results in Section 4 demonstrated the capability of ocMILC to handle diverse dust models ef- ficiently, thanks to the optimization of moment deprojection. This was achieved by integrating in- formation from the GNILC diagnosis and optimizing the selection of moments, pivot values and deprojection coefficients across various sky regions and angular scales. In this section, our focus shifts to assessing the pipeline’s robustness against varied models of Galactic synchrotron emission, while maintaining a fixed thermal dust emission model (d1) to isolate the impact of synchrotron model variations. Additionally, we investigate the pipeline’s response to potential polarization of the anomalous microwave emission (AME). Specifically, in addition to s1, two alternative PySM synchrotron models are considered: 1. s5: This model features a power-law SED as defined in Equation 2.3, but the spectral index map from s1 has been rescaled to match the larger variability observed in S-PASS data [50]. In addition, small-scale non-gaussian anisotropies have been incorporated into the templates using the Logarithm of the Polarization Fraction Tensor (logpoltens) formalism. 2. s7: This model features a power-law SED with some curvature, Xs(ˆn, ν) = Xs(ˆn, νs)  ν νs !βs(ˆn)+Cs(ˆn) log ν νs , (5.1) where νs = 23 GHz, and the Xs(ˆn, νs) and βs maps remain consistent with those in s5, while a spatially varying curvature term Cs is introduced based on the analysis of intensity data ob- served in a patch of the ARCADE experiment [62]. As of now, there is no reported detection of AME polarization, and the most stringent upper bounds on the AME polarization fraction are at the level of 1% or lower [63–66], so that the actual – 22 – Table 3. Number mfgds of independent modes characterizing Galactic foreground emission, as de- tected by the GNILC in each needlet band for the baseline PICO configuration, as a function of the synchrotron (top panel) and AME (bottom panel) scenarios. In cases where multiple values are ob- served, parentheses indicate the corresponding sky fraction in percentage associated with each value of mfgds. B modes with different synchrotron models Model mfgds (fsky(%)) j = 1 j = 2 j = 3 j = 4 j = 5 d1s1 6 4 (13), 5 (87) 3 (4), 4 (95), 5 (1) 2 (11.5), 3 (28), 4 (60.5) 1 (0.7), 2 (68), 3 (16.3), 4 (15) d1s5 6 5 3 (4), 4 (52), 5 (44) 2 (1), 3 (38), 4 (50), 5 (11) 1 (0.7), 2 (58.5), 3 (25.5), 4 (15.3) d1s7 6 5 3 (4), 4 (52), 5 (44) 2 (1), 3 (38), 4 (50), 5 (11) 1 (0.7), 2 (59), 3 (25), 4 (15.3) B modes with AME with different polarization fractions Model mfgds (fsky(%)) j = 1 j = 2 j = 3 j = 4 j = 5 ΠAME = 0.5% 7 4 (6.4), 5 (64), 6 (29.6) 3 (4), 4 (89.5), 5 (6.5) 2 (11), 3 (28.5), 4 (60.5) 1 (3), 2 (67), 3 (25.5), 4 (4.5) ΠAME = 1% 7 5 (27.5), 6 (72.5) 3 (4), 4 (74), 5 (10.5), 6 (11.5) 2 (10), 3 (29.6), 4 (55.2), 5 (5), 6 (0.2) 2 (71.5), 3 (27), 4 (1.5) ΠAME = 2% 8 6 (81.5), 7 (18.5) 3 (4), 4 (45), 5 (24), 6 (27) 1 (0.8), 2 (62.8), 3 (19.6) 4 (14.8), 5 (2) 1 (2), 2 (51), 3 (20.4), 4 (26.6) contribution of AME to polarized emission still remains uncertain. Therefore, we explore three AME scenarios with different constant degrees of polarization across the sky: ΠAME = 0.5, 1, and 2%. The AME model from PySM corresponds to the sum of two spinning dust components based on the Commander fit of Planck temperature data [38]. The SED of the first component features a spatially anisotropic peak frequency, while the SED of the other component maintains a constant peak frequency across the sky. The polarization angles of AME are set to match those of thermal dust emission. We begin by examining the outcomes of the GNILC diagnosis for the various synchrotron and AME models in Table 3, contrasting them with those of the d1s1 data set, where the synchrotron was represented by the s1 model and AME was assumed to be unpolarized. Clearly, the number of inde- pendent foreground B-modes detected by GNILC at each needlet scale and the associated sky areas tend to increase with more complex synchrotron models and higher degrees of AME polarization. The larger variability of the synchrotron spectral index in the s5 model compared to s1 is noticeable to GNILC, particularly at intermediate and small scales ( j = 2, 3 and 4), where larger regions of the sky exhibit higher values of mfgds. In contrast, GNILC is not particularly sensitive to the spatially varying curvature of the s7 model (equation 5.1) for the frequency range and sensitivity of PICO, as the number of independent foreground modes detected remains similar for s5 and s7. Comparing the first lines of the top and bottom tables highlights that even a modest AME polarization fraction of ΠAME = 0.5% is detected by GNILC in all needlet bands for the frequency range and sensitivity of PICO. This trend persists with increasing polarization fractions (ΠAME = 1 and 2%), suggesting that higher degrees of AME polarization further enhance the effective foreground complexity across the sky and angular scales. After evaluating the effects of more complex synchrotron and AME models in the GNILC – 23 – 5 10 50 100 200 500 10 9 10 7 10 5 10 3 10 1 CBB [ K2] NILC residuals, different synchrotron models s1 s5 s7 foregrounds noise CMB input r [0.4 10 3, 4 10 3] 5 10 50 100 200 500 10 1 100 101 CBB , ocMILC/CBB , NILC s1 s5 s7 foregrounds noise 5 10 50 100 200 500 10 9 10 7 10 5 10 3 10 1 CBB [ K2] NILC residuals, different AME models AME  = 0% AME  = 0.5% AME  = 1% AME  = 2% foregrounds noise CMB input r [0.4 10 3, 4 10 3] 5 10 50 100 200 500 10 1 100 101 CBB , ocMILC/CBB , NILC AME  = 0% AME  = 0.5% AME  = 1% AME  = 2% foregrounds noise Figure 8. Left: Angular power spectra of foreground (solid) and noise (dashed) B-mode residuals over 70% of the sky resulting from NILC applied to the PICO d1 data set with varying synchrotron models (top) or varying AME polarization models (bottom). Right: Ratio of the power spectra between ocMILC and NILC for foreground (solid) and noise (dashed) B-mode residuals across different synchrotron and AME scenarios considered. diagnosis, we proceed to assess their impact on NILC and ocMILC CMB B-mode reconstruction in Figure 8. This is to determine whether there is a need to extend the optimization procedure of ocMILC to accommodate the higher complexity of synchrotron and AME polarized emissions. Indeed, despite ocMILC’s optimization including synchrotron moments, the current pipeline maintains a fixed pivot value of ¯βs = −3 for the synchrotron spectral index (Section 4.2). However, a higher variability of this parameter across the sky may necessitate optimizing the corresponding pivot values, similar to what was done for dust spectral parameters. Furthermore, the framework of moment expansion has not yet been extended to AME [26], so the current ocMILC pipeline does not attempt to deproject any AME moments, leaving them for blind variance minimization. The angular power spectra of foreground and noise residuals in the NILC CMB B-mode recon- struction under various synchrotron and AME scenarios are displayed in the left panels of Figure 8. Having a more complex synchrotron emission (s5 and s7) results in a slight increase in foreground residuals across all angular scales up to ℓ ∼ 300. However, the impact of varying synchrotron com- plexity on NILC residuals is notably less pronounced compared to the impact of varying dust models, as discussed in previous sections. Consequently, further optimization of ocMILC on the pivot values of the synchrotron spectral index is not expected to significantly enhance ocMILC results. Across all extensions of synchrotron emission considered, the ocMILC’s CMB solution with a fixed pivot of ¯βs = −3 indeed exhibits lower foreground contamination compared to NILC (top right panel), with percentage improvements similar to those obtained with the least complex model s1. In the case of the d1s5 data set, we even observe a 10% greater improvement of ocMILC over NILC at large – 24 – angular scales compared to d1s1. Additionally, the increase in noise residuals in ocMILC remains consistent across all synchrotron scenarios. The negligible impact of synchrotron curvature is antic- ipated since, as demonstrated in [23, 26], curvature is accounted for by the second-order term in the moment expansion (Equation 4.1), which is included in our optimized deprojection. These results show that, currently, with the available and foreseeable more complex synchrotron models, employ- ing a fixed pivot for the synchrotron spectral index (¯βs = −3) still yields highly effective moment deprojection with ocMILC. Concerning AME scenarios, we observe a slight increase in NILC residuals for ℓ ≲ 250 as the AME polarization fraction increases (bottom left panel of Figure 8). This indicates that the presence of a polarized AME component affects the variance minimization, given the sensitivity and frequency coverage of PICO. Examining the ratio between ocMILC and NILC residuals (bottom right panel), we find that, while the improvement achieved by ocMILC at intermediate and small angular scales (ℓ ≳ 70) slightly degrades with increasing AME polarization compared to the case without polarized AME, it remains highly significant. However, for very low multipoles (ℓ ≲ 15), ocMILC foreground residuals become comparable to or larger than NILC foreground residuals depending on the degree of AME polarization. This highlights the necessity, in such scenarios and considering the frequency coverage of PICO, of incorporating AME moments into the ocMILC pipeline in the first needlet band. We leave this extension for future investigation, noting that there is currently no clear observational evidence for such levels of polarized AME emission across the sky. 6 Conclusions The success of upcoming CMB experiments hinges on the ability to measure the primordial CMB B- mode polarization down to r ≲ 10−3 without bias to validate the inflationary scenario. This requires exquisite control of instrumental systematics and Galactic foreground subtraction. While the blind NILC method enables the reconstruction of the CMB B-mode polarization field without encountering biases from foreground mismodelling that parametric methods may face, fully blind overall-variance minimization might not always be sufficient to reduce large-scale Galactic contamination below the primordial signal, especially for the most challenging foreground scenarios, depending on the avail- able sensitivity, frequency channels, and the targeted r value. Deprojecting moments of Galactic emission with the semi-blind cMILC method theoretically allows for minimizing foreground variance rather than overall variance. However, the associated noise penalty, including the increased variance of unconstrained foreground moments, does not al- ways guarantee optimal outcomes for the most complex foreground scenarios. Specifically, deproject- ing foreground moments in the natural order of the Taylor expansion may not be optimal, particularly for the moments that dominate the overall variance, which may be better suited for blind variance min- imization. To address this trade-off, we introduced an optimized variant of cMILC, named ocMILC (Section 4), which refines the deprojection process through a data-driven approach by optimizing the number and selection of moments to deproject, as well as pivot values and deprojection coefficients. In ocMILC, the optimization of the number of moments to deproject, depending on sky areas and angular scales, relies on the GNILC diagnosis of data complexity (Section 3), which maps out the number of independent observable modes of Galactic emission, mfgds, in the given data set across the sky and at different angular scales (Figure 2 and Table 1). This diagnosis informs ocMILC on the optimal number of moments to deproject locally before paying significant noise penalties. This strat- egy is corroborated by the results obtained in Figure 5. The specific subset of moments to deproject locally is also optimized to retain some dominant moments for blind variance minimization, while selectively deprojecting higher-order moments that are not predominantly captured by covariance es- – 25 – timation. The optimization of local pivot values of the dust spectral parameters across different sky regions and ranges of angular scales allows for accommodating local moment expansions associated with local averaging processes. Finally, allowing the deprojection coefficients ϵk to be non-zero for partial deprojection of certain moments offers additional flexibility for limiting noise penalties. In addition, it allows to better handle with foreground modes not properly described by the moment expansion of a single MBB SED. The optimal pivot values, subset of moments, and deprojection coefficients are determined to minimize the denoised output variance (Equation 4.12), and hence the residual foreground variance, in each GNILC cluster. Testing on simulated PICO data demonstrated ocMILC’s superiority over NILC in reducing Galactic contamination across all angular scales and all the considered thermal dust models over large sky fractions, while maintaining noise levels within the target sensitivity for the tensor-to-scalar ratio (Figures 6-7). Furthermore, ocMILC outperformed the standard cMILC, showcasing its efficacy in handling diverse dust emission models, including the multi-layer dust model d12 with decorrela- tion, while controlling noise penalties. While current synchrotron emission models do not necessitate pivot value optimization, the inclusion of mildly polarized AME emissions may require the incor- poration of AME moments into ocMILC, a potential avenue for future exploration given the lack of observational evidence. Overall, ocMILC stands as a robust optimization for semi-blind CMB po- larization reconstruction, offering promise for application to other satellite missions like LiteBIRD [5], with potential extensions to ground-based experiments [3, 4] through appropriate E-to-B leakage corrections [67–69]. Acknowledgments We thank Marina Migliaccio and Domenico Marinucci for useful discussions. This research used resources of the National Energy Research Scientific Computing Center (NERSC), a U.S. Depart- ment of Energy Office of Science User Facility located at Lawrence Berkeley National Laboratory. AC acknowledges funding support by AASS PhD Program, ASI/LiteBIRD grant n. 2020-9-HH.0 and ASI/LiteBIRD grant CUP: F84I20000230005. AC was also supported by the InDark and Lite- BIRD INFN projects. MR thanks the Spanish Agencia Estatal de Investigaci´on (AEI, MICIU) for the financial support provided under the projects with references PID2019-110610RB-C21 and PID2022- 139223OB-C2, and acknowledges support from the CSIC programme ‘Ayuda a la Incorporaci´on de Cient´ıficos Titulares’ provided under the project 202250I159. A Results for PICO CBE sensitivities Throughout this paper, we adopted the baseline instrumental configuration of PICO, consistent with required specifications detailed in the PICO report [6], which provides an overall sensitivity of 0.87 µK ·arcmin. In this appendix, we present NILC and ocMILC outcomes for the PICO d1 data set, em- ploying the alternative PICO configuration known as CBE (Current Best Estimate) [6, 30], featuring an enhanced overall sensitivity of 0.61 µK · arcmin. The results are shown in Figure 9, showcasing the angular power spectra of residuals averaged over all realizations and corresponding posteriors of the estimated tensor-to-scalar ratio. Even with the increased sensitivity of the PICO CBE configura- tion, ocMILC still outperforms NILC, exhibiting lower foreground residuals across all angular scales with only a moderate rise in noise contamination. As anticipated, the noise residuals in both NILC and ocMILC CMB B-mode reconstructions are lower compared to those obtained with the baseline PICO configuration (displayed in the top panel of Figure 6). Consequently, this leads to lower upper bounds on the estimated tensor-to-scalar ratio (r < 0.00025 at 95% CL), as shown in the right panel – 26 – of Figure 9. Furthermore, ocMILC improves upon the biased upper bound obtained with NILC for such a large sky fraction (70%). The ocMILC constraint aligns with the quoted forecast in [30] for PICO CBE sensitivities, albeit for a significantly larger sky fraction compared to [30]. 5 10 50 100 200 500 10 9 10 7 10 5 10 3 10 1 CBB [ K2] d1, fsky=70%, PICO CBE configuration NILC ocMILC foregrounds noise CMB input r [0.2 10 3, 4 10 3] 10 5 10 4 10 3 10 2 r 0.2 0.4 0.6 0.8 1.0 / max r=0.0002±0.0001 r < 0.00025, 95% CL Figure 9. Same as the top panels of Figure 6, but for PICO CBE sensitivities. In both panels, the grey shaded area represents the range of values of the tensor-to-scalar ratio: r ∈ [0.0002, 0.004]. The lower bound (r = 0.0002) corresponds to the targeted sensitivity at 95% CL for PICO CBE configuration, while the upper bound (r = 0.004) roughly corresponds to the energy scale of Starobinski’s inflation model. References [1] Planck Collaboration, N. Aghanim, Y. Akrami, M. Ashdown, J. Aumont, C. Baccigalupi et al., Planck 2018 results. VI. Cosmological parameters, A&A 641 (2020) A6 [1807.06209]. [2] A. La Posta, U. Natale, E. Calabrese, X. Garrido and T. Louis, Assessing the consistency between cmb temperature and polarization measurements with application to planck, act, and spt data, Phys.Rev.D 107 (2023) 023510. [3] P. Ade, J. Aguirre, Z. Ahmed, S. Aiola, A. Ali, D. Alonso et al., The Simons Observatory: science goals and forecasts, JCAP 2019 (2019) 056 [1808.07445]. [4] K. Abazajian, G. Addison, P. Adshead, Z. Ahmed, S.W. Allen, D. Alonso et al., CMB-S4 Science Case, Reference Design, and Project Plan, arXiv e-prints (2019) arXiv:1907.04473 [1907.04473]. [5] LiteBIRD Collaboration, E. Allys, K. Arnold, J. Aumont, R. Aurlien, S. Azzoni et al., Probing cosmic inflation with the LiteBIRD cosmic microwave background polarization survey, Progress of Theoretical and Experimental Physics 2023 (2023) 042F01 [2202.02773]. [6] S. Hanany, M. Alvarez, E. Artis, P. Ashton, J. Aumont, R. Aurlien et al., PICO: Probe of Inflation and Cosmic Origins, arXiv e-prints (2019) arXiv:1902.10541 [1902.10541]. [7] Y. Qin, V. Poulin, A. Mesinger, B. Greig, S. Murray and J. Park, Reionization inference from the CMB optical depth and E-mode polarization power spectra, MNRAS 499 (2020) 550 [2006.16828]. [8] Planck Collaboration, R. Adam, N. Aghanim, M. Ashdown, J. Aumont, C. Baccigalupi et al., Planck intermediate results. XLVII. Planck constraints on reionization history, A&A 596 (2016) A108 [1605.03507]. [9] R. Allison, P. Caucal, E. Calabrese, J. Dunkley and T. Louis, Towards a cosmological neutrino mass detection, Phys.Rev.D 92 (2015) 123535 [1509.07471]. [10] E. Giusarma, M. Gerbino, O. Mena, S. Vagnozzi, S. Ho and K. Freese, Improvement of cosmological neutrino mass bounds, Phys.Rev.D 94 (2016) 083522 [1605.04320]. – 27 – [11] M. Kamionkowski, A. Kosowsky and A. Stebbins, A Probe of Primordial Gravity Waves and Vorticity, Phys.Rev.Lett 78 (1997) 2058 [astro-ph/9609132]. [12] H.K. Eriksen, J.B. Jewell, C. Dickinson, A.J. Banday, K.M. G´orski and C.R. Lawrence, Joint Bayesian Component Separation and CMB Power Spectrum Estimation, ApJ 676 (2008) 10 [0709.1058]. [13] R. Stompor, S. Leach, F. Stivoli and C. Baccigalupi, Maximum likelihood algorithm for parametric component separation in cosmic microwave background experiments, MNRAS 392 (2009) 216 [0804.2645]. [14] E. de la Hoz, P. Vielva, R.B. Barreiro and E. Mart´ınez-Gonz´alez, On the detection of CMB B-modes from ground at low frequency, JCAP 2020 (2020) 006 [2002.12206]. [15] S. Azzoni, M.H. Abitbol, D. Alonso, A. Gough, N. Katayama and T. Matsumura, A minimal power-spectrum-based moment expansion for CMB B-mode searches, JCAP 2021 (2021) 047 [2011.11575]. [16] L. Vacher, J. Aumont, L. Montier, S. Azzoni, F. Boulanger and M. Remazeilles, Moment expansion of polarized dust SED: A new path towards capturing the CMB B-modes with LiteBIRD, A&A 660 (2022) A111 [2111.07742]. [17] M. Galloway, K.J. Andersen, R. Aurlien, R. Banerji, M. Bersanelli, S. Bertocco et al., BEYONDPLANCK. III. Commander3, A&A 675 (2023) A3 [2201.03509]. [18] C.L. Bennett, R.S. Hill, G. Hinshaw, M.R. Nolta, N. Odegard, L. Page et al., First-Year Wilkinson Microwave Anisotropy Probe (WMAP) Observations: Foreground Emission, ApJS 148 (2003) 97 [astro-ph/0302208]. [19] J. Delabrouille, J.F. Cardoso and G. Patanchon, Multidetector multicomponent spectral matching and applications for cosmic microwave background data analysis, MNRAS 346 (2003) 1089 [astro-ph/0211504]. [20] R. Fern´andez-Cobos, P. Vielva, R.B. Barreiro and E. Mart´ınez-Gonz´alez, Multiresolution internal template cleaning: an application to the Wilkinson Microwave Anisotropy Probe 7-yr polarization data, MNRAS 420 (2012) 2162 [1106.2016]. [21] J. Delabrouille, J.-F. Cardoso, M. Le Jeune, M. Betoule, G. Fay and F. Guilloux, A full sky, low foreground, high resolution CMB map from WMAP, A&A 493 (2009) 835 [0807.0773]. [22] K. Ichiki, H. Kanai, N. Katayama and E. Komatsu, Delta-map method of removing CMB foregrounds with spatially varying spectra, Progress of Theoretical and Experimental Physics 2019 (2019) 033E01 [1811.03886]. [23] M. Remazeilles, A. Rotti and J. Chluba, Peeling off foregrounds with the constrained moment ILC method to unveil primordial CMB B modes, MNRAS 503 (2021) 2478 [2006.08628]. [24] A. Carones, M. Migliaccio, G. Puglisi, C. Baccigalupi, D. Marinucci, N. Vittorio et al., Multiclustering needlet ILC for CMB B-mode component separation, MNRAS 525 (2023) 3117 [2212.04456]. [25] K. Tassis and V. Pavlidou, Searching for inflationary B modes: can dust emission properties be extrapolated from 350 GHz to 150 GHz?, MNRAS 451 (2015) L90 [1410.8136]. [26] J. Chluba, J.C. Hill and M.H. Abitbol, Rethinking CMB foregrounds: systematic extension of foreground parametrizations, MNRAS 472 (2017) 1195 [1701.00274]. [27] V. Pelgrims, S.E. Clark, B.S. Hensley, G.V. Panopoulou, V. Pavlidou, K. Tassis et al., Evidence for line-of-sight frequency decorrelation of polarized dust emission in Planck data, A&A 647 (2021) A16 [2101.09291]. [28] M. Remazeilles, C. Dickinson, H.K.K. Eriksen and I.K. Wehus, Sensitivity and foreground modelling for large-scale cosmic microwave background B-mode polarization satellite missions, MNRAS 458 (2016) 2032 [1509.04714]. – 28 – [29] G. Mart´ınez-Solaeche, A. Karakci and J. Delabrouille, A 3D model of polarized dust emission in the Milky Way, MNRAS 476 (2018) 1310 [1706.04162]. [30] R. Aurlien, M. Remazeilles, S. Belkner, J. Carron, J. Delabrouille, H.K. Eriksen et al., Foreground separation and constraints on primordial gravitational waves with the PICO space mission, JCAP 2023 (2023) 034 [2211.14342]. [31] U. Fuskeland, J. Aumont, R. Aurlien, C. Baccigalupi, A.J. Banday, H.K. Eriksen et al., Tensor-to-scalar ratio forecasts for extended LiteBIRD frequency configurations, A&A 676 (2023) A42 [2302.05228]. [32] Planck Collaboration, N. Aghanim, M. Ashdown, J. Aumont, C. Baccigalupi, M. Ballardini et al., Planck intermediate results. XLVIII. Disentangling Galactic dust emission and cosmic infrared background anisotropies, A&A 596 (2016) A109 [1605.09387]. [33] K.M. G´orski, E. Hivon, A.J. Banday, B.D. Wandelt, F.K. Hansen, M. Reinecke et al., HEALPix: A Framework for High-Resolution Discretization and Fast Analysis of Data Distributed on the Sphere, ApJ 622 (2005) 759 [astro-ph/0409513]. [34] A. Zonca, L. Singer, D. Lenz, M. Reinecke, C. Rosset, E. Hivon et al., healpy: equal area pixelization and spherical harmonics transforms for data on the sphere in Python, The Journal of Open Source Software 4 (2019) 1298. [35] Planck Collaboration, N. Aghanim, Y. Akrami, M. Ashdown, J. Aumont, C. Baccigalupi et al., Planck 2018 results. VI. Cosmological parameters, A&A 641 (2020) A6 [1807.06209]. [36] B. Thorne, J. Dunkley, D. Alonso and S. Næss, The Python Sky Model: software for simulating the Galactic microwave sky, MNRAS 469 (2017) 2821 [1608.02841]. [37] A. Zonca, B. Thorne, N. Krachmalnicoff and J. Borrill, The Python Sky Model 3 software, The Journal of Open Source Software 6 (2021) 3783 [2108.01444]. [38] Planck Collaboration, R. Adam, P.A.R. Ade, N. Aghanim, M.I.R. Alves, M. Arnaud et al., Planck 2015 results. X. Diffuse component separation: Foreground maps, A&A 594 (2016) A10 [1502.01588]. [39] A.M. Meisner and D.P. Finkbeiner, Modeling Thermal Dust Emission with Two Components: Application to the Planck High Frequency Instrument Maps, ApJ 798 (2015) 88 [1410.7523]. [40] B.T. Draine and B. Hensley, Magnetic Nanoparticles in the Interstellar Medium: Emission Spectrum and Polarization, ApJ 765 (2013) 159 [1205.7021]. [41] Planck Collaboration, Y. Akrami, M. Ashdown, J. Aumont, C. Baccigalupi, M. Ballardini et al., Planck 2018 results. IV. Diffuse component separation, A&A 641 (2020) A4 [1807.06208]. [42] D.B. Rybicki and A.P. Lightman, Radiative Processes in Astrophysics (1979). [43] C.L. Bennett, D. Larson, J.L. Weiland, N. Jarosik, G. Hinshaw, N. Odegard et al., Nine-year Wilkinson Microwave Anisotropy Probe (WMAP) Observations: Final Maps and Results, ApJS 208 (2013) 20 [1212.5225]. [44] M.A. Miville-Deschˆenes, N. Ysard, A. Lavabre, N. Ponthieu, J.F. Mac´ıas-P´erez, J. Aumont et al., Separation of anomalous and synchrotron emissions using WMAP polarization data, A&A 490 (2008) 1093 [0802.3345]. [45] V. Stolyarov, M.P. Hobson, A.N. Lasenby and R.B. Barreiro, All-sky component separation in the presence of anisotropic noise and dust temperature variations, MNRAS 357 (2005) 145 [astro-ph/0405494]. [46] M. Remazeilles, J. Delabrouille and J.-F. Cardoso, Foreground component separation with generalized Internal Linear Combination, MNRAS 418 (2011) 467 [1103.1166]. [47] F.J. Narcowich, P. Petrushev and J.D. Ward, Localized tight frames on spheres, SIAM Journal on Mathematical Analysis 38 (2006) 574 [https://doi.org/10.1137/040614359]. [48] D. Marinucci, D. Pietrobon, A. Balbi, P. Baldi, P. Cabella, G. Kerkyacharian et al., Spherical needlets for cosmic microwave background data analysis, MNRAS 383 (2008) 539 [0707.0844]. – 29 – [49] L. Page, G. Hinshaw, E. Komatsu, M.R. Nolta, D.N. Spergel, C.L. Bennett et al., Three-Year Wilkinson Microwave Anisotropy Probe (WMAP) Observations: Polarization Analysis, ApJS 170 (2007) 335 [astro-ph/0603450]. [50] N. Krachmalnicoff, E. Carretti, C. Baccigalupi, G. Bernardi, S. Brown, B.M. Gaensler et al., S-PASS view of polarized Galactic synchrotron at 2.3 GHz as a contaminant to CMB observations, A&A 618 (2018) A166 [1802.01145]. [51] L. Vacher, J. Chluba, J. Aumont, A. Rotti and L. Montier, High precision modeling of polarized signals: Moment expansion method generalized to spin-2 fields, A&A 669 (2023) A5 [2205.01049]. [52] A. Rotti and J. Chluba, Combining ILC and moment expansion techniques for extracting average-sky signals and CMB anisotropies, MNRAS 500 (2021) 976 [2006.02458]. [53] D. Adak, A new approach of estimating the galactic thermal dust and synchrotron polarized emission template in the microwave bands, MNRAS 507 (2021) 4618 [2104.13778]. [54] S. Ghosh, Y. Liu, L. Zhang, S. Li, J. Zhang, J. Wang et al., Performance forecasts for the primordial gravitational wave detection pipelines for AliCPT-1, JCAP 2022 (2022) 063 [2205.14804]. [55] Z. Zhang, Y. Liu, S.-Y. Li, H. Li and H. Li, A Constrained NILC method for CMB B mode observations, arXiv e-prints (2023) arXiv:2309.08170 [2309.08170]. [56] J. Dou, S. Ghosh, L. Santos and W. Zhao, Foreground removal with ILC methods for AliCPT-1, arXiv e-prints (2023) arXiv:2310.19627 [2310.19627]. [57] E. Hivon, K.M. G´orski, C.B. Netterfield, B.P. Crill, S. Prunet and F. Hansen, MASTER of the Cosmic Microwave Background Anisotropy Power Spectrum: A Fast Method for Statistical Analysis of Large and Complex Cosmic Microwave Background Data Sets, ApJ 567 (2002) 2 [astro-ph/0105302]. [58] G. Polenta, D. Marinucci, A. Balbi, P. de Bernardis, E. Hivon, S. Masi et al., Unbiased estimation of an angular power spectrum, JCAP 2005 (2005) 001 [astro-ph/0402428]. [59] D. Alonso, J. Sanchez, A. Slosar and LSST Dark Energy Science Collaboration, A unified pseudo-Cℓ framework, MNRAS 484 (2019) 4127 [1809.09603]. [60] Y.S. Abylkairov, O. Darwish, J.C. Hill and B.D. Sherwin, Partially constrained internal linear combination: A method for low-noise CMB foreground mitigation, Phys.Rev.D 103 (2021) 103510 [2012.04032]. [61] S. Hamimeche and A. Lewis, Likelihood analysis of CMB temperature and polarization power spectra, Phys.Rev.D 77 (2008) 103013 [0801.0554]. [62] A. Kogut, Synchrotron Spectral Curvature from 22 MHz to 23 GHz, ApJ 753 (2012) 110 [1205.4041]. [63] C. Dickinson, M. Peel and M. Vidal, New constraints on the polarization of anomalous microwave emission in nearby molecular clouds, MNRAS 418 (2011) L35 [1108.0308]. [64] R. G´enova-Santos, J.A. Rubi˜no-Mart´ın, R. Rebolo, A. Pel´aez-Santos, C.H. L´opez-Caraballo, S. Harper et al., QUIJOTE scientific results - I. Measurements of the intensity and polarisation of the anomalous microwave emission in the Perseus molecular complex, MNRAS 452 (2015) 4169 [1501.04491]. [65] D. Herman, B. Hensley, K.J. Andersen, R. Aurlien, R. Banerji, M. Bersanelli et al., BEYONDPLANCK. XV. Limits on large-scale polarized anomalous microwave emission from Planck LFI and WMAP, A&A 675 (2023) A15 [2201.03530]. [66] R. G´enova-Santos, J.A. Rubi˜no-Mart´ın, A. Pel´aez-Santos, F. Poidevin, R. Rebolo, R. Vignaga et al., QUIJOTE scientific results - II. Polarisation measurements of the microwave emission in the Galactic molecular complexes W43 and W47 and supernova remnant W44, MNRAS 464 (2017) 4107 [1605.04741]. [67] S. Ghosh, J. Delabrouille, W. Zhao and L. Santos, Towards ending the partial sky E-B ambiguity in CMB observations, JCAP 2021 (2021) 036 [2007.09928]. – 30 – [68] Z. Zhang, Y. Liu, S.-Y. Li, D.-L. Wu, H. Li and H. Li, Efficient ILC analysis on polarization maps after EB leakage correction, JCAP 2022 (2022) 044 [2109.12619]. [69] A. Carones, M. Migliaccio, D. Marinucci and N. Vittorio, Analysis of Needlet Internal Linear Combination performance on B-mode data from sub-orbital experiments, A&A 677 (2023) A147 [2208.12059]. – 31 – "
}