{
    "optim": "Highway Discretionary Lane-change Decision and Control Using Model Predictive Control Zishun Zheng Shien-Ming Wu School of Intelligent Engineering South China University of Technology Guangzhou, China 202320160023@mail.scut.edu.cn Xiao Liu Shien-Ming Wu School of Intelligent Engineering South China University of Technology Guangzhou, China 202121060431@mail.scut.edu.com Yuan Lin* Shien-Ming Wu School of Intelligent Engineering South China University of Technology Guangzhou, China yuanlin@scut.edu.cn Abstract—To enable vehicles to perform automatic lane change amidst the random traffic flow on highways, this paper introduces a decision-making and control method for vehicle lane-change based on Model Predictive Control (MPC). This approach divides the driving control of vehicles on highways into two parts: lane- change decision and lane-change control, both of which are solved using the MPC method. In the lane-change decision module, the minimum driving costs for each lane are computed and compared by solving the MPC problem to make lane-change decisions. In the lane-change control module, a dynamic bicycle model is incorporated, and a multi-objective cost function is designed to obtain the optimal control inputs for the lane-change process. The proposed lane-change decision and control methods are simulated and validated within the SUMO platform under random highway traffic conditions. Index Terms—Autonomous Vehicle, Lane-change, Model Pre- dictive Control I. INTRODUCTION The quest for autonomous driving systems that seamlessly blend with the complex tapestry of human-driven traffic has become a focal point in the field of intelligent transportation. Central to this pursuit is the development of advanced control strategies that enable automated vehicles to execute critical maneuvers with precision and safety. Lane change, which necessitates the integration of both longitudinal and lateral control, is considered one of the most complex driving maneuvers. Despite the inherent risks and the fact that improper lane-changes are often implicated in accidents, it has been observed that lane-changes executed by autonomous vehicles can effectively increase the average speed of the vehicle [1]. The decision-making process for lane-change is thus an indispensable aspect of autonomous driving. It involves evaluating the feasibility of the lane- change and ensuring that the maneuver is conducted with safety and efficiency in mind [2]. Autonomous vehicles, by perceiving road conditions and the information of surrounding vehicles, can plan the optimal driving path. This not only saves travel time for the vehicle itself but also contributes to optimizing traffic flow, enhancing road capacity, and reducing the incidence of traffic accidents. This work is supported by Guangzhou basic and applied basic research project under Grant 2023A04J1688. In recent years, MPC has emerged as a potent paradigm in the orchestration of such maneuvers due to its forward-looking capabilities and constraint-handling properties. By leveraging a model of the vehicle’s dynamics and the surrounding en- vironment, MPC anticipates future states and derives optimal control inputs that adhere to the constraints of the road and vehicle capabilities. The execution of lane-change maneuvers by drivers involves not only the consideration of their own vehicle but also the attention to nearby traffic participants. The MPC method has been proven to be an attractive approach in the domain of autonomous vehicle control [3], [4]. MPC uses a dynamic vehicle model to predict future states and determines an opti- mal control sequence for each moment, aiming to minimize a predefined performance index while satisfying constraints on control and state variables [5]. Mukai and Kawabe developed a lane-change assistance system based on MPC that formulates the problem of generating optimal lane-change paths as a mixed-integer programming problem, solving it with multi- parametric programming [6]. With existing infrastructure, lane measurement and control can be performed, thereby facil- itating lane-change decisions [7]. Utilizing this technology, Kamal et al. designed an Economical Adaptive Cruise Control (EACC) lane-change model capable of real-time selection of the optimal lane for fuel economy [8], [9]. Tejeddin proposed a Multi-Lane Adaptive Cruise Controller (MLACC), designed to determine the optimal speed and driving lane in real-time [10]. Compared to Kamal’s model, the MLACC model accounts for road grade and lane-change benefit thresholds. However, it only updates vehicles ahead when generating traffic flow and does not consider the relationship between the ego vehicle and following vehicles. Karlsson outlines a control system for self-driving cars to navigate highway exits, integrating a new trajectory planner and decision manager to enhance safety and comfort [11]. Bae introduces a real-time control framework for autonomous lane changes in heavy traffic using cooperative behavior prediction and MPC enhanced by Recurrent Neural Networks in 2020 [12]. And in 2022 he developed an online framework for smooth-path lane changes in dense traffic, integrating MPC with GANs for maneuver generation, and enhancing performance with adaptive safety arXiv:2402.17524v1  [eess.SY]  27 Feb 2024 measures and noise reduction, validated by simulations for efficiency and safety [13]. Ammour addresses autonomous driving safety by presenting an MPC-based collision avoid- ance algorithm accounting for dynamic traffic, with decision making and trajectory planning simplified for efficiency, and validated through simulations with mixed integer formulations and Sigmoid-based safety constraints [14]. Bhattacharyya and Vahidi introduces aiMPC, an adaptive motion planning frame- work for automated highway merging that optimizes vehicle interactions through mixed integer quadratic programming and inverse optimal control, demonstrating effective merging in simulations [15]. A controlling method combining lane-change decision and control, inspired by the previous work [10], is presented here. We propose a method based on MPC that integrates decision-making and vehicle control, capable of manipulating the vehicle’s intended actions and specific controls in a phased manner. This approach accounts not only for the motion control of the vehicle itself but also incorporates interactions with surrounding traffic into its calculations. Furthermore, this method conveniently facilitates subsequent improvements to individual modules. Through this holistic control strategy, an autonomous vehicle can dynamically adapt to the rapidly changing conditions of the road environment, ensuring both the safety and efficiency of lane-change maneuvers. The paper is organized in the following manner. Section II describes the lane-change decision method based on MPC. Section III details the establishment of a dynamic bicycle model and the control of the vehicle based on MPC. Section IV presents the simulation results and analysis. II. LANE-CHANGE DECISION When the ego vehicle maintains a straight course on the road and the distance to the lead vehicle in the current lane is less than ∆sref, a lane-change can be considered. By comparing the driving cost of the current lane with that of the adjacent lanes, the optimal lane for travel is determined, and a decision is made to either change lane or stay in the current lane. A. Modelling x = \u0002 ∆s ∆sf v vl vf a j \u0003⊤ (1) u = a (2) x(k + 1) = Ax(k) + Bu(k), (3) where A =   1 0 −Ts Ts 0 0 0 0 1 Ts 0 −Ts 0 0 0 0 1 0 0 Ts 0 0 0 0 1 0 0 0 0 0 0 0 1 0 0 0 0 0 0 0 0 0 0 0 0 0 0 − 1 Ts 0   (4) B = \u0002 0 0 0 0 0 1 1 Ts \u0003⊤ (5) To address the lane-change decision problem, it is essential to establish a mathematical model for the single-lane car- following problem. In this model, we consider the ego vehicle and the preceding and following vehicles on the current lane as point masses. For the Adaptive Cruise Control (ACC) problem, take the distance ∆s between the ego vehicle and the leader, the distance ∆sf between the ego vehicle and the follower, the speed v of the ego vehicle, the speed vl of the leading vehicle, the speed vf of the following vehicle, the acceleration a of the ego vehicle, and the jerk j of the ego vehicle as state variables, and take the acceleration a of the ego vehicle as the control variable. The state space variables and control variables are shown as formula (1)(2). To represent the kinematic equations of a vehicle in state- space form, formula (3) can be obtained. The length of time step Ts is set as 0.1s. B. Cost Function                                                      J = Pt+T l=t \f\f\f v(l|t)−vref vref \f\f\f + Pt+T l=t λ1m1 (6a) + Pt+T l=t λ2m2 + Pt+T l=t λ3m3 s.t. m1 = j(l | t) (6b) m2 =    0, ∆s(l | t) ≥ ∆sd(l | t) ∆sd(l|t)−∆s(l|t) ∆sref , ∆s(l | t) < ∆sd(l | t) (6c) m3 =        0, ∆sf(l | t) ≥ ∆sd,f(l | t) or lsw = 0 ∆sd,f (l|t)−∆sf (l|t) ∆sref , ∆sf(l | t) < ∆sd,f(l | t) (6d) ∆sd(l | t) = d0 + thv(l | t) (6e) ∆sd,f(l | t) = d0 + thvf(l | t) (6f) ∆sref = 50 m (6g) When optimizing for multiple objectives simultaneously, a composite cost function that is the sum of individual terms representing different objectives is commonly used. This ap- proach allows one to balance and prioritize the various aspects of the vehicle’s performance that are important for the driving task. The cost function used for lane-change decisions in this paper is presented in formula (6a), and the description of each variable in cost function can be referred to in TABLE I. The initial term of the cost function pertains to the velocity component. Within the scope of this study’s scenario, which necessitates the vehicle’s continuous gap-seeking and over- taking maneuvers, the maintenance of a comparatively high traveling speed is of paramount importance. The reference speed vref is slightly higher than the speeds of surrounding vehicles. m1 represents the jerk of the ego vehicle. However, comfort is not considered the most critical criterion; hence, the weight assigned to this term is relatively low. TABLE I PARAMETERS OF COST FUNCTION IN LANE-CHANGE DECISION Parameters Description Value vref A desired speed higher than that of the surrounding vehicles 27 m/s th Time headway during car-following 1.5 s d0 The reference following distance when the ego vehicle is stationary 5 m λ1 Jerk weight term 0.2 λ2 Leading vehicle distance weight term 1 λ3 Following vehicle distance weight term 0.2 lsw Lane-change decision. 0 refers to stay, 1 refers to switch 0 or 1 ud Desired control effort Jth Lane-change threshold of driving cost 0.3 kp Penalty term on lane-change 0.1 t Current time step l Predictive time step m2 represents cost related to the leading vehicle. When ego vehicle is too close to the leader, the driving cost begins to rise. However, when ∆s is far enough, meaning the actual distance is further than the desired distance ∆sd, it can be assumed that the leading vehicle does not interfere with the movement of ego vehicle, allowing the vehicle to accelerate freely within its lane. Therefore, the driving cost at this moment is considered to be 0. When ego vehicle stays in its current lane, the following vehicle should be ignored. Consequently, within the com- putation of the driving cost for ego vehicle in its lane, the following distance term, denoted as m3, is assigned a value of 0. In contrast, when assessing the driving cost for potential maneuvers into adjacent lanes, the influence of the following vehicle is similar to the m2 scenario. C. Constraints Undoubtedly, both lane-change and car-following behaviors necessitate conditions where collision avoidance is paramount. Therefore, imposing a minimum longitudinal distance con- straint between vehicles is necessary. To define the boundaries of following distance and avoid collision, hard constraints are added: \u001a ∆s(l | t) > dsafe = 2b (7a) ∆sf(l | t) > dsafe = 2b (7b) where b = 5m represents the body length of the ego vehicle. Additionally, considering the actual acceleration and decel- eration performance of the vehicles, it’s necessary to impose hard constraints on the vehicle’s acceleration. a ∈ [amin, amax] (8) where amin = −4.5 m/s2, amax = 2.6 m/s2. D. Future State Prediction On highways, sudden stops or spurts in speed by lead- ing vehicles are uncommon, with surrounding vehicles pre- dominantly maintaining a steady pace. Consequently, it is a reasonable assumption that vl will remain constant over the predictive horizon. Therefore, this paper posits that the controller measures the leading vehicle’s velocity vl at the present time step k and continuously applies this value in subsequent calculations within the predictive horizon, with a prediction horizon of N = 50 selected. This approach to resolving the MPC issue is known as the ”Frozen Time” implementation. E. Optimal Lane Selection At each moment k, the ego vehicle retrieves information of surrounding vehicles, including the relative distance ∆sl,i and velocity vl,i of the leading and following vehicles in the current lane and adjacent lanes, where i ∈ {r, c, l} denotes the lane. Subsequently, it first determines whether the left and right lanes exist and whether there are conditions for lane-change. For all available lanes, the model optimizes the minimum future driving cost and the corresponding control inputs using a MPC approach. It then determines the optimal lane at the current moment and executes the decision to either remain in the current lane or change lanes, as detailed in Algorithm 1. Regarding the safety conditions during lane-change, consid- ering that the speeds of vehicles in the traffic flow other than the ego vehicle are generally stable, a constant value is used as the safety distance criterion, set as dsafe = 3b = 15m. Thus, as long as the longitudinal distances with the leading and following vehicles in the adjacent lanes are both greater than dsafe, it is considered to meet the safety conditions for lane change. III. LANE-CHANGE CONTROL The previous chapter elaborates the methodology for discre- tionary lane-change decisions at each time step. This chapter will introduce the control mechanisms engaged to maneuver the vehicle during the lane-change process subsequent to the decision, also using the MPC method. At each discrete time step, the control of the vehicle can be construed as a composite function of acceleration a and the steering angle δ of the front wheels. The objective of the proposed controller is to ascertain the optimal control combination and apply it to the ego vehicle. A. Dynamic Bicycle Model In a highway scenario, using the dynamic bicycle model can make the calculation of its driving trajectory more accurate. Algorithm 1: Determination of lsw and ud Input: li, ∆si, ∆sf,i, v, vl,i, vf,i, a, j Output: lsw, ud 1 while MLACC engaged do 2 (Jc, ud,c) ← NMPC(lc, ∆sc, ∆sf,c, v, vl,c, vf,c, a, j) 3 if Jc ≤ Jth then 4 return lsw ← 0, ud ← ud,c 5 else 6 (Jr, ud,r) ← NMPC(lr, ∆sr, ∆sf,r, v, vl,r, vf,r, a, j) 7 (Jl, ud,l) ← NMPC(ll, ∆sl, ∆sf,l, v, vl,l, vf,l, a, j) 8 if (1 + kp)Jr < Jc and Jr ≤ Jl then 9 return lsw ← −1, ud ← ud,r 10 else if (1 + kp)Jl < Jc and Jl < Jr then 11 return lsw ← 1, ud ← ud,l 12 else 13 return lsw ← 0, ud ← ud,c 14 end 15 end 16 end The vehicle dynamics model used in this article is described as formula (9)(10)(11). The state variables respectively de- notes longitudinal position, lateral position, yaw angle, lateral velocity, longitudinal velocity, yaw rate. X = \u0002 x y φ u v ω \u0003⊤ (9) U = \u0002 a δ \u0003⊤ (10) where ˙X = f(X, U) =   u cos φ − v sin φ v cos φ + u sin φ ω a + vω − 1 mFY1 sin δ −uω + 1 m (FY1 cos δ + FY2) 1 Iz (lfFY1 cos δ − lrFY2)   (11) When the front wheel steering angle of the vehicle is very small, it can be approximately obtained: cos δ ≈ 1 (12) sin δ ≈ 0 (13) FY1 = kfα1 ≈ kf \u0012v + lfω u − δ \u0013 (14) FY2 = krα2 ≈ kr \u0012v − lrω u \u0013 (15) The parameters of the vehicle model are as shown in TABLE II. 𝑂 𝑋 𝑌 Fig. 1. Dynamic bicycle model TABLE II BASIC PARAMETERS OF SIMULATION VEHICLE Parameter Description Value m mass of the vehicle 1470 kg kf front axle equivalent sideslip stiffness -100000 N/rad kr rear axle equivalent sideslip stiffness -100000 N/rad lf distance between C.m. and front axle 1.085 m lr distance between C.m. and rear axle 2.503 m Iz yaw inertia of vehicle body 2400 kg·m2 B. Cost Function When the vehicle is driving in its lane without making a lane-change decision, the lateral control objective of the ego vehicle is to maintain the center of the lane, and the longitu- dinal control objective is to follow the preceding vehicle. When the vehicle makes a lane-change decision, the ref- erence lateral position yref is updated to correspond to the centerline coordinates of the targeted adjacent lane. The lateral control aim for the ego vehicle is to converge toward yref, while the longitudinal control objective shifts to maintaining a safe following distance behind the leading vehicle in the target lane. Similar to the cost function in lane-change decision, the ego vehicle needs to maintain a high reference speed vref, to ensure it can overtake other vehicles while driving. An- other important factor is the lateral deviation of the vehicle’s center of mass from the centerline of the lane. The designed controller should minimize this deviation to keep the vehicle driving straight. Additionally, for a smooth driving experience, it’s necessary to control the acceleration a, steering angle δ, rate of change in acceleration ∆a, and rate of change in steering angle ∆δ. J = t+T X l=t λv ∥v(l | t) − vref∥2 + t+T X l=t λy ∥y(l | t) − yref∥2 + t+T X l=t λl max (0, dl (l | t) − dsafe) + t+T X l=t λδ∥δ(l | t)∥2 + t+T −1 X l=t+1 λ∆δ∥δ(l | t) − δ(l − 1 | t)∥2 + t+T X l=t λa∥a(l | t)∥2 + t+T −1 X l=t+1 λ∆a∥a(l | t) − a(l − 1 | t)∥2 s.t. dl (l | t) = dl (l − 1 | t) + [v (l − 1 | t) − vl] Ts (16) TABLE III WEIGHT PARAMETERS OF COST FUNCTION Parameters Value Parameters Value λv 1 λδ 100000 λy 100 λ∆δ 10000 λl -100 λa 1 λ∆a 50 To maintain a safe distance dsafe from the leading vehicle while also maximizing the use of gaps in traffic for overtaking, it is advisable to employ either a cost or constraint to limit this term. Utilizing a constraint may render the MPC problem infeasible when another vehicle suddenly cuts in front or when control deviation causes the distance to the leading vehicle to fall below dsafe. Therefore, this study employs a cost function to regulate the following distance. When the distance to the leading vehicle exceed dsafe, the cost remains at 0. If the distance falls below dsafe, the cost rises sharply in a linear fashion. This approach not only sustain the distance from the leading vehicle above dsafe as much as possible, but also guarantee that the problem remains solvable even when the distance contract to less than dsafe. C. Constraints • The velocity of the ego vehicle should comply with the speed limit regulations of the highway. • The ego vehicle is situated on a three-lane road, and constraints should be applied to the road boundaries. • The aforementioned dynamic bicycle model holds true only when the steering angle of the front wheels is small; hence, it is necessary to impose constraints on the values of the front wheel steering angle. • Considering the vehicle’s actual acceleration and braking capabilities, constraints on acceleration must be applied.          v(l | t) ∈ [vmin, vmax] (17a) y(l | t) ∈ [ymin, ymax] (17b) δ(l | t) ∈ [δmin, δmax] (17c) a(l | t) ∈ [amin, amax] (17d) where vmin = 20 m/s, vmax = 30 m/s; ymin = −9.6 m, ymax = 0 m; δmin = −5◦, δmax = 5◦; amin = −4.5 m/s2, amax = 2.6 m/s2. IV. SIMULATION A. Platform & Rules This article uses SUMO as the simulation platform. The road vehicle distribution is randomly generated, placing all vehicles at time zero, and then the simulation begins. For surrounding vehicles, the Intelligent Driver Model(IDM) car- following model and LC2013 lane-change model in SUMO are used, canceling the tendency to drive to the right, and overtaking is allowed in all three lanes. B. Result & Analysis 5 10 15 20 25 30 35 40 45 50 t(s) 24.5 25 25.5 26 26.5 27 27.5 28 v(m/s) 0 20 40 60 80 100 120 140 \"s(m) velocity leader distance Fig. 2. Velocity(blue) and leader distance(red) of ego vehicle. 5 10 15 20 25 30 35 40 45 50 t(s) -1.5 -1 -0.5 0 0.5 a(m/s2) -4 -2 0 2 4 6 8 10 j(m/s3) acceleration jerk Fig. 3. Acceleration(blue) and jerk(red) of ego vehicle. Initially, when the distance to the vehicle ahead in the current lane is substantial, the ego vehicle maintains a steady cruising speed. As it closes in on the leading vehicle, reducing the gap to less than ∆sref, the ego vehicle decides to execute a lane change to the right. During the maneuver, the vehicle slightly increases its speed to align more swiftly with the center of the adjacent lane and then returns to the reference speed vref once it stabilizes in the new lane. If the overtaking space is not sufficiently clear, or the relative positioning of the vehicles does not meet the safe criteria for lane-change, the ego vehicle opts to decelerate and follow the leading vehicle, adjusting its relative position with surrounding traffic. It waits and seeks an ideal gap within the traffic flow to safely complete the lane-change. 10 20 30 40 50 t(s) -8 -6 -4 -2 0 y(m) left lane middle lane right lane Fig. 4. Lateral distance of ego vehicle. 10 20 30 40 50 t(s) -0.02 -0.01 0 0.01 0.02 /(rad) Fig. 5. Steering angle of ego vehicle. REFERENCES [1] S. Mo, X. Pei, and Z. Chen, “Decision-making for oncoming traffic overtaking scenario using double dqn,” in 2019 3rd Conference on Vehicle Control and Intelli- gence (CVCI), IEEE, 2019, pp. 1–4. [2] W. Wang, T. Qie, C. Yang, W. Liu, C. Xiang, and K. Huang, “An intelligent lane-changing behavior pre- diction and decision-making strategy for an autonomous vehicle,” IEEE transactions on industrial electronics, vol. 69, no. 3, pp. 2927–2937, 2021. [3] A. Gray, Y. Gao, J. K. Hedrick, and F. Borrelli, “Robust predictive control for semi-autonomous vehicles with an uncertain driver model,” in 2013 IEEE intelligent vehicles symposium (IV), IEEE, 2013, pp. 208–213. [4] S. J. Anderson, S. C. Peters, T. E. Pilutti, and K. Iagnemma, “An optimal-control-based framework for trajectory planning, threat assessment, and semi- autonomous control of passenger vehicles in hazard avoidance scenarios,” International Journal of Vehicle Autonomous Systems, vol. 8, no. 2-4, pp. 190–216, 2010. [5] D. Q. Mayne, J. B. Rawlings, C. V. Rao, and P. O. Scokaert, “Constrained model predictive control: Stabil- ity and optimality,” Automatica, vol. 36, no. 6, pp. 789– 814, 2000. [6] M. Mukai and T. Kawabe, “Model predictive control for lane change decision assist system using hybrid sys- tem representation,” in 2006 SICE-ICASE International Joint Conference, IEEE, 2006, pp. 5120–5125. [7] V. L. Knoop, P. F. De Bakker, C. C. Tiberius, and B. Van Arem, “Lane determination with gps precise point positioning,” IEEE Transactions on Intelligent Transportation Systems, vol. 18, no. 9, pp. 2503–2513, 2017. [8] M. A. S. Kamal, S. Taguchi, and T. Yoshimura, “Effi- cient vehicle driving on multi-lane roads using model predictive control under a connected vehicle environ- ment,” in 2015 IEEE Intelligent Vehicles Symposium (IV), IEEE, 2015, pp. 736–741. [9] M. A. S. Kamal, S. Taguchi, and T. Yoshimura, “Ef- ficient driving on multilane roads under a connected vehicle environment,” IEEE Transactions on Intelligent Transportation Systems, vol. 17, no. 9, pp. 2541–2551, 2016. [10] S. Tajeddin, S. Ekhtiari, M. Faieghi, and N. L. Azad, “Ecological adaptive cruise control with optimal lane selection in connected vehicle environments,” IEEE Transactions on Intelligent Transportation Systems, vol. 21, no. 11, pp. 4538–4549, 2019. [11] J. Karlsson, N. Murgovski, and J. Sj¨oberg, “Optimal trajectory planning and decision making in lane change maneuvers near a highway exit,” in 2019 18th European Control Conference (ECC), IEEE, 2019, pp. 3254– 3260. [12] S. Bae, D. Saxena, A. Nakhaei, C. Choi, K. Fujimura, and S. Moura, “Cooperation-aware lane change maneu- ver in dense traffic based on model predictive control with recurrent neural network,” in 2020 American Con- trol Conference (ACC), IEEE, 2020, pp. 1209–1216. [13] S. Bae, D. Isele, A. Nakhaei, et al., “Lane-change in dense traffic with model predictive control and neural networks,” IEEE Transactions on Control Systems Tech- nology, vol. 31, no. 2, pp. 646–659, 2022. [14] M. Ammour, R. Orjuela, and M. Basset, “A mpc combined decision making and trajectory planning for autonomous vehicle collision avoidance,” IEEE Trans- actions on Intelligent Transportation Systems, vol. 23, no. 12, pp. 24 805–24 817, 2022. [15] V. Bhattacharyya and A. Vahidi, “Automated vehicle highway merging: Motion planning via adaptive inter- active mixed-integer mpc,” in 2023 American Control Conference (ACC), IEEE, 2023, pp. 1141–1146. "
}