{
    "optim": "Computing eigenfrequency sensitivities near exceptional points\nFelix Binkowski,1 Julius Kullig,2 Fridtjof Betz,1 Lin Zschiedrich,3\nAndrea Walther,1, 4 Jan Wiersig,2 and Sven Burger1, 3\n1Zuse Institute Berlin, 14195 Berlin, Germany\n2Institut f¨ur Physik, Otto-von-Guericke-Universit¨at Magdeburg, 39106 Magdeburg, Germany\n3JCMwave GmbH, 14050 Berlin, Germany\n4Department of Mathematics, Humboldt-Universit¨at zu Berlin, 10099 Berlin, Germany\nExceptional points are spectral degeneracies of non-Hermitian systems where both eigenfrequen-\ncies and eigenmodes coalesce. The eigenfrequency sensitivities near an exceptional point are signif-\nicantly enhanced, whereby they diverge directly at the exceptional point. Capturing this enhanced\nsensitivity is crucial for the investigation and optimization of exceptional-point-based applications,\nsuch as optical sensors.\nWe present a numerical framework, based on contour integration and\nalgorithmic differentiation, to accurately and efficiently compute eigenfrequency sensitivities near\nexceptional points.\nWe demonstrate the framework to an optical microdisk cavity and derive a\nsemi-analytical solution to validate the numerical results. The computed eigenfrequency sensitiv-\nities are used to track the exceptional point along an exceptional surface in the parameter space.\nThe presented framework can be applied to any kind of resonance problem, e.g., with arbitrary\ngeometry or with exceptional points of arbitrary order.\nI.\nINTRODUCTION\nResonance phenomena play a crucial role in the field\nof photonics.\nThe interaction of light with photonic\nnanoresonators leads to a strong increase of the electro-\nmagnetic fields. This effect can be used for, e.g., prob-\ning single molecules with ultrahigh sensitivity [1], design-\ning nanoantennas with a tailored directivity and large\nspontaneous emission rate [2], or realizing efficient single-\nphoton sources [3]. Resonances are characterized by loss\nmechanisms, such as damping or open boundaries, yield-\ning non-Hermitian systems with complex-valued eigen-\nfrequencies [4, 5].\nIn general, the resonances are nu-\nmerically computed by solving the source-free Maxwell’s\nequations [6–8]. For the investigation of photonic sys-\ntems, not only the resonances are of interest, but also\ntheir partial derivatives, the so-called sensitivities, with\nrespect to certain system parameters.\nThese enable a\nbetter understanding of the underlying physical effects [9]\nand an efficient optimization of corresponding photonic\ndevices [10, 11].\nAn impressive signature of the non-Hermitian physics\nof resonant photonic systems are degeneracies where\nnot only the complex eigenfrequencies but simultane-\nously also the involved eigenmodes coalesce; for a review\nsee [12]. Commonly, parametric fine-tuning is needed to\nachieve such non-Hermitian degeneracies, which is why\nthey are also called exceptional points (EPs) in parame-\nter space [13]. In the past years, EPs have been connected\nto a plethora of interesting effects and suggested ap-\nplications including ultra-sensitive sensors [14–24], loss-\ninduced revival of lasing [25], orbital-angular momen-\ntum microlasers [26], chiral perfect absorbers [27], con-\ntrol of light transport [28], single-mode lasing [29], elec-\ntromagnetically induced transparency [30], optical am-\nplifiers [31], and optical filters with sharp transmission\npeaks [32, 33]. The research on EPs is still a vital field\nwith open problems, such as sensor-performance limita-\ntions or Petermann factor divergence at EPs [34–38].\nThe eigenfrequencies near an EP show a characteris-\ntic complex-root topology [13]. Consequently, near the\nEP, small parametric changes of the system are ampli-\nfied to a strong response of the eigenfrequencies. This\nEP-enhanced eigenfrequency sensitivity is challenging in\nexperiments and may also spoil the accuracy of numerical\nsimulations. On the other hand, calculation of the eigen-\nfrequency sensitivities near an EP is crucial for applica-\ntions such as sensors or optimization schemes. Hence, ac-\ncurate and efficient numerical methods for photonic sys-\ntems operating near an EP are of fundamental interest\nin research and engineering.\nIn this work, we address this challenge by combin-\ning contour integration with algorithmic differentiation\n(AD). Contour integration gives access to eigenfrequen-\ncies in non-Hermitian systems by solving Maxwell’s equa-\ntions with source terms at frequencies on a contour in the\ncomplex frequency plane.\nFor the corresponding scat-\ntering problems, AD is exploited so that the calcula-\ntion of eigenfrequency sensitivities is numerically accu-\nrate and efficient. Although the eigenfrequency sensitiv-\nities diverge near an EP, which is sketched in Fig. 1, the\npresented framework allows to capture the EP-enhanced\neigenfrequency sensitivity. We apply the framework to\nan optical microdisk cavity with an EP of second order.\nThe two coalescing eigenfrequencies and the correspond-\ning sensitivities are computed near the EP. The sensi-\ntivities are further used for an optimization scheme to\ntrack the EP along a surface in the underlying parame-\nter space. Such exceptional surfaces are used to combine\nthe sensitivity of EPs with robustness against fabrication\ntolerances [39–41].\nII.\nTHEORETICAL BACKGROUND\nIn photonics, in the steady-state regime, light scat-\ntering by an open system can be described by the time-\narXiv:2402.17648v1  [physics.comp-ph]  27 Feb 2024\n2\np\nParameter p\np\np\nEP\nReal\nImag\nFIG. 1.\nEigenfrequencies ωl and their sensitivities ∂ωl/∂p in\nthe complex frequency plane with respect to a parameter p of\nan optical microdisk cavity. A specific change in the parame-\nter cause the eigenfrequencies and the associated eigenmodes\nto coalesce at the EP. The sensitivities of the eigenfrequencies\ndiverge near the EP.\nharmonic Maxwell’s equation equipped with open bound-\nary conditions,\n∇ × µ−1\n0 ∇ × E(r, ω) − ω2ϵ(r, ω)E(r, ω) = iωJ(r),\n(1)\nwhere E(r, ω) ∈ C3 is the electric field, J(r) ∈ C3 is a\nsource term corresponding to an optical source, ω ∈ C\nis the angular frequency, and r ∈ R3 is the spatial posi-\ntion. For optical frequencies, the permeability µ(r, ω) =\nµr(r, ω)µ0 typically equals the vacuum permeability µ0.\nThe permittivity ϵ(r, ω) = ϵr(r, ω)ϵ0, where ϵr(r, ω) is the\nrelative permittivity and ϵ0 is the vacuum permittivity,\ndescribes the material dispersion and the spatial distri-\nbution of material. Problems given by Eq. (1) are called\nscattering problems. Resonance problems are given by\nEq. (1) but without a source term.\nNote that, in the\nfollowing, we consider non-Hermitian systems based on\nopen boundaries. However, the inclusion of damping as\nloss channel is also possible.\nA.\nContour integration for computing\neigenfrequency sensitivities near exceptional points\nElectromagnetic quantities q(E(r, ω)) ∈ C, such as\nreflection or transmission coefficients, are measured for\nreal excitation frequencies ω ∈ R. To compute complex-\nvalued eigenfrequencies and their sensitivities in non-\nHermitian systems, we consider the analytical continu-\nation of q(E(r, ω ∈ R)) into the complex frequency plane\nω ∈ C, which we denote by q(ω) as a short notation\nof q(E(r, ω ∈ C)) [42]. The L eigenfrequencies inside a\nchosen contour C are given by the eigenvalues ωl of the\ngeneralized eigenproblem [43–45]\nH<X = HXΩ,\n(2)\nwhere Ω = diag(ω1, . . . , ωL) is a diagonal matrix contain-\ning the eigenvalues, the columns of the matrix X ∈ CL×L\nare the eigenvectors, and\nH =\n\n\ns0\n. . .\nsL−1\n...\n...\nsL−1 . . . s2L−2\n\n , H< =\n\n\ns1 . . .\nsL\n...\n...\nsL . . . s2L−1\n\n\nare Hankel matrices with the contour-integral-based ele-\nments\nsk =\n1\n2πi\nI\nC\nωkq(ω)dω =\nL\nX\nl=1\nωk\nl al.\n(3)\nThe second equality results from applying Cauchy’s\nresidue theorem, where al are the residues of q(ω) cor-\nresponding to the eigenfrequencies ωl, and it holds for\nsimple eigenfrequencies.\nOnce the elements sk are computed, there is not only\naccess to the eigenfrequencies by solving the eigenprob-\nlem given in Eq. (2), but also to the eigenfrequency sen-\nsitivities ∂ωl/∂p, where p is some parameter. Computing\nthe derivatives in Eq. (3) yields the linear system of equa-\ntions for the unknowns ∂ωl/∂p and ∂al/∂p,\n∂sk\n∂p =\n1\n2πi\nI\nC\nωk ∂q(ω)\n∂p\ndω\n=\nL\nX\nl=1\n\u0012\nkωk−1\nl\n∂ωl\n∂p al + ωk\nl\n∂al\n∂p\n\u0013\n,\n(4)\nwhere ωl and al are known due to solving Eq. (2) and\nusing diag(a1, . . . , aL) = XT HX(V T X)−2 with the Van-\ndermonde matrix [42]\nV =\n\n\n1\n. . .\n1\nω1\n. . .\nωL\n...\n...\nωL−1\n1\n. . . ωL−1\nL\n\n .\nThe eigenfrequencies at EPs are not simple.\nHow-\never, experimental and numerical realizations show al-\nways an eigenfrequency splitting due to fabrication inac-\ncuracies [39] or numerical approximation [46]. For this\npractical reason, we can consider Eq. (4) to compute\neigenfrequency sensitivities in EP-based systems.\nThe elements sk of the Hankel matrices and their sensi-\ntivities ∂sk/∂p are obtained by numerical quadrature [47]\nof the contour integrals in Eq. (3) and Eq. (4), respec-\ntively, where q(ω) and ∂q(ω)/∂p are computed for com-\nplex frequencies on the integration contour C. The quan-\ntities q(ω) and ∂q(ω)/∂p only have to be computed once\nfor each integration point and then all contour integrals\ncan be evaluated. The integrands differ only in the weight\nfunctions ωk. Information on the numerical realization of\nthe contour integration can be found in the Refs. [48, 49].\n3\nn3 = 1\nR1\nR\nn2\nn1\n(a)\nOpen System\nMicrodisk\nx\nz\ny\n(b)\nmax\nmin\nx R\nx R\nFIG. 2.\nOptical microdisk cavity with an EP of second\norder. (a) Sketch of the two-dimensional system. Two con-\ncentric layers of different refractive indices form the cavity.\n(b) Electric field intensity of the eigenmode Ez\n8,1 correspond-\ning to the EP. The associated eigenfrequency is given by\nω8,1 ≈ ω8,2 = (6.96185 − 0.089761i) × c/R. The underlying\nparameters of the microdisk are n1 = 3.1239791, n2 = 1.5,\nand R1 = 0.4970147 × R.\nB.\nStructure exploiting algorithmic differentiation\nTo evaluate q(ω) and ∂q(ω)/∂p on the integration con-\ntour, the electric field E(r, ω) and the corresponding sen-\nsitivity ∂E(r, ω)/∂p have to be computed. For this, we\nsolve Maxwell’s equation given in Eq. (1) using the fi-\nnite element method (FEM) with the implementation of\nthe software package JCMsuite [50]. The spatial dis-\ncretization of Eq. (1) yields the linear system of equa-\ntions AE = f, where A ∈ Cn×n is the FEM system\nmatrix, E ∈ Cn is the scattered electric field in a finite-\ndimensional FEM basis, and f ∈ Cn realizes the source\nterm.\nFor the computation of ∂E(r, ω)/∂p, an approach\nbased on directly using the FEM system matrix is ap-\nplied [11, 51, 52].\nWith this direct differentiation ap-\nproach, the sensitivities of scattering solutions can be\ncomputed by\n∂E\n∂p = A−1\n\u0012∂f\n∂p − ∂A\n∂p E\n\u0013\n.\nInstead of directly computing A−1, an LU-decomposition\nof A is calculated to efficiently solve the linear system\nAE = f. The LU-decomposition is used to obtain E and\nalso ∂E/∂p. In the FEM context, an LU-decomposition\nis usually a computationally expensive step, so reusing it\nsignificantly reduces computational effort [11].\nSeveral approaches could be used to evaluate the sen-\nsitivities of the system matrix, ∂A/∂p, and of the source\nterm, ∂f/∂p. The required derivative information can\nbe provided analytically by means of corresponding com-\nputer algebra systems if the considered functional depen-\ndence is not too complicated.\nAlternatively, one may\nemploy finite differences to approximate the gradient in-\nformation. However, the resulting computational effort\nscales linearly with the number of parameters p [11]. Fur-\nthermore, finite differences only yield an approximation\nof the required derivative information, a fact that may\ncause problems if the accuracy of the derivatives is es-\nsential. For this reason, we propose AD to provide the\nrequired sensitivities within working accuracy in an ef-\nficient way [53].\nSuppose a function F : Rn 7→ Rm,\ny = F(p), is given in a computer language like C or C++.\nThen, the evaluation of F(p) can be decomposed into so-\ncalled elementary functions, the derivatives of which are\nwell known and easy to implement in a software pack-\nage. The basic differentiation rules, such as the product\nrule, the quotient rule, etc., can be applied to each state-\nment of the given code segment to calculate the overall\nderivatives. Hence, exploiting the chain rule yields the\nderivatives of the whole sequence of statements with re-\nspect to the input variables.\nOne distinguishes two basic modes of AD, namely the\nforward mode and the reverse mode.\nThe former one\nevaluates derivatives together with the function evalua-\ntion.\nIn mathematical terms, one obtains, for a given\ndirection ˙p, the Jacobian-vector product ˙y = F ′(p) ˙p.\nHence, for a unit vector ˙p = ei ∈ Rn, one obtains the\nith column of the Jacobian ∇F(p). When applying the\nreverse mode of AD, one propagates derivative informa-\ntion from the dependents y to the independents p af-\nter the evaluation of the function F(p).\nThis yields,\nfor a given weight vector ¯y, the vector-Jacobian prod-\nuct ¯p = ¯y⊤F ′(p).\nSimilar to the forward mode, for a\nunit vector ¯y = ej ∈ Rm, one obtains the jth row of the\nJacobian ∇F(p).\nOver the past decades, extensive research activities led\nto a thorough understanding and analysis of these two\nbasic modes of AD, where the complexity results with\nrespect to the required runtime are based on the oper-\nation count OF , i.e., the number of floating point oper-\nations required to evaluate F(p). The forward mode of\nAD yields one column of the Jacobian ∇F for no more\nthan three times OF [54, 55]. Using the reverse mode of\nAD, one row of ∇F is obtained for no more than four\n4\nx c/R\nx R\nx R\nx c/R\nx c/R2\nx c/R2\n(b)\n(c)\n(d)\n(a)\nFIG. 3.\nVariation of the parameter R1 near the EP with the parameters n1 = 3.1239791, n2 = 1.5, and R1 = 0.4970147 × R.\nFor each R1, two eigenfrequencies ω8,1 and ω8,2 are obtained. The values for R1 result from an equidistant spacing in the\ninterval [0.999, 1.001] × R1 with 50 points, where the first point leads to ωA\n8,1 and ωA\n8,2 and the 25th point leads to ωB\n8,1 and\nωB\n8,2. The numerical results can be compared with the semi-analytical solution. (a) Real parts of the eigenfrequencies ω8,l.\n(b) Imaginary parts of ω8,l. (c) Real parts of the eigenfrequency sensitivities ∂ω8,l/∂R1. (d) Imaginary parts of ∂ω8,l/∂R1.\ntimes OF , also see Ref. [54]. It is important to note that\nthis bound for the reverse mode is completely indepen-\ndent of the number n of input variables. Hence, if m = 1,\nthe gradient of the then scalar-valued function F can be\ncalculated for four function evaluations. This observa-\ntion is called cheap gradient result and is used extensively\nfor derivative-based optimization approaches. However,\nthe reverse mode requires the knowledge of intermediate\nresults computed during the function evaluation. There-\nfore, the basic implementation of the reverse mode leads\nto a memory requirement that is proportional to the op-\neration count OF . For a considerable amount of applica-\ntions, this fact does not cause any problems. For prob-\nlems of larger scale, checkpointing strategies have been\ndeveloped, see, e.g., Ref. [56]. Here, instead of storing all\nintermediates, only a few of them are recorded. Subse-\nquently, the missing intermediate values are recomputed\nusing the data stored in the checkpoints. Hence, these\ncheckpointing strategies seek for a compromise between\nstoring and recomputing data.\nBesides the theoretical\nfoundation, numerous AD tools have been developed,\ne.g., CppAD [57], ADOL-C [58], and Tapenade [59]. Due\nto the language features, the implementation of the AD\npackages is based on source transformation for Fortran\ncodes and operator overloading for C or C++ codes.\nWhen applying these AD-tools in a black box fashion\nto large-scale simulation codes, one usually does not ob-\nserve the theoretical runtime factors mentioned above,\ne.g., due to memory issues. Therefore, a structure ex-\nploiting approach, where AD is only applied to relevant\nparts of the code, as used in this work, is very often ben-\neficial for the efficient calculation of the derivatives. This\nincludes also the appropriate choice of the mode of AD.\nFor the application considered here, where, e.g., deriva-\ntives of a matrix with respect to a parameter vector are\nrequired, the forward mode is the method of choice.\nIII.\nAPPLICATION TO A MICRODISK CAVITY\nWe\napply\nthe\npresented\nframework\nto\na\ntwo-\ndimensional optical microdisk cavity with two concentric\nlayers of different refractive indices embedded in an open\nenvironment [60]. The system is sketched in Fig. 2(a).\nThe interest lies in the electric fields which are perpen-\ndicular to the cavity plane (TM polarization). This sim-\nplifies the time-harmonic Maxwell’s equations (1) to the\nscalar Helmholtz equation\n∇2Ez\nm,l(x, y) + n2(x, y)\nω2\nm,l\nc2 Ez\nm,l(x, y) = 0,\n(5)\nwhere Ez\nm,l(x, y) is the z-component of the l-th eigen-\nmode with the azimuthal mode number m ∈ Z, the re-\nfractive index n(x, y) = √ϵrµr describes the material in\nthe region of interest, ωm,l ∈ C is the eigenfrequency, and\nc is the speed of light.\n5\nEP\nx c/R\nC\nx c/R\n(a)\n(b)\n(c)\nx R\nFIG. 4.\nComputing eigenfrequencies and their sensitivities near the EP. (a) Complex frequency plane with integration\ncontour C. The center of the contour is at ωEP and the radius is given by 0.01 × Re(ωEP). Four eigenfrequencies from Fig. 3(a)\nare shown, where ωA\n8,1 and ωA\n8,2 or ωB\n8,1 and ωB\n8,2 are the result of a contour integration with a different R1 in each case. (b)\nRelative error |ω8,1−ωqex|/|ωqex| with respect to the number of integration points on the contour C, where ωqex is the quasiexact\nsolution computed with 64 integration points. The maximum side length of the FEM mesh is 0.05 × R. (c) Relative error\nwith respect to maximum side length of the FEM mesh, where ωqex is the quasiexact solution computed with a maximum side\nlength of 0.0125 × R. The number of integration points is 16. Legend as before.\nA.\nSemi-analytical solution\nSemi-analytical results for Maxwell’s equations can be\nobtained in the case of two concentric dielectric disks\n[61]. As the system is rotational invariant, the eigenfre-\nquencies are characterized by an azimuthal mode number\nm ∈ Z. Therefore, combining the continuity conditions\nat the dielectric interfaces with the outgoing wave con-\ndition results in a conditional equation Sm(ωm,l) = 0 for\nthe eigenfrequency ωm,l. In the case of TM polarization,\nthe function Sm(ω) is given by\nSm(ω) = n2Jm(k1R1)H(1)′\nm (k3R)\nh\nH(2)′\nm (k2R1)H(1)\nm (k2R) − H(1)′\nm (k2R1)H(2)\nm (k2R)\ni\n− n2\n2Jm(k1R1)H(1)\nm (k3R)\nh\nH(2)′\nm (k2R1)H(1)′\nm (k2R) − H(1)′\nm (k2R1)H(2)′\nm (k2R)\ni\n− n1J′\nm(k1R1)H(1)′\nm (k3R)\nh\nH(2)\nm (k2R1)H(1)\nm (k2R) − H(1)\nm (k2R1)H(2)\nm (k2R)\ni\n+ n1n2J′\nm(k1R1)H(1)\nm (k3R)\nh\nH(2)\nm (k2R1)H(1)′\nm (k2R) − H(1)\nm (k2R1)H(2)′\nm (k2R)\ni\n,\n(6)\nwhere kj = njω/c and J(1)\nm , J(2)\nm , H(1)\nm , H(2)\nm\nare Bessel-\nand Hankel functions of first and second kind and or-\nder m, respectively. The complex roots of Sm(ω) need\nto be determined numerically, e.g., by Newton’s method,\nwhere an initial guess can be taken from a single disk with\nmodified refractive index [61]. With the implicit function\ntheorem, the derivative of the eigenfrequency ωm,l with\nrespect to a parameter p ∈ {n1, n2, n3, R1, R} can be cal-\nculated as\n∂ωm,l\n∂p\n= −\n\u0014∂Sm\n∂ω (ωm,l)\n\u0015−1 ∂Sm\n∂p (ωm,l).\nThe partial derivatives ∂Sm/∂ω and ∂Sm/∂p are inde-\npendent of the eigenfrequency. Therefore, they can be\ncalculated analytically with a common computer algebra\nsystem from Eq. (6), see also Ref. [49].\nB.\nNumerical solution\nTo numerically solve Eq. (5), the software RPEx-\npand [48] is applied.\nThe eigenfrequencies ωm,l and\nthe corresponding sensitivities ∂ωm,l/∂p with respect\nto a parameter p are computed by using the contour-\nintegral-based framework.\nHere, the quantity q(ω) is\nthe z-component of the electric field at the position\n6\n(a)\nx c/R\nx c/R\nEP\n(b)\nx R\nn2 = 1.5\nFIG. 5.\nTracking the EP in the parameter space. (a) Numer-\nical and semi-analytical results for the trajectory of the eigen-\nfrequency ωEP. The arrow indicates the eigenfrequency ωEP\nfrom Ref. [60]. (b) Corresponding parameter combinations.\nFor each point in the parameter space, the parameter n2 is\nshifted by 0.0025.\n[x, y] = [0, 0.9 × R] resulting from an z-polarized plane\nwave travelling in y-direction.\nRPExpand contains an\ninterface to the software JCMsuite.\nThe approach of\nAD is utilized within JCMsuite. Convergence with re-\nspect to the FEM parameters is ensured by refining the\nspatial mesh, where the degree of the polynomial ansatz\nfunctions is set to four.\nFor computational efficiency,\nthe mirror symmetries of the system are exploited. Fur-\nther information on the numerical implementation can\nbe found in Ref. [49].\nWe study an EP of second order [60].\nTwo eigen-\nmodes with an azimuthal mode number m = 8 and\nthe corresponding eigenfrequencies coalesce at the pa-\nrameter combination n1 = 3.1239791, n2 = 1.5, and\nR1 = 0.4970147 × R. The electric field intensity of a cor-\nresponding eigenmode Ez\n8,1 is shown in Fig. 2(b). The\neigenfrequency is given by ω8,1 ≈ ω8,2 = (6.96185 −\n0.089761i)×c/R. In the following, for a simpler notation,\nwe denote this specific eigenfrequency by ωEP.\nThe\neigenfrequencies\nω8,l\nand\ntheir\nsensitivities\n∂ω8,l/∂R1 near the EP are investigated.\nFigure 3(a)\nshows the trajectories of the real parts of the eigenfre-\nquencies ω8,l when the parameter R1 is varied and n1\nand n2 are fixed. For each radius R1, a contour integral\nis computed leading to two eigenfrequencies. The super-\nscript letters A and B describe two points in the param-\neter space that differ in the radius R1. When R1 is in-\ncreased, i.e., going from ωA\n8,1 to ωB\n8,1 or ωA\n8,2 to ωB\n8,2, then\nthe two eigenfrequencies converge.\nFigure 3(b) shows\nthe imaginary parts and Fig. 3(c) and Fig. 3(d) show the\ncorresponding sensitivities. The results can be compared\nwith the semi-analytical solution ωan. For ωB\n8,1, the rela-\ntive error |Re(ωB\n8,1−ωan)/Re(ωan)| is smaller than 7×10−7\nand, for the corresponding imaginary part, the relative\nerror is smaller than 5 × 10−5. The relative error for the\nunderlying sensitivities is smaller than 2 × 10−3 for real\nand imaginary part. It can be observed that the sensitiv-\nities diverge in the vicinity of the EP. The divergence can\nbe explained by the square root dependence of the eigen-\nfrequencies on perturbations when the system is near the\nEP [13].\nFor all calculations corresponding to Fig. 3, the con-\ntour C shown in Fig. 4(a) with 16 integration points and\na maximum side length of the FEM mesh of 0.05×R are\nused. Figure 4(a) also sketches the locations of the eigen-\nfrequencies ωA\n8,1, ωA\n8,2, ωB\n8,1, and ωB\n8,2 with the trajectories\nwhen R1 is varied in the direction of the parameter for\nthe EP. To demonstrate the accuracy of the approach,\nFig. 4(b) shows the relative error of the absolute value\nof ωA\n8,1, ∂ωA\n8,1/∂R1, ωB\n8,1, and ∂ωB\n8,1/∂R1 with respect to\nthe number of integration points on the contour C. Fig-\nure 4(c) shows the relative error with respect to the max-\nimum side length of the FEM mesh. It can be observed\nthat the relative error for the sensitivities is smaller for\nωA\n8,1, which lies further away from the EP. The closer\nthe two calculated eigenfrequencies lie to each other, the\nless accurate the results are. With only 16 integration\npoints, it is possible to obtain a maximum relative error\nof smaller than 10−5 for the eigenfrequency sensitivities\n∂ω8,1/∂R1 for both points A and B in the parameter\nspace. Using a maximum side length of the FEM mesh\nof 0.05 × R is sufficient to achieve a maximum relative\nerror of smaller than 3 × 10−3.\nNote that, for simplicity, we only show the sensitivi-\nties ∂ω8,l/∂R1. The results for ∂ω8,l/∂n1 and ∂ω8,l/∂n2\nexhibit a similar behavior.\nC.\nExceptional surface\nWe track the EP in the parameter space by using\nNewton’s method with the sensitivities ∂ω8,l/∂n1 and\n∂ω8,l/∂R1. We are looking for the zeros of the squared\neigenfrequency splitting (ω8,1 − ω8,2)2. The reason for\nchoosing the square of the splitting is the square root\ndependency of the eigenfrequencies near the EP. The\nstarting point is the parameter combination correspond-\ning to ωB\n8,1 and ωB\n8,2 shown in Fig. 3(a), given by n1 =\n3.1239791, n2 = 1.5, and R1 = 0.497004557 × R. With a\nfixed n2 = 1.5, a certain tolerance, and a few iterations\nof Newton’s method, the two eigenfrequencies ωEP\n8,1 =\n(6.961993 − 0.089638i) × c/R and ωEP\n8,2 = (6.961996 −\n0.089642i) × c/R with the parameters n1 = 3.123979246\nand R1 = 0.497014753 × R are obtained.\nThen, the\nparameter n2 is shifted by a constant value of 0.0025\nand Newton’s method is restarted with the shifted n2\ntogether with the previously calculated values for the\n7\nparameters n1 and R1, and with a new integration con-\ntour centered at the previously computed eigenfrequency.\nThe results of this procedure are shown in Fig. 5, where\nFig. 5(a) contains the trajectory of ωEP and Fig. 5(b)\nshows the corresponding parameter combinations.\nAlthough the sensitivities diverge near the EP, the nu-\nmerical calculations of the sensitivities are still accurate\nenough for Newton’s method to work very well. There-\nfore, the exceptional surface is identified as a curve in\nthe parameter space spanned by R1 and n1. Figure 5\nalso contains the semi-analytical solution and it agrees\nwith the numerical results.\nIV.\nCONCLUSION\nEigenfrequency sensitivities near EPs were investi-\ngated. For this purpose, we developed a framework based\non contour integration with AD. We applied a numerical\nimplementation of the framework to an optical microdisk\ncavity with an EP of second order. It was shown that\nthe eigenfrequency sensitivities near the EP can be cap-\ntured accurately and efficiently.\nThe sensitivities were\napplied to track the EP in the parameter space. A semi-\nanalytical solution for the system was derived and used\nto validate the numerical results.\nThe presented contour-integral-based framework can-\nnot only be applied to a benchmark problem as studied\nin this work, but also to any resonant system, e.g., with\ncomplex geometry or with an EP of arbitrary order. The\ncombination of contour integration with AD makes the\nframework very general since the approach is essentially\nbased on solving scattering problems. The treatment of\nthe corresponding linear systems of equations is a stan-\ndard task for state-of-the-art software packages used in\nthe field of computational physics.\nComputing eigenfrequency sensitivities near EPs can\naid in optimizing setups for EP-based sensors. For ex-\nample, exceptional surfaces [62] in higher dimensional\nparameter spaces can be identified, which can then be\nused to optimize an EP along such a surface to maximize\nsensitivity to a targeted perturbation while minimizing\nthe response to other perturbations that may arise from\nfabrication tolerances or noise. For such an optimization\nscheme, the numerically accurate and efficient computa-\ntion of eigenfrequency sensitivities with respect to spe-\ncific system parameters is crucial.\nDATA AND CODE AVAILABILITY\nSupplementary data tables and source code for the nu-\nmerical experiments for this work can be found in the\nopen access data publication [49]. Links to further AD\ntools and comprehensive information on AD can be found\nat www.autodiff.org.\nACKNOWLEDGEMENTS\nWe acknowledge funding by the Deutsche Forschungs-\ngemeinschaft (DFG, German Research Foundation) un-\nder Germany’s Excellence Strategy - The Berlin Mathe-\nmatics Research Center MATH+ (EXC-2046/1, project\nID: 390685689) and by the German Federal Ministry\nof Education and Research (BMBF Forschungscampus\nMODAL, project 05M20ZBM).\n[1] S. Nie and S. R. Emory, Probing Single Molecules and\nSingle Nanoparticles by Surface-Enhanced Raman Scat-\ntering, Science 275, 1102 (1997).\n[2] G. M. Akselrod, C. Argyropoulos, T. B. Hoang, C. Cirac`ı,\nC. Fang, J. Huang, D. R. Smith, and M. H. Mikkelsen,\nProbing the mechanisms of large Purcell enhancement in\nplasmonic nanoantennas, Nat. Photonics 8, 835 (2014).\n[3] P.\nSenellart,\nG.\nSolomon,\nand\nA.\nWhite,\nHigh-\nperformance semiconductor quantum-dot single-photon\nsources, Nat. Nanotechnol. 12, 1026 (2017).\n[4] P. Lalanne, W. Yan, K. Vynck, C. Sauvan, and J.-P.\nHugonin, Light Interaction with Photonic and Plasmonic\nResonances, Laser Photonics Rev. 12, 1700113 (2018).\n[5] S. Dyatlov and M. Zworski, Mathematical theory of\nscattering resonances (American Mathematical Society,\nProvidence, Rhode Island, 2019).\n[6] P. Lalanne, W. Yan, A. Gras, C. Sauvan, J.-P. Hugo-\nnin, M. Besbes, G. Dem´esy, M. D. Truong, B. Gralak,\nF. Zolla,\nA. Nicolet,\nF. Binkowski,\nL. Zschiedrich,\nS. Burger, J. Zimmerling, R. Remis, P. Urbach, H. T.\nLiu, and T. Weiss, Quasinormal mode solvers for res-\nonators with dispersive materials, J. Opt. Soc. Am. A\n36, 686 (2019).\n[7] G. Dem´esy, A. Nicolet, B. Gralak, C. Geuzaine, C. Cam-\npos, and J. E. Roman, Non-linear eigenvalue problems\nwith GetDP and SLEPc: Eigenmode computations of\nfrequency-dispersive photonic open structures, Comput.\nPhys. Commun. 257, 107509 (2020).\n[8] T. Wu, D. Arrivault, W. Yan, and P. Lalanne, Modal\nanalysis of electromagnetic resonators: User guide for the\nMAN program, Comput. Phys. Commun. 284, 108627\n(2023).\n[9] W. Yan, P. Lalanne, and M. Qiu, Shape Deformation of\nNanoresonator: A Quasinormal-Mode Perturbation The-\nory, Phys. Rev. Lett. 125, 013901 (2020).\n[10] J. Jensen and O. Sigmund, Topology optimization for\nnano-photonics, Laser Photonics Rev. 5, 308 (2011).\n[11] F. Binkowski, F. Betz, M. Hammerschmidt, P.-I. Schnei-\nder, L. Zschiedrich, and S. Burger, Computation of eigen-\nfrequency sensitivities using Riesz projections for effi-\ncient optimization of nanophotonic resonators, Commun.\nPhys. 5, 202 (2022).\n[12] M.-A. Miri and A. Al`u, Exceptional points in optics and\nphotonics, Science 363, eaar7709 (2019).\n8\n[13] T. Kato, Perturbation Theory for Linear Operators, 2nd\ned. (Springer-Verlag Berlin Heidelberg, 1995).\n[14] J. Wiersig, Enhancing the Sensitivity of Frequency and\nEnergy Splitting Detection by Using Exceptional Points:\nApplication to Microcavity Sensors for Single-Particle\nDetection, Phys. Rev. Lett. 112, 203901 (2014).\n[15] J. Wiersig, Sensors operating at exceptional points: Gen-\neral theory, Phys. Rev. A 93, 033809 (2016).\n[16] W. Chen, S¸. K. ¨Ozdemir, G. Zhao, J. Wiersig, and\nL. Yang, Exceptional points enhance sensing in an op-\ntical microcavity, Nature 548, 192 (2017).\n[17] H. Hodaei, A. Hassan, S. Wittek, H. Carcia-Cracia,\nR. El-Ganainy, D. Christodoulides, and M. Khajavikhan,\nEnhanced sensitivity at higher-order exceptional points,\nNature 548, 187 (2017).\n[18] Y.-H. Lai, Y.-K. Lu, M.-G. Suh, Z. Yuan, and K. Vahala,\nObservation of the exceptional-point-enhanced Sagnac\neffect, Nature 576, 65 (2019).\n[19] C. Zeng, Y. Sun, G. Li, Y. Li, H. Jiang, Y. Yang, and\nH. Chen, Enhanced sensitivity at high-order exceptional\npoints in a passive wireless sensing system, Opt. Express\n27, 27562 (2019).\n[20] M. P. Hokmabadi, A. Schumer, D. N. Christodoulides,\nand M. Khajavikhan, Non-Hermitian ring laser gyro-\nscopes with enhanced Sagnac sensitivity, Nature 576, 70\n(2019).\n[21] J. Wiersig, Review of exceptional point-based sensors,\nPhoton. Res. 8, 1457 (2020).\n[22] J.-H. Park, A. Ndao, W. Cai, L. Hsu, A. Kodigala,\nT. Lepetit, Y.-H. Lo, and B. Kant´e, Symmetry-breaking-\ninduced plasmonic exceptional points and nanoscale sens-\ning, Nat. Phys. 16, 462 (2020).\n[23] J. Kullig and J. Wiersig, Microdisk cavities with a Brew-\nster notch, Phys. Rev. Res. 3, 023202 (2021).\n[24] J. Kullig, D. Grom, S. Klembt, and J. Wiersig, Higher-\norder exceptional points in waveguide-coupled microcav-\nities: perturbation induced frequency splitting and mode\npatterns, Photon. Res. 11, A54 (2023).\n[25] B.\nPeng,\nS¸.\nK.\n¨Ozdemir,\nS.\nRotter,\nH.\nYilmaz,\nM. Liertzer, F. Monfi, C. M. Bender, F. Nori, and\nL. Yang, Loss-induced suppression and revival of lasing,\nScience 17, 328 (2014).\n[26] P. Miao, Z. Zhang, J. Sun, W. Walasik, S. Longhi, N. M.\nLitchinitser, and L. Feng, Orbital angular momentum mi-\ncrolaser, Science 353, 464 (2016).\n[27] W. R. Sweeney, C. W. Hsu, S. Rotter, and A. D. Stone,\nPerfectly Absorbing Exceptional Points and Chiral Ab-\nsorbers, Phys. Rev. Lett. 122, 093901 (2019).\n[28] Y. Xu, L. Li, H. Jeong, S. Kim, I. Kim, J. Rho, and\nY. Liu, Subwavelength control of light transport at the\nexceptional point by non-Hermitian metagratings, Sci.\nAdv. 9, eadf3510 (2023).\n[29] H.\nHodaei,\nM.-A.\nMiri,\nM.\nHeinrich,\nD.\nN.\nChristodoulides,\nand\nM.\nKhajavikhan,\nParity-\ntime–symmetric\nmicroring\nlasers,\nScience\n346,\n975\n(2014).\n[30] C. Wang, X. Jiang, G. Zhao, M. Zhang, C. W. Hsu,\nB. Peng, A. D. Stone, L. Jiang, and L. Yang, Electromag-\nnetically induced transparency at a chiral exceptional\npoint, Nat. Phys. 16, 334 (2020).\n[31] Q. Zhong, S. Ozdemir, A. Eisfeld, A. Metelmann, and\nR. El-Ganainy, Exceptional-Point-Based Optical Ampli-\nfiers, Phys. Rev. Appl. 13, 014070 (2020).\n[32] S. Tao, S. Mao, J. Song, Q. Fang, M. Yu, G. Lo, and\nD. Kwong, Ultra-high order ring resonator system with\nsharp transmission peaks, Opt. Express 18, 393 (2010).\n[33] P. Chamorro-Posada, F. Fraile-Pelaez, and F. J. Diaz-\nOtero, Micro-Ring Chains With High-Order Resonances,\nJ. Lightwave Technol. 29, 1514 (2011).\n[34] Z. Xiao, H. Li, T. Kottos, and A. Al`u, Enhanced Sensing\nand Nondegraded Thermal Noise Performance Based on\nPT -Symmetric Electronic Circuits with a Sixth-Order\nExceptional Point, Phys. Rev. Lett. 123, 213901 (2019).\n[35] J. Wiersig, Prospects and fundamental limits in ex-\nceptional point-based sensing, Nat. Commun. 11, 2454\n(2020).\n[36] H. Wang, Y.-H. Lai, Z. Yuan, M.-G. Suh, and K. Vahala,\nPetermann-factor sensitivity limit near an exceptional\npoint in a Brillouin ring laser gyroscope, Nat. Commun.\n11, 1610 (2020).\n[37] R. Kononchuk, J. Cai, F. Ellis, R. Thevamaran, and\nT. Kottos, Exceptional-point-based accelerometers with\nenhanced signal-to-noise ratio, Nature 607, 697 (2022).\n[38] J. Wiersig, Petermann factors and phase rigidities near\nexceptional points, Phys. Rev. Res. 5, 033042 (2023).\n[39] Q.\nZhong,\nJ.\nRen,\nM.\nKhajavikhan,\nD.\nN.\nChristodoulides, S¸. K. ¨Ozdemir, and R. El-Ganainy,\nSensing with Exceptional Surfaces in Order to Combine\nSensitivity with Robustness, Phys. Rev. Lett. 122,\n153902 (2019).\n[40] Q. Zhong, S. Nelson, S¸. K. ¨Ozdemir, and R. El-Ganainy,\nControlling direction absorption with chiral exceptional\nsurfaces, Opt. Lett. 44, 5242 (2019).\n[41] S. Soleymani, Q. Zhong, M. Mokim, S. Rotter, R. El-\nGanainy, and S¸. K. ¨Ozdemir, Chiral and degenerate per-\nfect absorption on exceptional surfaces, Nat. Commun.\n13, 599 (2022).\n[42] F. Binkowski, F. Betz, R. Colom, P. Genevet, and\nS. Burger, Poles and zeros in non-Hermitian systems: Ap-\nplication to photonics, Phys. Rev. B 109, 045414 (2024).\n[43] L. M. Delves and J. N. Lyness, A numerical method for\nlocating the zeros of an analytic function, Math. Comp.\n21, 543 (1967).\n[44] P. Kravanja and M. V. Barel, Computing the Zeros of\nAnalytic Functions, Lect. Notes Math. 1727 (Springer,\nNew York, 2000).\n[45] A. P. Austin, P. Kravanja, and L. N. Trefethen, Numer-\nical Algorithms Based on Analytic Function Values at\nRoots of Unity, SIAM J. Numer. Anal. 52, 1795 (2014).\n[46] J. Wiersig, Revisiting the hierarchical construction of\nhigher-order exceptional points, Phys. Rev. A 106,\n063526 (2022).\n[47] L. N. Trefethen and J. Weideman, The Exponentially\nConvergent Trapezoidal Rule, SIAM Rev. 56, 385 (2014).\n[48] F. Betz, F. Binkowski, and S. Burger, RPExpand: Soft-\nware for Riesz projection expansion of resonance phe-\nnomena, SoftwareX 15, 100763 (2021).\n[49] F.\nBinkowski,\nJ.\nKullig,\nF.\nBetz,\nL.\nZschiedrich,\nA. Walther, J. Wiersig, and S. Burger, Source code\nand simulation results: Computing eigenfrequency sen-\nsitivities near exceptional points, Zenodo (2024), doi:\n10.5281/zenodo.10715639.\n[50] J. Pomplun, S. Burger, L. Zschiedrich, and F. Schmidt,\nAdaptive finite element method for simulation of optical\nnano structures, Phys. Status Solidi B 244, 3419 (2007).\n9\n[51] N. Nikolova, J. Bandler, and M. Bakr, Adjoint techniques\nfor sensitivity analysis in high-frequency structure CAD,\nIEEE Trans. Microw. Theory Techn. 52, 403 (2004).\n[52] S. Burger, L. Zschiedrich, J. Pomplun, F. Schmidt, and\nB. Bodermann, Fast simulation method for parameter\nreconstruction in optical metrology, Proc. SPIE 8681,\n868119 (2013).\n[53] A. Griewank, K. Kulshreshtha, and A. Walther, On the\nnumerical stability of algorithmic differentiation, Com-\nputing 94, 125 (2012).\n[54] A. Griewank and A. Walther, Evaluating Derivatives:\nPrinciples and Techniques of Algorithmic Differentiation\n(SIAM, Philadelphia, 2008).\n[55] U. Naumann, The Art of Differentiating Computer Pro-\ngrams: An Introduction to Algorithmic Differentiation\n(SIAM, Philadelphia, 2012).\n[56] A. Griewank and A. Walther, Algorithm 799: revolve:\nan implementation of checkpointing for the reverse or ad-\njoint mode of computational differentiation, ACM Trans.\nMath. Softw. 26, 19 (2000).\n[57] B. Bell, CppAD, https://github.com/coin-or/CppAD.\n[58] A. Walther and A. Griewank, Getting started with\nADOL-C, in Combinatorial Scientific Computing, edited\nby U. Naumann and O. Schenk (Chapman-Hall CRC\nComputational Science, 2012) Chap. 7, pp. 181–202.\n[59] L. Hasco¨et and V. Pascual, The Tapenade automatic\ndifferentiation tool, principles, model, and specification,\nACM Trans. Math. Softw. 39, 43 (2013).\n[60] J. Kullig, C.-H. Yi, M. Hentschel, and J. Wiersig, Excep-\ntional points of third-order in a layered optical microdisk\ncavity, New J. Phys. 20, 083016 (2018).\n[61] M. Hentschel and K. Richter, Quantum chaos in optical\nsystems: The annular billiard, Phys. Rev. E 66, 056207\n(2002).\n[62] H. Kim, S. Gwak, H.-H. Yu, J. Ryu, C.-M. Kim, and C.-\nH. Yi, Maximization of a frequency splitting on continu-\nous exceptional points in asymmetric optical microdisks,\nOpt. Express 31, 12634 (2023).\n"
}