{
    "optim": "OUT-OF-TIME-ORDERED CORRELATORS FOR WIGNER MATRICES Giorgio Cipolloni∗ gc4233@princeton.edu L´aszl´o Erd˝os† lerdos@ist.ac.at Joscha Henheik† joscha.henheik@ist.ac.at Abstract. We consider the time evolution of the out-of-time-ordered correlator (OTOC) of two general observables A and B in a mean field chaotic quantum system described by a random Wigner matrix as its Hamiltonian. We rigorously identify three time regimes separated by the physically relevant scrambling and relaxation times. The main feature of our analysis is that we express the error terms in the optimal Schatten (tracial) norms of the observables, allowing us to track the exact dependence of the errors on their rank. In particular, for significantly overlapping observables with low rank the OTOC is shown to exhibit a significant local maximum at the scrambling time, a feature that may not have been noticed in the physics literature before. Our main tool is a novel multi-resolvent local law with Schatten norms that unifies and improves previous local laws involving either the much cruder operator norm (cf. [10]) or the Hilbert-Schmidt norm (cf. [11]). Key words: Relaxation, Scrambling time, Multi-resolvent local law, Schatten norm. 2020 Mathematics Subject Classification: 60B20, 82C10. 1. Introduction A basic feature of a strongly interacting quantum system is that local initial states become non-local along the unitary time evolution, in particular they become increasingly harder to distinguish by local observables. The simplest way to detect this chaotic behavior is to monitor the overlap ⟨A(t)B⟩ of the Heisenberg time evolution A(t) := e−itHAeitH of an observable A with another static observable B, where H is the Hamiltonian and A, B are Hermitian operators. Here ⟨M⟩ := 1 N TrM denotes the normalized trace of an N × N matrix, N is the dimension of the quantum state space. As time goes on, the overlap between two local observables converges to its stationary value in a process called quantum thermalisation. Since this stationary value is practically1 factorized, ⟨A⟩⟨B⟩, the original observable A becomes hardly detectable from its time evolution by local observables B. A more refined measure of the dynamically evolving quantum chaos is the out-of-time-ordered correlator (OTOC) of two observables, defined as2 CA,B(t) := 1 2  \f\f[A(t), B] \f\f2\u000b (1.1) measuring the evolution of the commutator of A(t) and B. Starting with commuting observables, [A, B] = 0, this quantity initially grows, expressing how the time evolution A(t) of a local observable spreads (or scrambles) to non-local degrees of freedom expressed by B. The moment when this growth stops is called3 the scrambling time t∗. Scrambling is closely related to thermalisation, but it typically involves non-local observables B. Thus in a quantum system with local interactions, the thermalisation time is smaller than t∗ and it is independent of the system size, while the scrambling takes place on a longer time scale until local information is shared with all degrees of freedom in the system. Beyond the scrambling time, the OTOC settles to constant value at a larger time scale called the relaxation time, and then it remains essentially unchanged. ∗Princeton Center for Theoretical Science and Department of Mathematics, Princeton University, Princeton, NJ 08544, USA. †Institute of Science and Technology Austria, Am Campus 1, 3400 Klosterneuburg, Austria. †Supported by ERC Advanced Grant “RMTBeyond” No. 101020331. 1In a closed quantum system with finitely many degrees of freedom the initial state is never fully lost as the stationary value still slightly depends on the original overlap ⟨AB⟩, but it is suppressed by N; e.g. it follows from (1.2) that lim t→∞ EGUE⟨A(t)B⟩ = \u0010 1 − 1 N + 1 \u0011 ⟨A⟩⟨B⟩ + 1 N + 1 ⟨AB⟩. 2In the physics literature, the OTOC is usually defined without the factor 1/2. We chose it, however, for convenience. 3We remark that some papers use slightly different definition, here we follow the terminology of [27], [17, Section 3.3]. 1 arXiv:2402.17609v1  [math-ph]  27 Feb 2024 2 CIPOLLONI, ERD ˝OS, AND HENHEIK The fine distinction between thermalisation and scrambling became very popular in physics about 15 years ago motivated by the fundamental papers by Hayden and Preskill [28] and Sekino and Susskind [40] related to the black hole information paradox. The concept of the OTOC in quantum chaos research was introduced in Kitaev’s lectures [30] on the connection between the Sachdev-Ye-Kitaev (SYK) model and black holes. Owing to these fascinating connections, the physics literature on OTOC in various interacting quantum systems has become enormous; we refer the reader to the reviews [41, 27] and extensive references therein. In contrast, OTOC has basically not been considered in the mathematical literature apart from [34] that studies a very different model than our current random matrix setup. Besides the OTOC, quantum chaos has several other signatures: the conventional one is the spectral statistics of the Hamiltonian. Following E. Wigner’s groundbreaking observation, in a sufficiently chaotic quantum system the local eigenvalue statistics are given by the universal Wigner-Dyson distribution that depends only on the basic symmetries of the system. In the physics literature the spectral statistics are often described by the spectral form factor (SFF), or two point spectral correlator, defined as r2(t) := E|⟨eitH⟩|2, where E indicates a statistical averaging over an ensemble of Hamiltonians. It is well known that the SFF tends to become universal for large times4, while it still reflects properties of the actual quantum system (especially its density of states) for shorter times. A good physics summary is found in [17], while a recent mathematical analysis of the SFF for general Wigner matrices was given in [9]; more precise formulas are available for exactly solvable ensembles [23, 24, 25]. The OTOC is a more refined description of quantum chaos than the SFF, as it also involves observ- ables. In particular, the SFF misses important features like the sensitivity of chaos to the locality of the observables or early time chaos, i.e. the exponential growth of the OTOC for certain strongly interact- ing systems like SYK (called fast scramblers [40]) versus the polynomial growth for slow scramblers like certain weakly chaotic systems (see, e.g. [26, Section II] and references therein). Note that the SFF can be recovered from the OTOC by averaging, either over the observables or over the unitary group in case of unitarily invariant Hamiltonians, see [17]. For example, if H is a GUE random matrix, then [17, Eq. (57)-(58)]) EGUE⟨A(t)B⟩ = ⟨A⟩⟨B⟩ + N 2r2(t) − 1 N 2 − 1 \u0002 ⟨AB⟩ − ⟨A⟩⟨B⟩ \u0003 , (1.2) with r2(t) = \u0010J1(2t) t \u00112 + 1 N − 1 N \u0010 1 − t 2N \u0011 1(t ≤ 2N), where J1 is the Bessel function of the first kind of order one. Thus r2(t) can be expressed from ⟨A(t)B⟩. A similar relation holds between the OTOC and the four point spectral correlator. The main goal of the current paper is to give a comprehensive mathematical analysis of the OTOC with general observables A, B, when the Hamiltonian H is a Wigner matrix. Wigner matrices represent the Hamiltonian of the most chaotic quantum systems with matrix elements being independent, identically distributed (i.i.d.) random variables. In the physics literature, random matrix theory (RMT) is often used as a test case to see to what extent this relatively simple model mimics the physics of more complicated systems such as interacting many-body models (like SYK) or even models with nontrivial spatial structure (like spin chains). Spectral statistics are remarkably robust, especially the universality of the large time (so-called plateau) regime of the SFF has proved to be ubiquitous in many different chaotic quantum systems, in accordance with the celebrated Bohigas-Giannoni-Schmit conjecture [5]. The OTOC is a more delicate quantity and, admittedly, its several interesting features that appear in more realistic strongly coupled systems are not captured by RMT. For example, the early time exponential growth of the OTOC is not present in RMT and there is no qualitative difference between the thermalisation and scrambling times since H is mean field (see [17, Section 3.3] for a detailed analysis). The difference between chaotic and integrable systems or the effect of their possible coexistence on the OTOC (studied e.g. in [26]) are also not visible in RMT since Wigner matrices are fully chaotic. Nevertheless, RMT becomes a good description beyond the scrambling time as claimed in [17, Section 3.3] and demonstrated in [17, Section 6]. The calculations are performed under the unitary invariance assumption and without controlling the error terms. In the main Theorem 2.2 of the current work, using very different methods, we rigorously describe the behaviour of CA,B(t) up to very long times for general Wigner matrices (no unitary invariance assumed). We mimic the locality of the observables by considering matrices A, B that are far from being full rank 4See the celebrated slope-dip-ramp-plateau picture, e.g. in [35]. OUT-OF-TIME-ORDERED CORRELATORS FOR WIGNER MATRICES 3 and track this effect throughout all error terms by using tracial norms that are sensitive to the rank. We distinguish three time regimes (see Figure 1 and Section 2.1); for short times (before the scrambling time t∗) we find a quadratic growth in t; for intermediate times we find that CA,B(t) heavily depends on the ranks of A, B and their overlap AB. In particular, we detect a remarkable high peak of CA,B(t) when the ranks of A and B are small but their overlap ⟨AB⟩ is still relatively large. To our knowledge, this observation may be new even in the physics literature. We then identify the relaxation time, t∗∗, when the OTOC saturates, i.e. it becomes essentially constant (equal its thermal limiting value) with small oscillations. As expected, in the last regime, after t∗∗, our model behaves universally; a qualitatively similar behaviour has been demonstrated for several more complicated systems in the physics literature both theoretically and numerically, see e.g. [17, 26, 41, 36, 27]. While for technical reasons we cannot consider infinite times, our analysis is valid for sufficiently long times to see all physically relevant features. For brevity we carry out the proofs at infinite temperature, but our methods can easily be extended to any finite temperature and we will give the corresponding formulas (see Section 2.2 below). Figure 1. The two curves show the behaviour of CA,B(t) in two different scenarios for two commuting traceless observables A, B normalized to ⟨A2⟩ = ⟨B2⟩ = 1. The black curve represents the case A = B with rank(A) = N a, a ∈ [0, 1] where the OTOC exhibits a large peak of size N 1−a around the scrambling time t∗ ∼ 1. Afterwards, it decays to its thermal limiting value (normalized to one) around the relaxation time t∗∗ ∼ N 1−a 3 . The red curve represents the case where AB = 0. Here, both t∗ and t∗∗ are of order one, independent of the ranks of A and B. For more details see Section 2.1. From the mathematical point of view, our work is the closest to [8, 10], where the deterministic leading term of traces of products of observables at different times, ⟨A1(t1)A2(t2)A3(t3)....⟩, were computed (see also [38, 39], where even the Gaussian fluctuations of such chains were proven). Clearly the OTOC is a special case of (the difference of two) such chains. The main novelty is that now we use only Schatten (tracial) norms5 of the observables in the estimates, while [8, 38, 39] used the much cruder operator norm. In particular, we can extend the time scale for the validity of our description. More importantly, note that the interesting features of the OTOC are manifested for small rank observables for which the operator norm is a major overestimate and conceptually is an overkill. The main tool is a concentration result, called multi-resolvent local law, for alternating products of resolvents of random matrices and deterministic matrices. More precisely, setting Gi := G(zi) and 5The (normalized) p-th Schatten norm of a matrix A ∈ CN×N is defined as ⟨|A|p⟩1/p for p ∈ [1, ∞), where |A| := (AA∗)1/2. 4 CIPOLLONI, ERD ˝OS, AND HENHEIK considering deterministic matrices Ai, the main object of interest is G1A1G2A2G3 . . . Ak−1Gk (1.3) for some fixed k. We will show that (1.3) concentrates around a deterministic object and gives an upper bound on the fluctuation. The interesting regime is the local one, i.e. when |Im zi| ≪ 1. Resolvents can then be converted to unitary time evolution eitH by standard contour integration. Local laws in general assert that resolvents G(z) tend to become deterministic (with high probability) in the large N limit even if the spectral parameter z is very close to the real axis (typically for any |Im z| ≫ N −1 in the bulk spectrum). For example, typical single resolvent local laws for Wigner matrices assert that, for any fixed ξ > 0,6 \f\f⟨(G(z)−m(z))A⟩ \f\f ≤ N ξ∥A∥ Nη , \f\f⟨x, (G(z)−m(z))y⟩ \f\f ≤ N ξ∥x∥∥y∥ √Nη , with η := |Im z| , (1.4) for a deterministic matrix A ∈ CN×N and deterministic vectors x, y ∈ CN with very high probability as N becomes large. Here, m(z) is the Stieltjes-transform of the Wigner semicircle law: m(z) = msc(z) := Z R 1 (x − z)ρsc(x) dx, ρsc(x) := 1 2π p [4 − x2]+. (1.5) However, the deterministic limit of a multi-resolvent chain (1.3) is not simply m(z1)m(z2)A1A2 . . . , i.e, one cannot mechanically replace each G by a scalar m, the actual formula is much more complicated, see (3.2) below. As to the accuracy of this deterministic approximation, besides N and the imaginary part of the spectral parameter, η = Im z, the error term crucially depends on the appropriate norms of Ai as well as on the distinction whether Ai is traceless or not. The fact that traceless observables substantially reduce both the size of the deterministic limit of (1.3) and of its fluctuation has first been observed and exploited in [7], see also [10] for a comprehensive analysis of arbitrary long chains. The results in [10] were optimal both in N and η, but they all used the simplest operator norm of Ai’s in the error term which is far from being optimal for low rank observables. Concerning the more accurate norms, only very recent papers [11, 14] started deviating from the operator norm in the error terms. The main purpose of these papers was to prove the Eigenstate Thermalisation Hypothesis (ETH) for random matrices (originally posed by Deutsch in [18]) in its most optimal form, including low rank observables. Moreover, the key point in [14] was to obtain ETH also uniformly in the spectrum, including the critical edge regime. This required to focus on a local law for ⟨Im GAIm GA⟩ and to extract the smallness of order ρ2 at the spectral edge owing to the imaginary part of the resolvents (here ρ = π−1|Im msc| is the local density of states). However, [11, 14] exclusively used the Hilbert-Schmidt (HS) norm, ⟨|A|2⟩1/2, which caused suboptimal (Nη)-dependence. For the purpose of [11, 14], this suboptimality in (Nη) was irrelevant since the proof of ETH relies on local laws in the η–regime when Nη is practically order one. In contrast to [11, 14], for studying the OTOC at shorter times, we need local laws in the regime where Nη is large (since η ∼ 1/t dictated by the contour integration and t ≪ N). In the current paper we prove local laws that are optimal both in N and η and use the optimal Schatten norms of the observables. Especially, this allows for a more accurate description of the OTOC in the physically relevant regime of small rank observables. We, however, do not need to track the ρ-dependence or pay attention to the imaginary parts. Therefore, the current work and [14] are complementary; they effectively handle very different aspects of the local law. While the fundamental idea of these two works is similar, both use the Zigzag strategy described in Section 4, the actual proofs are quite different. The main focus in [14] was to design and handle contour integral representations that allowed us to reduce every estimate to resolvent chains involving only Im G’s. In the current paper Im G plays no role, but we need to track the precise Schatten norms very carefully. To illustrate the strength of our new result in comparison with the previous bounds, we present the following three estimates for the simplest case k = 2, with A1 = A2 = A, z1 = z2 in the bulk, and 6Traditionally [19, 31, 4], local laws did not consider arbitrary test matrix A, but only A = I or special rank one projections A = yx∗ leading to the isotropic local law in (1.4). General A was included later, e.g. in [22]. OUT-OF-TIME-ORDERED CORRELATORS FOR WIGNER MATRICES 5 ignoring N ξ-factors for some arbitrarily small ξ > 0: \f\f\f⟨GAGA⟩ − m2⟨A2⟩ \f\f\f ≲                ∥A∥2 Nη from [10, Theorem 2.5]; √Nη ⟨|A|2⟩ Nη from [11, Theorem 2.2]; ⟨|A|2⟩ Nη + ⟨|A|4⟩1/2 N√η from Theorem 3.3. (1.6) Note that our current result in the last line of (1.6) implies both previous results since ⟨|A|4⟩1/2 ≤ √ N⟨|A|2⟩ and ⟨|A|p⟩1/p ≤ ∥A∥. While the former bound saturates for low rank observables, the latter saturates for high rank ones. Therefore, our new result with Schatten norms optimally interpolates between these two, at least in the bulk regime. Notations. By ⌈x⌉ := min{m ∈ Z: m ≥ x} and ⌊x⌋ := max{m ∈ Z: m ≤ x} we denote the upper and lower integer part of a real number x ∈ R. For k ∈ N we set [k] := {1, ..., k}, and ⟨A⟩ := d−1Tr(A), d ∈ N, for the normalised trace of a d × d-matrix A, while rk A ≡ rank A denotes its rank. For positive quantities f, g we write f ≲ g resp. f ≳ g and mean that f ≤ Cg resp. f ≥ cg for some N-independent constants c, C > 0 that may depend only on the basic control parameters Cp, see (2.1) in Assumption 2.1 below. Moreover, we will also write f ∼ g in case that f ≲ g and g ≲ f. We denote vectors by bold-faced lower case Roman letters x, y ∈ CN, for some N ∈ N, and define ⟨x, y⟩ := X i ¯xiyi , Axy := ⟨x, Ay⟩ . Matrix entries are indexed by lower case Roman letters a, b, c, ..., i, j, k, ... from the beginning or the middle of the alphabet and unrestricted sums over those are always understood to be over {1, ..., N}. We will use the concept ’with very high probability’, meaning that for any fixed D > 0, the probability of an N-dependent event is bigger than 1 − N −D for all N ≥ N0(D). Also, we will use the convention that ξ > 0 denotes an arbitrarily small positive exponent, independent of N. Moreover, we introduce the common notion of stochastic domination (see, e.g., [20]): For two families X = \u0010 X(N)(u) | N ∈ N, u ∈ U (N)\u0011 and Y = \u0010 Y (N)(u) | N ∈ N, u ∈ U (N)\u0011 of non-negative random variables indexed by N, and possibly an additional parameter u from a parameter space U (N), we say that X is stochastically dominated by Y , if for all ϵ, D > 0 we have sup u∈U (N) P h X(N)(u) > N ϵY (N)(u) i ≤ N −D for large enough N ≥ N0(ϵ, D). In this case we write X ≺ Y . If for some complex family of random variables we have |X| ≺ Y , we also write X = O≺(Y ). 2. Main results We consider N×N Wigner matrices W, i.e. W is a random real symmetric or complex Hermitian matrix W = W ∗ with independent entries (up to the Hermitian symmetry) and with single entry distributions waa d= N −1/2χd, and wab d= N −1/2χod, for a > b. The random variables χd, χod satisfy the following assumptions.7 Assumption 2.1. The off-diagonal distribution χod is a real or complex centered random variable, Eχod = 0, satisfying E|χod|2 = 1. The diagonal distribution is a real centered random variable, Eχd = 0. Furthermore, we assume the existence of high moments, i.e. for any p ∈ N there exists Cp > 0 such that E \u0002 |χd|p + |χod|p\u0003 ≤ Cp . (2.1) Our main result, Theorem 2.2 below, concerns the Heisenberg time evolution A(t) := e−iW tAeiW t of a fixed deterministic self-adjoint observable A = A∗ ∈ CN×N governed by the Wigner matrix W. More precisely, we consider the out-of-time-ordered correlator (OTOC) CA,B(t) := 1 2  \f\f[A(t), B] \f\f2\u000b =  A(t)2B2\u000b −  A(t)BA(t)B \u000b (2.2) 7By inspecting our proof, it is easy to see that actually we do not need to assume that the off-diagonal entries of W are identically distributed. We only need that they all have the same second moments, but higher moments can be different. 6 CIPOLLONI, ERD ˝OS, AND HENHEIK with another self-adjoint observable B = B∗ ∈ CN×N, consisting of a two-point and a four-point8 part, DA,B(t) :=  A(t)2B2\u000b and FA,B(t) :=  A(t)BA(t)B \u000b , respectively. (2.3) In the formulation of Theorem 2.2, a key role is played by the Fourier transform of the semicircular density (1.5), φ(t) := c ρsc(t) = Z 2 −2 dxρsc(x)eixt = J1(2t) t , t ∈ R, (2.4) where we recall that J1 is the Bessel function of the first kind of order one. We note that by standard asymptotics of the Bessel functions on the real line, it holds that J1(s) =        −sgn(s) cos \u0010 |s| + π 4 \u0011 r 2 π|s| + O \u0012 1 |s|3/2 \u0013 s → ±∞ , s 2 − 1 2 \u0010s 2 \u00113 + O(|s|5) s → 0 . (2.5) For simplicity, we formulate our main result only for traceless matrices, ⟨A⟩ = ⟨B⟩ = 0 and at infinite temperature. For general observables, see Remark 2.3 and for finite temperature, see Section 2.2. Theorem 2.2 (OTOC for Wigner matrices). Let W be a Wigner matrix satisfying Assumption 2.1 and let A, B ∈ CN×N be self-adjoint deterministic matrices which are traceless, ⟨A⟩ = ⟨B⟩ = 0. Fix any ϵ > 0. Then, the OTOC (2.2) satisfies CA,B(t) =⟨A2⟩⟨B2⟩ \u0002 1 − φ(t)2\u0003 + 2⟨AB⟩2φ(t)2 \u0002 φ(2t) − φ(t)2\u0003 + ⟨A2B2⟩ φ(t)2 − ⟨ABAB⟩φ(t)4 + O≺ \u0000EA,B(t, N) \u0001 (2.6) with an error term E = EA,B(t, N) := et/N 1/2−ϵ \u0012|t|4⟨A2⟩2 N + |t|⟨A8⟩1/2 N \u00131/2 \u0012|t|4⟨B2⟩2 N + |t|⟨B8⟩1/2 N \u00131/2 . (2.7) The proof of Theorem 2.2 is given in Section 3.3 below. It is based on a novel multi-resolvent local law with error terms involving optimal Schatten norms, see Theorem 3.3. Remark 2.3. We have several comments on Theorem 2.2: (i) [Non-traceless observables] For general observables A, B, we can decompose them into a tracial and traceless part, A =: ⟨A⟩ + ˚ A, and similarly for B. The tracial parts, ⟨A⟩ and ⟨B⟩, then commute with the unitary time evolution eitW and one straightforwardly obtains a result similar to Theorem 2.2 (see also Remark 3.5). (ii) [Variance of fluctuations] The size of the fluctuations around the deterministic leading term in (2.6), i.e. the variance of CA,B(t), is explicitly computable, following the arguments leading to [38, Lemma 2.5]. The result is expressible purely in terms of Schatten norms of A and B (cf. [38, Lemma 2.5 and Definition 3.4]), however in [38, 39] the error terms are still in terms of crude operator norms. (iii) [Gaussianity] It is also possible to prove Gaussianity of the fluctuations of CA,B(t) (cf. [38, The- orem 2.7 and Corollary 2.12]) by showing an approximate Wick theorem for resolvent chains, similarly to [38, Theorem 3.6]. However, we refrain from doing this for brevity of the current paper. 2.1. Physical interpretation of Theorem 2.2 by two examples. We will now discuss the behavior of CA,B(t) in two exemplary and extreme situations of observables A, B. In the first example we will set the two observables identical, in the second we will assume that their product vanishes. More concretely, we define A = N 1−a 2 diag(1, −1, ..., 1, −1, 0, ..., 0) , a ∈ [0, 1) , B = N 1−b 2 diag(0, ..., 0, 1, −1, ..., 1, −1) , b ∈ [0, 1) , (2.8) in such a way that AB = BA = 0, and ⟨A⟩ = ⟨B⟩ = 0 as well as ⟨A2⟩ = ⟨B2⟩ = 1, i.e. A (resp. B) contains N a-many (resp. N b-many) non-zero entries on the diagonal. 8We remark that some papers (see, e.g., [37]) refer to the four-point part FA,B(t) alone as the OTOC. OUT-OF-TIME-ORDERED CORRELATORS FOR WIGNER MATRICES 7 Example 1. For the first example, we have CA,A(t) = ⟨A2⟩2\u0002 1 − φ(t)2\b 1 − 2φ(2t) + 2φ(t)2} \u0003 + ⟨A4⟩ \u0002 φ(t)2 − φ(t)4\u0003 + O≺ \u0000EA,A(t, N) \u0001 . (2.9) Example 2. For the second example, we have CA,B(t) = ⟨A2⟩⟨B2⟩ \u0002 1 − φ(t)2\u0003 + O≺ \u0000EA,B(t, N) \u0001 . (2.10) The key features of these two examples (2.9)–(2.10) are briefly summarized in Table 1. Ignoring the respective error terms, CA,A(t) and CA,B(t) are schematically depicted in Figure 1. Now we comment on each time regime. (i) [Short-time regime] By the asymptotics in (2.5), we have the short-time asymptotic CA,A(t) = t2 \u0000⟨A4⟩ − ⟨A2⟩2\u0001 + O \u0000|t|4⟨A4⟩ \u0001 + O≺ \u0000E \u0001 (Example 1) , CA,B(t) = t2 ⟨A2⟩⟨B2⟩ + O \u0000|t|4⟨A2⟩⟨B2⟩ \u0001 + O≺ \u0000E \u0001 (Example 2) . This shows, that the OTOC for Wigner matrices does not exhibit the exponential increase ∼ e2λt, observed for quantum systems with a classically chaotic analogue, where λ is the Lyapunov exponent of the classical system. Instead, the OTOC (2.2) behaves polynomially, as expected for quantum chaotic systems without a classical analogue (e.g. for certain spin− 1 2 chains [26]). (ii) [Scrambling time] The monotonous growth of both CA,A(t) and CA,B(t) stops at a time of order one (using elementary properties of φ from (2.4)), hence the scrambling time is t∗ ∼ 1. However, the maximally attained value strongly differs for the two examples: While CA,A(t∗) ∼ N 1−a heavily depends on a (i.e. the rank of A), the peak of CA,B(t∗) ∼ 1 is independent of the ranks of A and B. (iii) [Intermediate regime up to the relaxation time] The following interval of intermediate times is characterized by a decay of the OTOC (2.6) towards its thermal limiting value ⟨A2⟩⟨B2⟩ = 1 up to the relaxation time t∗∗. This regime is also quite different for the two examples (2.9)– (2.10): While for Example 1 the interval of intermediate times is given by t ∈ [t∗, t∗∗] where t∗∗ ∼ N (1−a)/3, in Example 2 the relaxation time t∗∗ ∼ 1 is comparable with the scrambling time. However, for technical reasons, the entire interval of intermediate times is only accessible if a > 5/11 for Example 1, and a + b > 2/3 for Example 2, otherwise the leading terms in (2.9)– (2.10) become smaller than their respective error term. In comparison, computing the OTOC with the operator norm in the error terms [10, Corollary 2.7], would lead to the (more restrictive) conditions a > 5/8 for Example 1, and a + b > 1 for Example 2. (iv) [Long-time regime] In the consecutive long-time regime, i.e. t ≫ N (1−a)/3 for Example 1 and t ≫ 1 for Example 2, we find the OTOC (2.6) to concentrate around its thermal limiting value ⟨A2⟩⟨B2⟩ = 1 with small oscillations. This confirms the expectation, that the OTOC in strongly chaotic systems exhibits only small fluctuations for long times. These are accessible up to t ≤ N min{ 1 4 , 3a−1 2 }−ϵ and t ≤ N min{ 1 4 , 3a+1 10 , 3b+1 10 , 3(a+b)−2 4 }−ϵ for Example 1 and 2, respectively. Again, in comparison with Theorem 2.2, the operator norm error terms from [10, Cor. 2.7] would lead to the constraints t ≤ N 2a−1 2 −ϵ for Example 1, and t ≤ N a+b−1 2 −ϵ for Example 2. Ex. 1 (2.9): A = B, rk A = N a Ex. 2 (2.10): AB = 0, rk A = N a, rk B = N b short times CA,A(t) ∼ t2 \u0000⟨A4⟩ − ⟨A2⟩2\u0001 CA,B(t) ∼ t2 ⟨A2⟩⟨B2⟩ scrambling time t∗ ∼ 1 and CA,A(t∗) ∼ N 1−a t∗ ∼ 1 and CA,B(t∗) ∼ 1 intermediate times full access if a > 5/11 full access if a + b > 2/3 relaxation time t∗∗ ∼ N 1−a 3 and CA,A(t∗∗) ∼ ⟨A2⟩2 t∗∗ ∼ 1 and CA,B(t∗∗) ∼ ⟨A2⟩⟨B2⟩ long times up to t ≤ N min{ 1 4 , 3a−1 2 }−ϵ up to t ≤ N min{ 1 4 , 3a+1 10 , 3b+1 10 , 3(a+b)−2 4 }−ϵ Table 1. Overview of the two examples (2.9) and (2.10). 8 CIPOLLONI, ERD ˝OS, AND HENHEIK 2.2. Finite temperature case. Theorem 2.2 can easily be extended to the case of finite temperature, β = 1/T > 0. The OTOC (2.2) now is given by C(β) A,B(t) := 1 2 Tr \u0002 |[A(t), B]|2e−βW \u0003 Z (2.11) with partition function Z = Tr \u0002 e−βW \u0003 . In this case, the analog of (2.6) in the regime9 β ≪ log N reads C(β) A,B(t) =⟨A2⟩⟨B2⟩ \u0002 1 − φ(t)2\u0003 + ⟨AB⟩2 φ(t) φ(iβ) Re \u0014 φ(2t)φ(t + iβ) + φ(t)φ(2t + iβ) − 2φ(t)2φ(t + iβ) \u0015 + ⟨A2B2⟩ φ(t)2 − ⟨ABAB⟩φ(t)3Re [φ(t + iβ)] φ(iβ) + O≺ (EA,B(t, N)) , (2.12) where E is from (2.7). Here φ(z) is the complex extension of φ(t) for z ∈ C; note that φ(z) is generically complex but φ(iβ) is real. Figure 2. Depicted are four curves illustrating the influence of β = 1/T on the OTOC C(β) A,A(t) up to intermediate times for Example 1 from Section 2.1 (i.e. normalized to ⟨A2⟩ = 1 with rank A = N 1−a 2 and a ∈ [0, 1]). As β increases, the characteristic rank- dependent peak of size ∼ N 1−a around the scrambling time t∗ ∼ 1 becomes more pro- nounced and very slightly shifted to the left. Moreover, using the asymptotics of the Bessel function in the complex plane, we have φ(z) = − r 1 πz3 \u0010 cos \u0010 2z + π 4 \u0011 + e2|Im z|O \u0000|z|−1\u0001\u0011 for |z| → ∞ with | arg z| < π . In particular, the thermal limiting value of C(β) A,B(t) is independent of β at least in our regime β ≪ log N. Note that for much larger β ≳ √ N physics calculations predict a temperature dependence of the thermal limiting value of the OTOC , see [36, Eqs. (3.8)–(3.9)]. However, before the long-time regime and neglecting the error term in (2.12), we find a strong de- pendence of the OTOC on temperature for Example 1 from Section 2.1 (cf. (2.8)–(2.9)) as illustrated in Figure 2. In contrast to that, for Example 2 from Section 2.1 (cf. (2.8) and (2.10)), the whole OTOC curve (as depicted in Figure 1) is independent of temperature at any time. This is because all the β dependent terms in (2.12) drop out since AB = BA = 0. 9We restrict to this regime for simplicity, as all the error terms can be absorbed into ≺. OUT-OF-TIME-ORDERED CORRELATORS FOR WIGNER MATRICES 9 3. Proof of Theorem 2.2: Multi-resolvent local law with Schatten norms Theorem 2.2 relies on a new multi-resolvent local law for alternating chains (1.3) with deterministic matrices via simple contour integration (see Section 3.3). Its main novelty, using Schatten norms for the observables and still keeping optimality in N and η, has already been explained in the Introduction. After collecting some preliminary information, in Section 3.2 we present our new local law, Theorem 3.3, then in Section 3.3 we quickly complete the proof of Theorem 2.2. Starting from Section 4 we will focus on the proof of Theorem 3.3. 3.1. Preliminaries on the deterministic approximation. Before stating our main technical result, we introduce some additional notation. Given a non-crossing partition π of the set [k] := { 1, . . . , k } arranged in cyclic order, the partial trace pTrπ is defined as pTrπ(B1, . . . , Bk−1) := Y S∈π\\B(k) *Y j∈S Bj + Y j∈B(k)\\{ k } Bj, (3.1) with B(k) ∈ π denoting the unique block containing k. Then, for generic Bi’s, the deterministic approx- imation of (1.3) is given by (see [8, Theorem 3.4]) M[1,k] = M(z1, B1, . . . , Bk−1, zk) := X π∈NC([k]) pTrK(π)(B1, . . . , Bk−1) Y S∈π m◦[S], (3.2) where NC([k]) denotes the non-crossing partitions of the set [k], and K(π) denotes the Kreweras comple- ment of π (see [8, Definition 2.4] and [32]). Furthermore, for any subset S ⊂ [k] we define m[S] := msc[zS] as the iterated divided difference of msc evaluated in zS := {zi : i ∈ S}, and by m◦[·] denote the free- cumulant transform of m[·] which is uniquely defined implicitly by the relation m[S] = X π∈NC(S) Y S′∈π m◦[S′], ∀S ⊂ [k], (3.3) e.g. m◦[i, j] = m[{ i, j }] − m[{ i }]m[{ j }]. Throughout the paper, we will often use the fact that msc[zS] can be written as follows msc[{ zi : i ∈ S }] = Z 2 −2 ρsc(x) Y i∈S 1 (x − zi)dx. (3.4) In order to formulate bounds on the deterministic approximation M as well as the local law bounds in a concise way, we introduce the following weighted Schatten norms. Definition 3.1 (ℓ-weighted Schatten norms). For B ∈ CN×N, ℓ > 0 and p ∈ [2, ∞], we define the ℓ-weighted (2, p)-Schatten norm as |||B|||p,ℓ := ⟨|B|2⟩1/2 ℓ1/2 + ⟨|B|p⟩1/p ℓ1/p for p < ∞ and |||B|||∞,ℓ := ⟨|B|2⟩1/2 ℓ1/2 + ∥B∥ . (3.5) By elementary inequalities, we have |||B|||p,ℓ ≲ |||B|||q,ℓ and |||B|||q,ℓ ≲ h 1 + (Nℓ) q−p pq i |||B|||p,ℓ , 2 ≤ p ≤ q ≤ ∞. (3.6) The next lemma gives a bound on the deterministic approximation M[1,k] with traceless observables; its proof is given in Appendix A. We will henceforth follow the convention that the letter B is used for generic matrices, while A is reserved for traceless ones. Lemma 3.2 (M-bound). Fix k ≥ 1. Consider spectral parameters z1, ..., zk ∈ C \\ R and traceless matrices A1, ..., Ak ∈ CN×N. Denoting ℓ := minj∈[k] ηjρj with ηj := |Im zj| and ρj := π−1|Im m(zj)|, it holds that10 \f\f⟨M[1,k](z1, A1, ..., zk)Ak⟩ \f\f ≲ 1(k ≥ 2) ℓ Y i∈[k] |||Ai|||k,ℓ , (3.7) where |||Ai|||k,ℓ was defined in (3.5). It is easy to see that the bound (3.7) is optimal for k even (cf. Footnote 10) and in case that Ai = A for all i ∈ [k] and zi ∈ {z, ¯z} for some z ∈ C \\ R in the bulk, i.e. Re z ∈ [−2 + δ, 2 − δ] for some δ > 0. 10We point out that the bound can be improved to ℓ Q i∈[k] \u0000ℓ(1−k)/(2k)⟨|Ai|3⟩1/k⟨|Ai|2⟩(k−3)/(2k) + ℓ−1/k⟨|Ai|k⟩1/k\u0001 in case of odd k ≥ 3, but we do not follow this improvement for brevity and ease of notation. 10 CIPOLLONI, ERD ˝OS, AND HENHEIK 3.2. Multi-resolvent local law. We now formulate our main technical result, an averaged multi- resolvent local law with Schatten norms, in Theorem 3.3; its proof is given in Section 4. The corresponding isotropic multi-resolvent local law will be formulated in Theorem 6.2 later. Theorem 3.3 (Averaged multi-resolvent local law with Schatten norms). Let W be a Wigner matrix satisfying Assumption 2.1, and fix k ∈ N. Consider spectral parameters z1, ..., zk ∈ C \\ R, the associated resolvents Gj = G(zj) := (W − zj)−1, and traceless deterministic matrices A1, ..., Ak ∈ CN×N. Denote ηj := |Im zj| , ρj := π−1|Im m(zj)| , ℓ := min j∈[k] ηjρj, and let M[1,k] be given in (3.2). Then, for any fixed ϵ > 0 and recalling (3.5), we have \f\f⟨G1A1...GkAk⟩ − ⟨M[1,k]Ak⟩ \f\f ≺ 1 N Y i∈[k] |||Ai|||2k,ℓ , (3.8) uniformly in spectral parameters satisfying Nℓ ≥ N ϵ and maxj |zj| ≤ N 1/ϵ. Notice that, in the bulk regime, ℓ essentially agrees with η := mini∈[k] |Im zi|, since ρi ∼ 1. However, for (3.8) to be valid in any regime, the standard condition Nη ≫ 1 for the local law in the bulk needs to be replaced by Nℓ ≫ 1. This ensures that we are at the mesoscopic scale, i.e. there are many eigenvalues in a local window of size ηi around each Re zi. As already mentioned in the Introduction around (1.6), Theorem 3.3 unifies and improves the previ- ous local laws (in the bulk spectrum) with an error term involving either the operator norm (see [10, Eq. (2.11a) in Theorem 2.5]) or Hilbert-Schmidt norm (see [11, Theorem 2.2]). This follows by estimating (in the relevant ℓ ≲ 1 regime) |||Ai|||2k,ℓ ≲        ∥Ai∥ ℓ1/2 for [10, Eq. (2.11a) in Theorem 2.5] (Nℓ) k−1 2k ⟨|Ai|2⟩1/2 ℓ1/2 for [11, Theorem 2.2] (3.9) in (3.8) for Nℓ > 1 and every i ∈ [k] by means of elementary inequalities. Remark 3.4 (Optimality). The bound (3.8) is optimal in case that Ai = A for all i ∈ [k] and zi ∈ {z, ¯z} for some z ∈ C \\ R with |Im z| ≥ N −1+ϵ in the bulk. For W being GUE, this can easily be checked by spectral decomposition of the resolvents and using Weingarten calculus [16] for the Haar-distributed eigenvectors. The so-called “ladder diagram” gives the (first) Hilbert-Schmidt term in the estimate \f\f⟨(GA)k⟩ − ⟨M[1,k]A⟩ \f\f ≺ |||A|||k 2k,ℓ N ∼ ⟨|A|2⟩k/2 Nℓk/2 + ⟨|A|2k⟩1/2 Nℓ1/2 . (3.10) Interestingly, in some regimes the second term in (3.10) (non ladder diagram) gives the main contribution, defying the general belief that always the ladder diagrams are the leading terms. Remark 3.5 (Extensions). In Theorem 3.3, each G may also be replaced by a product of G’s or even |G|’s (absolute value). We refrain from stating these results explicitly, as they can be easily obtained from appropriate integral representations (see (5.24) and (5.28) below). We formulate only the following example for k = 2 and identical observables B1 = B2 for illustration. Let B ∈ CN×N be an arbitrary (i.e. not necessarily traceless) deterministic matrix. Then, decomposing B = ˚ B + ⟨B⟩, we have ⟨G1BG2B⟩ = ⟨B⟩2⟨G1G2⟩ + ⟨B⟩⟨G1G2 ˚ B⟩ + ⟨B⟩⟨G2G1 ˚ B⟩ + ⟨G1 ˚ B1G2 ˚ B2⟩ = m1m2⟨B⟩2 1 − m1m2 + m1m2⟨˚ B2⟩ + O≺   |⟨B⟩|2 Nℓ2 + |⟨B⟩|⟨|˚ B|2⟩1/2 Nℓ3/2 + ⟨|˚ B|2⟩ Nℓ + ⟨|˚ B|4⟩1/2 Nℓ1/2 ! . (3.11) The statement for different observables B1, B2 is analogous. 3.3. Out-of-time-ordered correlators: Proof of Theorem 2.2. In order to prove Theorem 2.2, we distinguish the following three time regimes, (i) |t| < 1 , (ii) 1 ≤ |t| ≤ N (1−ϵ)/2 , and (iii) |t| > N (1−ϵ)/2 (3.12) for some small fixed ϵ > 0 from Theorem 2.2. In the following, we focus on the most complicated case (ii) and discuss the other two cases briefly at the end of this section. Since the arguments in this section are fairly standard, we will leave some irrelevant technical details to the reader. OUT-OF-TIME-ORDERED CORRELATORS FOR WIGNER MATRICES 11 For 1 ≤ |t| ≤ N (1−ϵ)/2, we employ the integral representation e±itW = 1 2πi I Γ e±itzG(z)dz (3.13) with the contour Γ ≡ Γt,R := ∂ \u0000[−R, R] × i[−|t|−1, |t|−1] \u0001 (3.14) parametrized counterclockwise and the parameter R chosen as R = N κ for some arbitrarily small (but fixed) κ > 0. In this way, we can write the four-point part FA,B(t) in (2.3) of the OTOC (2.2) as FA,B(t) =   Y i∈[4] I Γ dzi 2πi   eit(z1+z3−z2−z4)⟨G(z1)AG(z2)BG(z3)AG(z4)B⟩ . (3.15) For the part, where all zi’s, i ∈ [4], run on the horizontal parts of the contour Γ, we can replace ⟨G(z1)A...G(z4)B⟩ by ⟨M(z1, A, ..., z4)B⟩ at the price of an error O≺(E) with E = EA,B(t) from (2.7) by means of Theorem 3.3 for k = 4. Here, we used ℓ ≳ N −2κ|t|−2, which follows by ρ(zi) ≳ |Im zi|(1 + dist(zi, [−2, 2])2)−1, and that κ > 0 is arbitrarily small and hence N κ can be absorbed into ≺. If all the zi’s run on the vertical parts of Γ, we employ the global law version of our main result, Proposition 4.1 below, to replace ⟨G(z1)A...G(z4)B⟩ by ⟨M(z1, A, ..., z4)B⟩, now at the price of an error O≺ \u0000⟨A8⟩1/4⟨B8⟩1/4/N \u0001 , which can easily be included in O≺(E). We point out that Theorem 3.3 cannot be used in this regime, since ℓ = 0 when one of the zi’s crosses the real axis. In the remaining cases, where some of the zi’s run on the horizontal parts and others run on the vertical parts, we can no longer cleanly apply either the local or global law (Theorem 3.3 and Proposition 4.1, respectively). Instead, we treat this situation by expanding around the case where all zi are on the horizontal parts. More precisely, in case that, say, z1 runs on the right vertical part of the contour Γ and z2, ...., z4 are fixed on the horizontal parts, we employ analyticity of G(z1) away from [−3, 3] (since ∥W∥ ≤ 2 + ϵ with very high probability). This enables us to write g(z1) := ⟨G(z1)A...G(z4)B⟩ at z1 = R + iq with q ∈ [−|t|−1, |t|−1], by Taylor expansion around ζ := R + i|t|−1, as g(R + iq) = K X j=0 (q − |t|−1)j 2πi I C1/(2|t|) g(w) (w − ζ)j+1 dw + O \u0000eE \u0001 , eE := ⟨A4⟩1/2⟨B4⟩1/2 RK+1|t|K−2 (3.16) for any K ∈ N to be chosen below, where C1/(2|t|) is the circle of radius 1/(2|t|) centered around ζ. In (3.16), we used that the (K + 1)th derivative of g(z1) on the vertical part of the contour is (determinis- tically) bounded as \f\fg(K+1)(z1) \f\f ≲ \f\f \u0000G(z1) \u0001K+1AG(z2)BG(z3)AG(z4)B \u000b\f\f ≲ ⟨A4⟩1/2⟨B4⟩1/2|t|3 RK+1 , since ∥G(zi)∥ ≤ |t| for i ∈ {2, 3, 4}. Using the representation (3.16), we can now replace g(w) by h(w) := ⟨M(w, A, ..., z4)B⟩, again at the expense of an error O≺(E) by means of Theorem 3.3. As one can easily see that h is also analytic around R + iq and satisfies the same relation as g in (3.16), we find that |g(R + iq) − h(R + iq)| ≺ E + eE. Hence, in order to absorb eE into E, it remains to choose K in (3.16) as K := ⌈κ−1⌉. Therefore, since integrating the O≺(E)-bound in (3.15) only adds some N κ-factors from the length of Γ (note that |eit(z1+z3−z2−z4)| ≲ 1), which can easily be absorbed into ≺, we find that FA,B(t) =   Y i∈[4] I Γ dzi 2πi   eit(z1+z3−z2−z4)⟨M(z1, A, z2, B, z3, A, z4)B⟩ + O≺ \u0000E \u0001 . (3.17) Similarly, decomposing A2 = (A2 − ⟨A2⟩) + ⟨A2⟩ and analogously for B, the two-point part DA,B(t) from (2.3) is given by, again for times 1 ≤ |t| ≤ N (1−ϵ)/2, DA,B(t) = ⟨A2⟩⟨B2⟩ +   Y i∈[2] I Γ dzi 2πi   eit(z1−z2)⟨M(z1, (A2 − ⟨A2⟩), z2)(B2 − ⟨B2⟩)⟩ + O≺(E) . (3.18) 12 CIPOLLONI, ERD ˝OS, AND HENHEIK In the other two regimes, |t| < 1 and |t| > N (1−ϵ)/2, we follow the above arguments for 1 ≤ |t| ≤ N 1/2−ϵ, but replace the contour Γ from (3.14) by11 {z ∈ C : dist(z, [−2, 2]) = |t|−1} and ∂ \u0000[−R, R] × i[−N (1−ϵ)/2, N (1−ϵ)/2] \u0001 , respectively. This results in error terms in identities analogous to (3.17)–(3.18), that can easily be seen to be bounded by O≺(E), just as before, by application of Proposition 4.1 and Theorem 3.3, respectively. It remains to explicitly compute the deterministic terms in (3.17)–(3.18), which, by using the formu- las (3.1)–(3.4), straightforwardly results in the expression given in (2.6). This concludes the proof of Theorem 2.2. □ 4. Zigzag strategy: Proof of Theorem 3.3 In this section we prove our main technical result from Section 3, the multi-resolvent local law in Theorem 3.3. Its proof is conducted via the characteristic flow method [2, 6, 29, 1, 33, 3] followed by a Green function comparison (GFT) argument. A combination of these tools, which we coin the Zigzag strategy, has first been used in [12, 14, 15]. It consists of the following three steps: 1. Global law. Proof of a multi-resolvent global law, i.e. for spectral parameters “far away” from the spectrum, minj dist(zj, [−2, 2]) ≥ δ for some small δ > 0 (see Proposition 4.1 below). 2. Characteristic flow. Propagate the global law to a local law by considering the evolution of the Wigner matrix W along the Ornstein-Uhlenbeck flow dWt = −1 2Wtdt + dBt √ N , W0 = W , (4.1) with Bt a standard real symmetric or complex Hermitian Brownian motion, thereby introducing an order one Gaussian component (see Proposition 4.3). The spectral parameters of the resolvents evolve from the global regime to the local regime according to the characteristic (semicircular) flow ∂tzi,t = −m(zi,t) − zi,t 2 . (4.2) The simultaneous effect of these two evolutions is a key cancellation of two large terms. 3. Green function comparison. Remove the Gaussian component by a Green function compari- son (GFT) argument (see Proposition 4.4). As the first step, we have the following global law, the proof of which is completely analogous to the proofs presented in [10, Appendix B], [11, Appendix A], and [14, Appendix A], and so omitted. Proposition 4.1 is stated for a general deterministic matrix B since the traceless condition plays no role in this case. Proposition 4.1 (Step 1: Global law). Let W be a Wigner matrix satisfying Assumption 2.1, and fix k ∈ N and δ > 0. Consider spectral parameters z1, ..., zk ∈ C \\ R, the associated resolvents Gj = G(zj) := (W − zj)−1, and deterministic matrices B1, ..., Bk ∈ CN×N. Then, uniformly in spectral parameters satisfying d := minj∈[k] dist(zj, [−2, 2]) ≥ δ and deterministic matrices B1, ..., Bk, it holds that \f\f⟨G1B1...GkBk⟩ − ⟨M[1,k]Bk⟩ \f\f ≺ 1 N Y i∈[k] |||Bi|||2k,d . (4.3) Next, using Proposition 4.1 as an input, we derive Theorem 3.3 for Wigner matrices which have an order one Gaussian component, as formulated in Proposition 4.3. For this purpose we consider the evolution of the Wigner matrix W along the Ornstein-Uhlenbeck flow (4.1) and define its resolvent Gt(z) := (Wt − z)−1 with zi ∈ C \\ R. Even if not stated explicitly we will always consider this flow only for short times, i.e. for 0 ≤ t ≤ T, where the maximal time T is smaller than some γ > 0. Note that the first two moments of Wt are preserved along the flow (4.1), and hence the self-consistent density of states of Wt is unchanged; it remains the standard semicircle law. We now want to compute the deterministic approximation to an alternating product of resolvents and deterministic matrices A1, A2, ... with trace zero Gt(z1)A1Gt(z2)A2Gt(z3)A3 . . . , (4.4) and have a very precise estimate of the error term. 11We choose the first contour only for t ̸= 0. If t = 0, the lhs. of (2.6) carries no randomness, and we find CA,B(0) = ⟨A2B2⟩ − ⟨ABAB⟩. OUT-OF-TIME-ORDERED CORRELATORS FOR WIGNER MATRICES 13 In fact, we will let the spectral parameters evolve with time with a carefully chosen equation that will conveniently cancel some error terms in the time evolution of (4.4). The corresponding equation will be the characteristic equation for the semicircular flow, i.e. given by the first order ODE (4.2) (see [14, Figure 1] for an illustration of this flow). We remark that, along the characteristics we have ∂tm(zi,t) = −∂zm(zi,t) \u0010 m(zi,t) + zi,t 2 \u0011 = −∂zm(zi,t) \u0012 − 1 2m(zi,t) + m(zi,t) 2 \u0013 = m(zi,t) 2 , (4.5) where in the last two equalities we used the defining equation m(z)2 + zm(z) + 1 = 0 of the Stieltjes transform of the semicircular law. In particular, this implies that ρi,s ∼ ρi,t for any 0 ≤ s ≤ t, where we denoted ρi,t := π−1|Im m(zi,t)|. In contrast to that, the behavior of the ηi,t := |Im zi,t| depends on the regime: in the bulk ηi,t decreases linearly in time with a speed of order one, at the edge the decay is still linear but with a speed depending on the size of the local density of states. By standard ODE theory we obtain the following lemma: Lemma 4.2 (see Lemma 3.2 in [14]). Fix an N–independent γ > 0, fix 0 < T < γ, and pick z ∈ C \\ R. Then there exists an initial condition z0 such that the solution zt of (4.2) with this initial condition z0 satisfies zT = z. Furthermore, there exists a constant C > 0 such that dist(z0, [−2, 2]) ≥ CT. The spectral parameters evolving by (4.1) will have the property that Gt(z1,t)A1 . . . Ak−1Gt(zk,t) − M[1,k],t ≈ G0(z1,0)A1 . . . Ak−1G0(zk,0) − M[1,k],0, (4.6) with M[1,k],t := M(z1,t, A1, . . . , Ak−1, zk,t), for any 0 ≤ t ≤ T. Note that the deterministic approximation M[1,k],t depends on time only through the time dependence of the spectral parameters, the deterministic approximation of (4.4) with fixed spectral parameters does not depend on time, i.e. it is unchanged along the whole flow (4.1). Proposition 4.3 (Step 2: Characteristic flow). Fix any ϵ, γ > 0, a time 0 ≤ T ≤ γ, and K ∈ N. Consider z1,0, . . . , zK,0 ∈ C \\ R as initial conditions to the solution zj,t of (4.2) for 0 ≤ t ≤ T and define Gj,t := Gt(zj,t) as well as ηj,t := |Im zj,t| and ρj,t := π−1|Im m(zj,t)|. Let k ≤ K, define ℓt := minj∈[k] ηj,tρj,t and recall (3.5). Then, assuming that \f\f⟨G1,0A1...Gk,0Ak⟩ − ⟨M[1,k],0Ak⟩ \f\f ≺ 1 N Y i∈[k] |||Ai|||2k,ℓ0 , (4.7) holds uniformly for any k ≤ K, any choice of deterministic traceless A1, ..., Ak and any choice of zi,0’s such that Nℓ0 ≥ N ϵ and maxj∈[k] |zj,0| ≤ N 1/ϵ, then we have \f\f⟨G1,T A1...Gk,T Ak⟩ − ⟨M[1,k],T Ak⟩ \f\f ≺ 1 N Y i∈[k] |||Ai|||2k,ℓT (4.8) for any k ≤ K, again uniformly in traceless matrices Ai and in spectral parameters satisfying NℓT ≥ N ϵ and maxj∈[k] |zj,T | ≤ N 1/ϵ. The proof of Proposition 4.3 is given in Section 5. As the third and final step, we show that the additional Gaussian component introduced in Proposition 4.3 can be removed using a Green function comparison (GFT) argument at the price of a negligible error. The proof of this proposition is presented in Section 6. Proposition 4.4 (Step 3: Green function comparison). Let H(v) and H(w) be two N × N Wigner matrices with matrix elements given by the random variables vab and wab, respectively, both satisfying Assumption 2.1 and having matching moments up to third order,12 i.e. E¯vu abvs−u ab = E ¯wu abws−u ab , s ∈ {0, 1, 2, 3} , u ∈ {0, ..., s} . (4.9) Fix K ∈ N and consider spectral parameters z1, ..., zK ∈ C\\R satisfying minj Nηjρj ≥ N ϵ and maxj |zj| ≤ N 1/ϵ for some ϵ > 0 and the associated resolvents G(#) j = G(#)(zj) := (H(#) − zj)−1 with # = v, w. Pick traceless matrices A1, ..., AK ∈ CN×N. Assume that, for H(v), we have the following bounds (writing Gj ≡ G(#) j for brevity): For any k ≤ K, consider any subset of cardinality k of the K spectral parameters, and similarly, consider any subset of 12This condition can easily be relaxed to being matching up to an error of size N−2 as done, e.g., in [21, Theorem 16.1]. 14 CIPOLLONI, ERD ˝OS, AND HENHEIK cardinality k of the deterministic matrices. Relabeling both of them by [k], setting ℓ := minj∈[k] ηjρj and recalling (3.5), we have that \f\f⟨G1A1...GkAk⟩ − ⟨M[1,k]Ak⟩ \f\f ≺ 1 N Y i∈[k] |||Ai|||2k,ℓ (4.10) uniformly in all choices of subsets of z’s and A’s. Then, (4.10) also holds for the ensemble H(w), uniformly all choices of subsets of z’s and A’s. We are now ready to finally conclude the proof of Theorem 3.3. Fix T > 0, and fix z1, . . . , zk ∈ C \\ R such that mini Nηiρi ≥ N ϵ, and let zi,0 be the initial conditions of the characteristics (4.2) chosen so that zi,T = zi (this is possible thanks to Lemma 4.2). Then, the assumption (4.7) of Proposition 4.3 is satisfied for those zi,0 by Proposition 4.1 with δ = CT, since d ≳ ℓ0 and where C > 0 is the constant from Lemma 4.2. We can thus use Proposition 4.3 to show that (4.8) holds. Finally, the Gaussian component added in Proposition 4.3 is removed using Proposition 4.4 with the aid of a complex version (see [14, Lemma A.2]) of the standard moment-matching lemma [21, Lemma 16.2]. □ 5. Characteristic flow: Proof of Proposition 4.3 In this section, we give the proof of Proposition 4.3. The argument is divided into three parts. (i) We begin by introducing several deterministic and stochastic control quantities, which play a fundamental role throughout the rest of this paper. The stochastic control quantities (some normalized differences between a resolvent chain and the corresponding M-term, see (5.12)–(5.13) below) satisfy a system of master inequalities (see Propositions 5.2–5.3). (ii) Taking these master inequalities together with Proposition 4.1 as inputs, we will prove Proposi- tion 4.3 in Section 5.1, thus concluding Step 2 of the argument in Section 4. (iii) Afterwards, based on Proposition 4.1 and several relations among the deterministic control quan- tities (see Lemma 5.1), we will prove the master inequalities in Section 5.2. To keep the presentation simpler, within this section we assume that Eχ2 od = 0 and that Eχ2 d = 1, i.e. we consider only complex Wigner matrices. The modifications for the general case are analogous to [14, Section 4], and so omitted. We recall our choice of the characteristics ∂tzi,t = −m(zi,t) − zi,t 2 , (5.1) note that t 7→ ηi,t is decreasing and that ρi,t ∼ ρi,s for any 0 ≤ s ≤ t (see (4.5) and the paragraph below it for more details). Additionally, we record the following, trivially checkable, simple integration rule which will be used many times in this section: Z t 0 1 ηαs ds ≲ log N ηα−2 t ℓt with ηs := min i ηi,s , ℓs := min i ηi,sρi,s . (5.2) Along the characteristics, using the short–hand notation Gi,t = (Wt − zi,t)−1, with Wt being the solution of (4.1), by Itˆo’s formula, we have13 d⟨(G[1,k],t − M[1,k],t)A⟩ = 1 √ N N X a,b=1 ∂ab⟨G[1,k],tA⟩dBab,t + k 2⟨G[1,k],tA⟩dt + k X i,j=1 i<j ⟨G[i,j],t⟩⟨G[j,i],t⟩dt + k X i=1 ⟨Gi,t − mi,t⟩⟨G(i) [1,k],tA⟩dt − ∂t⟨M[1,k],tA⟩dt, (5.3) where ∂ab denotes the directional derivative ∂wab. We also set G[i,j],t :=      Gi,tAi . . . Aj−1Gj,t if i < j Gi,t if i = j Gi,tAi,t . . . Gk,tAkG1,tA1 . . . Aj−1Gj,t if i > j, (5.4) 13We point out that (5.3) holds for any matrix Ai ∈ CN×N, i.e. we did not use that the Ai’s are traceless. OUT-OF-TIME-ORDERED CORRELATORS FOR WIGNER MATRICES 15 and defined G(l) [i,j],t as G[i,j],t but with the l–th resolvent substituted by G2 l,t. The last definition for i > j reflects the cyclicity of the trace, since G[i,j],t will be needed in a tracial situation. For any i, j ∈ [k], we denote the deterministic approximation of G[i,j],t by M[i,j],t, with M[i,j],t being defined as in (3.2) with [1, k] replaced by [i, j] if i < j and by [1, j] ∪ [i, k] if i > j. Deterministic control quantities: mean and standard deviation size. We now introduce two deterministic control quantities that measure the size of the mean of long chains ⟨G1A1...GkAk⟩ and their standard deviation, respectively, in terms of the ℓ-weighted Schatten norms of A1, ..., Ak (recall Definition 3.1) and the spectral parameters of the resolvents Gi = G(zi). These are given by mk(ℓ; AJk) := 1(k ≥ 2) Y α∈Jk |||Aα|||k,ℓ and sk(ℓ; AJk) := Y α∈Jk |||Aα|||2k,ℓ , (5.5) and will be called the mean size and the standard deviation size, respectively. They are functions of a positive number ℓ (usually given by ℓ = mini ηiρi) and a multiset AJk = (Aα)α∈Jk of deterministic matrices of cardinality |Jk| = k. In the following, we shall frequently drop the symbol A from the definitions in (5.5), i.e. write mk(ℓ; Jk) and sk(ℓ; Jk) instead of mk(ℓ; AJk) and sk(ℓ; AJk), respectively. Moreover, for time dependent spectral parameters, we will also use the notation mk(t) = mk(t; Jk) = mk(ℓt; AJk), with ℓt = mini ηi,tρi,t, and a similar notation for the standard deviation size. In particular, we may often omit the dependence on the deterministic matrix A. (More generally, we will omit every argument of (5.5), whenever it is clear what they are and it does not lead to confusion.) For example, for i < j, we have, with ηt := mini ηi,t, |⟨M[i,j],tAj⟩| ≲ ℓt mj−i+1(t), |⟨M[i,j],t⟩| ≲ (ℓt/ηt)mj−i(t). (5.6) The first bound follows from (3.7); the second bound in (5.6) can easily be obtained by arguments entirely analogous to the ones leading to Lemma A.1 in Appendix A. The bounds (5.6) justify the terminology that mk is the mean size of a resolvent chain ⟨G1A1...GkAk⟩, which is well approximated by ⟨M[1,k]Ak⟩. The additional ℓt factor was introduced to simplify formulas later. In the remainder of this section we will often use the following lemma about some relations among the sizes mk(t), s(t) from (5.5). The proofs are immediate consequences of (3.6) and ℓs ≳ ℓt for s ≤ t (recall the discussion below (4.5)) and hence omitted. Lemma 5.1 (m/s-relations). Let k ≥ 1 and consider time-dependent spectral parameters z1,t, ..., zk,t and a multiset of traceless matrices AJk as above. Then, the mean size mk and the standard variation size sk satisfy the following inequalities. (i) Super-multiplicativity, i.e. for any 1 ≤ j ≤ k − 1 we have mj(t; Jj) mk−j(t; Jk−j) ≲ mk(t; Jk) and sj(t; Jj) sk−j(t; Jk−j) ≲ sk(t; Jk) (5.7) for all disjoint decompositions Jk = Jj ˙∪Jk−j. (ii) The mean size can be upper bounded by the standard deviation size as mk(t; Jk) ≲ sk(t; Jk) and p m2k(t; Jk ∪ Jk) ≲ sk(t; Jk) , (5.8) where Jk ∪ Jk denotes the union of the multiset Jk with itself. (iii) The standard deviation size satisfies the doubling inequality (recall ℓt = minj∈[k] ηj,tρj,t) s2k(t; Jk ∪ Jk) ≲ [1 + p Nℓt] \u0000sk(t; Jk) \u00012 . (5.9) (iv) Monotonicity in time: for any 0 ≤ s ≤ t we have mk(s; Jk) ℓα s ≲ mk(t; Jk) ℓα t sk(s; Jk) ℓβ s ≲ sk(t; Jk) ℓβ t (5.10) for all α ∈ [0, 1] and β ∈ [0, 1/2]. Stochastic control quantities: Master and reduction inequalities. Using the notation from (5.5), the goal is thus to prove that ⟨G[1,k],T Ak⟩ − ⟨M[1,k],T Ak⟩ = ⟨G[1,k],0Ak⟩ − ⟨M[1,k],0Ak⟩ + O≺ \u0010sk(T) N \u0011 , (5.11) uniformly in the spectrum and uniformly in traceless deterministic matrices Ai, for some fixed T ≲ 1. We may henceforth assume that all the Ai’s are Hermitian; the general case follows by multilinearity. 16 CIPOLLONI, ERD ˝OS, AND HENHEIK For the purpose of proving (5.11), recall the notation ℓt := mini ηi,tρi,t from (5.2) and define Φk(t) = Φk(t; z[1,k]; A[1,k]) := N sk(ℓt; A[1,k]) \f\f⟨(G[1,k],t − M[1,k],t)Ak⟩ \f\f for all k ≥ 1 . (5.12) Here, A[1,k] = (A1, . . . , Ak) and z[1,k] = (z1, ..., zk) with zi = zi,0 (initial condition) denote multisets of deterministic matrices and spectral parameters, respectively. We now briefly comment on the definition (5.12). We chose the pre–factor in the definition of Φk(t) so that eventually Φk(t) will be of order one with high probability (cf. (5.11)). However, we will not be able to prove this directly, we first prove that Φk(t) ≺ √Nℓt and then, using this bound as an input, we prove the desired bound Φk(t) ≺ 1. To implement this technically we introduce another quantity Ψk(t) = Ψk(t; z[1,k]; A[1,k]) := N sk(ℓt; A[1,k])√Nℓt \f\f⟨(G[1,k],t − M[1,k],t)Ak⟩ \f\f for all k ≥ 1 , (5.13) which we will show to be bounded by one (note that Ψk(t) ≺ 1 implies Φk(t) ≺ √Nℓt), and then show that Ψk(t) ≺ 1 in fact implies Φk(t) ≺ 1. We start considering Ψk(t); note that by (4.7) it follows Ψk(0) ≲ Φk(0) ≺ 1, (5.14) for any k ≥ 1. For this purpose we will derive a series of master inequalities for these quantities with the following structure. We assume that Ψk(t) ≺ ψk (5.15) holds for some deterministic control parameter ψk ≥ 1, uniformly in deterministic matrices Ai, times 0 ≤ t ≤ T and in spectral parameters with ℓt ≥ N −1+ϵ for some small fixed ϵ > 0 (we stress that the ψk’s depend neither on time, nor on the spectral parameters zi,t, nor on the deterministic matrix A). Starting from (5.15) we derive an improved upper bound for Ψk(t) and show that, by iterating these inequalities, we indeed obtain the desired Ψk(t) ≺ 1. The main inputs to prove this fact are the master inequalities in (5.16), which informally states that if Ψl(t) ≺ ψl for any l = 1, . . . , k + 1(k odd), then this actually implies the improved bound (5.16). Proposition 5.2 (Master inequalities). Fix k ∈ N. Assume that Ψl(t) ≺ ψl for some deterministic control parameters ψl, for any 1 ≤ l ≤ k + 1(k odd), uniformly in t ∈ [0, T]. Then Ψk(t) ≺ 1 + k−2 X j=1 ψj + 1 (NℓT )1/4 k X j=1 eψj eψk−j, (5.16) uniformly in t ∈ [0, T]. Here we set eψl := ψl + 1(l odd) p ψl−1ψl+1 and ψ0 := 1. Using (5.16), in the next section we show that Ψk(t) ≺ 1 by an iterative procedure. Then, to conclude Φk(t) ≺ 1, we rely on the following proposition, which will eventually prove Proposition 4.3. Proposition 5.3. Fix k ∈ N, assume that Φl(t) ≺ 1, for l ≤ k − 2 uniformly in t ∈ [0, T], and that Φl(t) ≺ √Nℓt for 1 ≤ l ≤ 2k and t ∈ [0, T]. Then Φk(t) ≺ 1, (5.17) uniformly in t ∈ [0, T]. 5.1. Closing the hierarchy: Proof of Proposition 4.3. To show that Proposition 5.2 in fact implies Ψk(t) ≺ 1 we rely on the following procedure, which we refer to as iteration (see, e.g., [13, Lemma 4.1]). Lemma 5.4 (Iteration). Fix k ∈ N, T > 0, and N-independent constants ϵ, δ > 0, α ∈ (0, 1) and D > 0. Let X be a random variable depending on k time dependent spectral parameters z1,t, ..., zk,t, t ∈ [0, T], and recall that ℓt = minj∈[k] ηj,tρj,t. Assume that the a-priori bound X ≺ N D holds uniformly in t ∈ [0, T], ℓt ≥ N −1+ϵ. Suppose that there is a deterministic quantity x (may depend on ℓT and N) such that for any fixed l ∈ N the fact that X ≺ x uniformly for t ∈ [0, T] and ℓt ≥ N −1+lϵ implies14 X ≺ A + x B + x1−αCα, (5.18) 14Here the scalar A > 0 should not be confused with the matrices Ai which appear throughout the proof. OUT-OF-TIME-ORDERED CORRELATORS FOR WIGNER MATRICES 17 uniformly for t ∈ [0, T] and ℓt ≥ N −1+(l+l′)ϵ, for some constants15 l′ ∈ N, B ≥ δ > 0, A, C > 0. Then, iterating (5.18) finitely many times, we obtain X ≺ A + C, uniformly for t ∈ [0, T] and ℓt ≥ N −1+(1+Kl′)ϵ, for some K = K(α, D, δ). We are now ready to present the proof of Proposition 4.3. Proof of Proposition 4.3. The proof of this proposition is divided into two steps: we first prove that Ψk(t) ≺ 1 for any k and then use this information as an input to conclude that Φk(t) ≺ 1 for any k. These two bounds are quite different in spirit. The first one is an a-priori bound so the iterative procedure behind its proof must be self-improving. This is reflected in the triangular structure of (5.16): the right hand side contains quantities with index at most k (or k + 1 when k is odd) and terms with the highest index come with a small prefactor (recall that NℓT is large). This makes the system (5.16) closable. The iteration is done essentially for each fixed k and then we use an induction on k. Owing to the parity issue in the definition of eψ, we use a step-two induction, but this is just a small technicality. The second bound Φk(t) ≺ 1 is quite different, since its proof relies on the a-priori bound obtained in the first step. The key point is that in order to prove Φk(t) ≺ 1 for some fixed k, we need to know the a-priori bound Φl(t) ≺ √Nℓt for any l ≤ 2k, i.e. without the a-priori bound the system of inequalities behind the proof of Φk(t) ≺ 1 would not be closable. This explains why we need to proceed in two stages. We now start we the proof of Ψk(t) ≺ 1. We first prove this for k = 1, 2 and then, using an inductive argument, we show that the same bound holds for any k ≥ 3. By (5.16) for k = 1, 2 we have Ψ1(t) ≺ 1 + ψ1 + √ψ2 (NℓT )1/4 , Ψ2(t) ≺ 1 + ψ2 1 + ψ2 (NℓT )1/4 (5.19) Using iteration we then obtain (all estimates are uniform in t ∈ [0, T]) Ψ1(t) ≺ 1 + √ψ2 (NℓT )1/4 , Ψ2(t) ≺ 1 + ψ2 1 (NℓT )1/4 . (5.20) Plugging the first inequality into the second one and using iteration, this immediately gives that Ψ1(t) + Ψ2(t) ≺ 1. Next, we proceed with the induction step. Fix an even k ∈ N, and assume that Ψl(t) ≺ 1, for l ≤ k−2, then by (5.16) we have Ψk−1(t) ≺ 1 + ψk−1 + √ψk (NℓT )1/4 , Ψ2(t) ≺ 1 + ψk−1 + ψk + √ψk (NℓT )1/4 (5.21) By iteration, we have Ψk−1(t) ≺ 1 + √ψk (NℓT )1/4 , Ψ2(t) ≺ 1 + ψk−1, (5.22) which concludes Ψl(t) ≺ 1, for l ≤ k, by plugging the first inequality into the second one and using iteration once again. Finally, to conclude Φk(t) ≺ 1, we proceed by a step-two induction on k. For k = 1, 2, the assumption Φl(t) ≺ √Nℓt, for l ≤ 4, of Proposition 5.3 is satisfied, and so we have Φ1(t) + Φ2(t) ≺ 1. Then we proceed with the induction step, i.e. for a fixed even k ∈ N we assume that Φl(t) ≺ √Nℓt, for l ≤ 2k, and Φl(t) ≺ 1, for l ≤ k − 2. Then, by Proposition 5.3, we have Φl(t) ≺ 1 for l ≤ k; this concludes the induction step, hence the proof. □ 5.2. Master and reduction inequalities: Proofs of Propositions 5.2–5.3. We first present the proof of Proposition 5.2 in detail and then at the end of this section we explain the minor changes to obtain Proposition 5.3. Proof of Proposition 5.2. To keep the notation simple, from now on we often omit the t–dependence from the resolvents Gi = Gi,t and from their deterministic approximations M[i,j] = M[i,j],t, but we will still keep the t–dependence in the spectral parameters, in Ψk(t) and in the quantities (5.5); additionally, we stress that ψk does not depend on time. All estimates are uniform in the time parameters t, s ∈ [0, T]. 15The constants A, B, C may depend on N, while l and l′ are independent of N. 18 CIPOLLONI, ERD ˝OS, AND HENHEIK Note that in (5.13) we defined Ψk(t) only for alternating chains of single resolvents and deterministic A’s, i.e. no Gk i appears. However, in (5.3) we naturally get chains involving G2 i . For these terms we use the estimate (recall the estimate for ⟨M[i,j]⟩ from (5.6)): \f\f⟨G[i,j] − M[i,j]⟩ \f\f ≺ ψj−isj−i(t) Nηt . (5.23) For Im zi,tIm zj,t > 0 this trivially follows by integral representation GjGi = 1 2πi Z Γ G(z) (z − zi,t)(z − zj,t) dz, (5.24) for ”linearizing” the product of the first and last G’s in ⟨G[i,j]⟩ = ⟨GiAi . . . Aj−iGj⟩ after using cyclicity of the trace. Here Γ is a contour which lies in the region {z ∈ C : |Im z|ρ(z) ≥ ℓt/2}. For Im zi,tIm zj,t < 0 we ”linearize” by the resolvent identity. Using (5.24) will change the value of the imaginary part of the spectral parameters, so the domain on which the inequalities below hold (characterized by Nℓ ≥ N ϵ) may change from time to time, i.e., say ϵ → ϵ/2. However, this can happen only finitely many times as it does not affect the ≺–bound (see [13, Figure 2] for a detailed discussion of this minor technicality). To describe the evolution of M[1,k],t in (5.3) we rely on the following lemma. Lemma 5.5 (Lemma 4.8 of [14]). For any deterministic matrices Ai ∈ CN×N (i.e. not necessarily traceless), we have ∂t⟨M[1,k],tAk⟩ = k 2⟨M[1,k],tAk⟩ + k X i,j=1, i<j ⟨M[i,j],t⟩⟨M[j,i],t⟩. (5.25) Adding and subtracting the deterministic approximation of each term in (5.3) and using Lemma 5.5 we thus obtain d⟨(G[1,k],t − M[1,k],t)Ak⟩ = 1 √ N N X a,b=1 ∂ab⟨G[1,k],tAk⟩dBab,t + k 2⟨G[1,k],tAk⟩dt + k X i,j=1 i<j ⟨G[i,j],t − M[i,j],t⟩⟨M[j,i],t⟩dt + k X i,j=1 i<j ⟨M[i,j],t⟩⟨G[j,i],t − M[j,i],t⟩dt + k X i,j=1 i<j ⟨G[i,j],t − M[i,j],t⟩⟨G[j,i],t − M[j,i],t⟩dt + k X i=1 ⟨Gi,t − mi,t⟩⟨G(i) [1,k],tAk⟩dt. (5.26) We point out that, using a simple change of variables, the term ⟨G[1,k]Ak⟩ amounts to a simple rescaling ekt/2, so we will ignore it. The quadratic variation of the martingale term in (5.26) is given by 1 N N X a,b=1 \f\f∂ab⟨G[1,k]Ak⟩ \f\f2 ≲ k X i=1 ⟨Im Gi(AiIm Gi+1 . . . Ai−1)Im Gi(AiIm Gi+1 . . . Ai−1)∗⟩ N 2η2 i,t , (5.27) where we also used the Ward-identity GiG∗ i = η−1 i Im Gi. Notice that the rhs. of (5.27) naturally contains chains of 2k resolvents. However, to have a closed system of master inequalities for products of resolvents of length k, we split the chain of length 2k into the product of two chains of length k. For this purpose we use the following reduction inequality which will be proven at the end of this section. For any fixed matrices R, Q ∈ CN×N, and spectral parameters z, w ∈ C \\ R, we have16 ⟨Im G(z)QG(w)RIm G(z)R∗G(w)∗Q∗⟩ ≲ N⟨Im G(z)Q|G(w)|Q∗⟩⟨Im G(z)R∗|G(w)|R⟩. (5.29) 16We point out that the bound Ψk(t) ≤ ψk holds also for chains when some resolvents G’s are replaced by their absolute value |G|. This can be easily seen using the integral representation |G(E + iη)| = 2 π Z ∞ 0 Im G(E + i p η2 + v2) p η2 + v2 dv , (5.28) together with the bound (5.13) for chains containing only resolvents (see e.g. [10, Lemma 5.1]). OUT-OF-TIME-ORDERED CORRELATORS FOR WIGNER MATRICES 19 We now focus on the case k being even for notational simplicity. Combining (5.27) with (5.29) used for z = z1, w = zk/2 and Q = A1G2 . . . Gk/2−1Ak/2−1 , R = Ak/2Gk/2+1 . . . GkAk, together with Ψk(t) ≺ ψk, we obtain the following bound for the quadratic variation 1 N N X a,b=1 \f\f∂ab⟨G[1,k],sAk⟩ \f\f2 ≺ mk(s)2 Nη2s + Nℓts(s)2ψ2 k N 3η2s . (5.30) Then, using the Burkholder–Davis–Gundy (BDG) inequality, we conclude that the martingale term in (5.26) is bounded by N sk(t)√Nℓt \u0014Z t 0 \u0012ℓsmk(s)2 Nη2s + Nℓssk(s)2ψ2 k N 3η2s \u0013 ds \u00151/2 ≲ mk(t) sk(t) + ψk √ N \u0012Z t 0 1 η2s ds \u00131/2 ≲ 1 + ψk √Nℓt , (5.31) with very high probability. Here in the first inequality we used (5.10), and in the second inequality we used (5.8) for the first term and (5.2) for the second term. Similarly, for odd k, using (5.29) for z = z1, w = z(k−1)/2 and Q = A1G2 . . . G(k−3)/2A(k−3)/2 , R = A(k−1)/2G(k+1)/2 . . . GkAk we get a bound 1 + p ψk−1ψk+1/(Nℓt)1/4 for the martingale term. Next, using (5.23), we estimate the contribution of the last term in (5.26) N sk(t)√Nℓt Z t 0 ⟨Gi,s − mi,s⟩⟨G(i) [1,k],sAk⟩ ds ≺ N sk(t)√Nℓt Z t 0 1 Nη2s \u0012 ℓsmk(s) + ψksk(s)√Nℓs N \u0013 ds ≲ 1 √Nℓt + ψk Nℓt , (5.32) where in the first inequality we used |⟨Gi,s − mi,s⟩| ≺ (Nηs)−1 from (1.4), and in the second inequality we used (5.8), (5.10) and (5.2). Using again (5.23), we estimate the last term in the first line and the first term in the second line of (5.26) as follows: N sk(t)√Nℓt Z t 0 k−1 X i,j=1 i<j ⟨M[i,j],s⟩⟨G[j,i],s − M[j,i],s⟩ ds ≺ N sk(t)√Nℓt Z t 0 k−1 X i,j=1 i+1<j ℓsmj−i(s) ηs ψk−(j−i)sk−j+i(s)√Nℓs Nηs ds ≲ k−2 X j=1 ψj, (5.33) where in the first inequality we used that ⟨M[i,i+1],s⟩ = 0 and (5.6) to estimate ⟨M[i,j],s⟩, and in the second inequality we used (5.7)–(5.8), (5.10) and (5.2). Finally, for the last term in the second line of (5.26) we estimate: N sk(t)√Nℓt Z t 0 k−1 X i,j=1 i<j ⟨G[i,j],s − M[i,j],s⟩⟨G[j,i],s − M[j,i],s⟩ ds ≺ N sk(t)√Nℓt k−1 X i,j=1 i<j Z t 0 ψj−isj−i(s)√Nℓs Nηs ψk−(j−i)sk−j+i(s)√Nℓs Nηs ds ≲ 1 √Nℓt k−1 X j=1 ψjψk−j, (5.34) 20 CIPOLLONI, ERD ˝OS, AND HENHEIK where in the second inequality we used (5.7), (5.10) and (5.2). Collecting all these bounds, using that ℓt ≳ ℓT and NℓT ≥ 1, we obtain Ψk(t) ≺ 1 + ψk + 1(k odd) p ψk−1ψk+1 (NℓT )1/4 + k−2 X j=1 ψj + 1 (NℓT )1/2 k−1 X j=1 ψjψk−j. Finally, using that ψl ≥ 1 and NℓT ≥ 1, we conclude (5.16). □ Proof of Proposition 5.3. The proof of (5.17) is very similar to the one of (5.16), for this reason we only explain the minor differences. All the terms in (5.26) are estimated exactly in the same way as in the proof of Proposition 5.2 with the exception of the martingale term. In fact, this is the only step where the estimate for Ψk (first step) differs from the estimate on Φk (second step). Estimating a longer chain by two smaller ones loses a certain Nℓ factor; this loss is unavoidable in the first step, but it can be avoided in the second one, once the a-priori bound is available. More precisely, the estimates in (5.32), (5.34), after multiplying them by a factor √Nℓt, are the same with the only minor difference that we can now use ψl = 1. The estimate (5.33) becomes (recall that ⟨M[i,i+1],s⟩ = 0) N sk(t) Z t 0 k−1 X i,j=1 i+1<j ⟨M[i,j],s⟩⟨G[j,i],s−M[j,i],s⟩ ds ≺ N sk(t) Z t 0 k−1 X i,j=1 i+1<j ℓsmj−i(s) ηs Φk−(j−i)sk−j+i(s) Nηs ds ≲ 1, (5.35) where the only difference with (5.33) is that now in the second inequality we used that Φl(t) ≺ 1, for l ≤ k − 2, by the induction assumption. Instead of the bound for the quadratic variation (5.27), using that Φ2k(t) ≺ √Nℓt, the estimate in (5.31) is replaced by N sk(t) \u0014Z t 0 ⟨Im G1,s(A1 . . . Ak)Im G1,s(Ak . . . A1)∗⟩ N 2η2s ds \u00151/2 ≺ N sk(t) \u0014Z t 0 \u0012m2k(s)ℓs N 2η2s + Φ2k(s)s2k(s) N 3η2s \u0013 ds \u00151/2 ≲ \u0014Z t 0 \u0012 ℓt η2s + √Nℓt Nη2s \u0013 ds \u00151/2 ≲ 1 , (5.36) where in the second inequality we used (5.8), (5.10) and in the last inequality we used (5.2). This concludes the proof of Proposition 5.3. □ We conclude this section with the proof of (5.29). Proof of (5.29). By spectral decomposition of W (λi, ui being its eigenvalues and eigenvectors) we have ⟨Im G(z)QG(w)RIm G(z)R∗G(w)∗Q∗⟩ = |Im z|2 N N X i,j,k,l=1 ⟨ui, Quj⟩⟨uj, Ruk⟩⟨uk, R∗ul⟩⟨ul, Q∗ui⟩ |λi − z|2(λj − w)|λk − z|2(λl − w) ≲ N⟨Im G(z)Q|G(w)|Q∗⟩⟨Im G(z)R∗|G(w)|R⟩, (5.37) where in the last step we used Schwarz inequality \f\f⟨ui, Quj⟩⟨uj, Ruk⟩⟨uk, R∗ul⟩⟨ul, Q∗ui⟩ \f\f ≲ \f\f⟨ui, Quj⟩⟨uk, R∗ul⟩ \f\f2 + \f\f⟨uj, Ruk⟩⟨ul, Q∗ui⟩ \f\f2 . □ 6. Green function comparison: Proof of Proposition 4.4 In this section, we remove the Gaussian component introduced in Proposition 4.3 using a Green function comparison (GFT) argument, i.e. we prove Proposition 4.4. The basic idea is the same as in [14, Section 5]: We perform a self-consistent GFT (i.e., given a local law for one ensemble, we aim to prove it for a different one) using an entry-by-entry Lindeberg replacement strategy in O(N 2) many steps. Note that, unlike here, in typical applications of GFT to answer universality questions, the local law is given as an a-priori input. Prior to [14] the GFT has been used in a similar spirit by Knowles and Yin [31] in order to prove a single resolvent local law for ensembles, where the deterministic approximation M to G is no longer a multiple of the identity (e.g. deformed Wigner matrices). In contrast to our approach, they used OUT-OF-TIME-ORDERED CORRELATORS FOR WIGNER MATRICES 21 a continuous interpolation between ensembles, but we stick with the entrywise Lindeberg replacement, which is easier to adjust to multiple resolvents, similarly as in [14]. A characteristic property of the Lindeberg strategy, is that along the replacement procedure isotropic resolvent chains naturally arise. In particular, we have to consider the isotropic analog of Theorem 3.3, the average local law, as well, and need to show that also \u0000G1A1...GkAkGk+1 \u0001 xy (6.1) concentrates around a deterministic value \u0000M(z1, A1, ..., zk, Ak, zk+1) \u0001 xy with M given by (3.2). This will also be done via the Zigzag strategy (recall the outline in the beginning of Section 4) in Section 6.1. First, analogously to Lemma 3.2, we have the following bound on the deterministic approximation of (6.1), the proof of which is deferred to Appendix A. Lemma 6.1 (Isotropic M-bounds). Assume the setting of Lemma 3.2 but with k + 1 (instead of k) spectral parameters z1, ..., zk+1 ∈ C \\ R. Then, for deterministic vectors x, y ∈ CN with ∥x∥, ∥y∥ ≲ 1, it holds that17 \f\f⟨x, M[1,k+1](z1, A1, ..., Ak, zk+1)y⟩ \f\f ≲ Y i∈[k] |||Ai|||∞,ℓ , (6.2) where |||Ai|||∞,ℓ has been introduced in Definition 3.1. The analog of Theorem 3.3 is the following isotropic multi-resolvent local law. The proof is given in Section 6.1. Theorem 6.2 (Isotropic multi-resolvent local laws). Assume the setting of Theorem 3.3 but with k + 1 (instead of k) spectral parameters z1, ..., zk+1 ∈ C \\ R and let x, y ∈ CN be deterministic vectors with ∥x∥, ∥y∥ ≲ 1. Then it holds that \f\f⟨x, G1A1...AkGk+1y⟩ − ⟨x, M[1,k+1]y⟩ \f\f ≺ 1 √ Nℓ Y i∈[k] |||Ai|||∞,ℓ , (6.3) where |||Ai|||∞,ℓ has been introduced in Definition 3.1. Analogously to Theorem 3.3 and (3.9), this unifies and improves the previous local laws with operator norm (see [10, Eq. (2.11b) in Theorem 2.5]) and Hilbert-Schmidt norm (see [11, Corollary 2.4]) in the bulk of the spectrum. This follows by estimating (in the relevant ℓ ≲ 1 regime) |||Ai|||∞,ℓ ≲        ∥Ai∥ ℓ1/2 for [10, Eq. (2.11b) in Theorem 2.5] (Nℓ)1/2 ⟨|Ai|2⟩1/2 ℓ1/2 for [11, Corollary 2.4] (6.4) in (6.3) for Nℓ > 1 and every i ∈ [k] by means of elementary inequalities. Note that in the isotropic law (6.3) we use the |||Ai|||∞,ℓ norm instead of the |||Ai|||2k,ℓ norm in the corresponding averaged law (3.8). By taking Ak+1 := Nyx∗ (assume for simplicity that ⟨x, y⟩ = 0) in (3.8) for k → k +1, it would in fact be possible to obtain an isotropic law immediately from Theorem 3.3. However, the bound provided in (6.3) is stronger than that, as can be seen by means of (3.6) and |||Ak+1|||2(k+1),ℓ ∼ N/(Nℓ) 1 2(k+1) , which yield 1 √ Nℓ Y i∈[k] |||Ai|||∞,ℓ ≲ 1 N Y i∈[k+1] |||Ai|||2(k+1),ℓ . (6.5) In case that all Ai for i ∈ [k] have large rank, the lhs. of (6.5) is in fact much smaller (by some inverse (Nℓ)-power) than the rhs. of (6.5). As for Theorem 3.3, we now give a concrete example (6.6) how to use Theorem 6.2 for general (i.e. not necessarily traceless) matrices. 17Analogously to Footnote 10, we point out that the case of k odd admits an improved bound by Q i∈[k] ∥Ai∥ 1 k |||A||| 1− 1 k ∞,ℓ , but we do not follow this improvement for simplicity. 22 CIPOLLONI, ERD ˝OS, AND HENHEIK Example 6.3. For k = 1, by (6.3), we have \f\f\f\f⟨x, G1BG2y⟩ − m1m2Bxy − m1m2⟨B⟩⟨x, y⟩ 1 − m1m2 \f\f\f\f ≺ |⟨B⟩| √ Nℓ3 + ⟨|˚ B|2⟩1/2 √ Nℓ2 + ∥˚ B∥ √ Nℓ , (6.6) for a general matrix B = ˚ B + ⟨B⟩, completely analogously to (3.11). 6.1. Isotropic law: Proof of Theorem 6.2. Analogously to the proof of the averaged law, Theo- rem 3.3, the proof of the isotropic law, Theorem 6.2, is also conducted via the Zigzag strategy with natural modifications, so we will be very brief. The initial step, the global law, has already been proven in [10, Theorem 2.5] (see Eq. (2.11b) in the d ≥ 1 regime, which is even stronger than (6.7) below). Proposition 6.4 (Step 1: Isotropic global law). Let W be a Wigner matrix satisfying Assumption 2.1, and fix k ∈ N and δ > 0. Consider spectral parameters z1, ..., zk+1 ∈ C \\ R, the associated resolvents Gj = G(zj) := (W − zj)−1, and deterministic matrices B1, ..., Bk ∈ CN×N. Then, uniformly in spectral parameters satisfying d := minj∈[k+1] dist(zj, [−2, 2]) ≥ δ, deterministic matrices B1, ..., Bk and deter- ministic vectors x, y with ∥x∥, ∥y∥ ≲ 1, it holds that \f\f\f \u0000G1B1...BkGk+1 \u0001 xy − \u0000M[1,k+1] \u0001 xy \f\f\f ≺ Q i∈[k] |||Bi|||∞,d √ Nd . (6.7) In the second step, the global law is propagated to a local law through the characteristic flow (4.1)– (4.2), thereby introducing an order one Gaussian component. The proof of Proposition 6.5 is postponed to Appendix A.2.1. Proposition 6.5 (Step 2: Isotropic characteristic flow). Fix any ϵ, γ > 0, a time 0 ≤ T ≤ γ, and K ∈ N. Consider z1,0, . . . , zK+1,0 ∈ C \\ R as initial conditions to the solution zj,t of (4.2) for 0 ≤ t ≤ T and define Gj,t := Gt(zj,t) as well as ηj,t := |Im zj,t| and ρj,t := π−1|Im m(zj,t)|. Let k ≤ K, define ℓt := minj∈[k+1] ηj,tρj,t and recall (3.5). Assuming that \f\f\f \u0000G1,0A1...AkGk+1,0 \u0001 xy − \u0000M[1,k+1],0 \u0001 xy \f\f\f ≺ 1 √Nℓ0 Y i∈[k] |||Ai|||∞,ℓ0 (6.8) holds uniformly for any k ≤ K, any choice of deterministic traceless A1, ..., Ak, any choice of zi,0’s such that Nℓ0 ≥ N ϵ and maxj∈[k] |zj,0| ≤ N 1/ϵ, and all deterministic vectors ∥x∥, ∥y∥ ≲ 1, then we have \f\f\f \u0000G1,T A1...AkGk+1,T \u0001 xy − \u0000M[1,k+1],T \u0001 xy \f\f\f ≺ 1 √NℓT Y i∈[k] |||Ai|||∞,ℓT (6.9) for any k ≤ K, again uniformly in traceless matrices Ai, in deterministic vectors x, y with ∥x∥, ∥y∥ ≲ 1 and in spectral parameters satisfying NℓT ≥ N ϵ and maxj∈[k] |zj,T | ≤ N 1/ϵ. In the third and final step, we remove the Gaussian component introduced in Proposition 6.5 by a GFT argument. The proof of Proposition 6.6 is given in Section 6.2.1 below. Proposition 6.6 (Step 3: Isotropic Green function comparison). Let H(v) and H(w) be two N × N Wigner matrices with matrix elements given by the random variables vab and wab, respectively, both satisfying Assumption 2.1 and having matching moments up to third order, i.e. E¯vu abvs−u ab = E ¯wu abws−u ab , s ∈ {0, 1, 2, 3} , u ∈ {0, ..., s} . (6.10) Fix K ∈ N and consider spectral parameters z1, ..., zK+1 ∈ C \\ R satisfying minj Nηjρj ≥ N ϵ and maxj |zj| ≤ N 1/ϵ for some ϵ > 0 and the associated resolvents G(#) j = G(#)(zj) := (H(#) − zj)−1 with # = v, w. Pick traceless matrices A1, ..., AK ∈ CN×N. For any k ≤ K, consider any subset of cardinality k+1 of the K +1 spectral parameters, and similarly, consider any subset of cardinality k of the deterministic matrices. Relabeling them by [k + 1] and [k], respectively, setting ℓ := minj∈[k+1] ηjρj and recalling (3.5), we assume that for Gj = G(v) j we have \f\f\f \u0000G1A1...AkGk+1 \u0001 xy − \u0000M[1,k+1] \u0001 xy \f\f\f ≺ 1 √ Nℓ Y i∈[k] |||Ai|||∞,ℓ , (6.11) uniformly in all choices of subsets of z’s and A’s and in bounded deterministic vectors ∥x∥, ∥y∥ ≲ 1. Then, (6.11) also holds for the ensemble H(w), i.e. for Gj = G(w) j , uniformly in all choices of subsets of z’s and A’s and in bounded deterministic vectors ∥x∥, ∥y∥ ≲ 1. OUT-OF-TIME-ORDERED CORRELATORS FOR WIGNER MATRICES 23 Based on Propositions 6.4–6.6, the proof of Theorem 6.2 is concluded in the same way as the proof of Theorem 3.3 in the end of Section 4. □ 6.2. GFT argument: Proof of Propositions 4.4 and 6.6. The principal idea of the GFT argument is the same as in [14, Section 5] and even the detailed argument almost directly translates to our case. The main difference is that we now use the conceptual mean and standard deviation sizes m/s (recall (5.5)) and miso/siso (see (6.13) and (A.5) below) as basic deterministic control quantities; while in [14, Section 5] they were not introduced explicitly as they essentially boiled down to simple N-powers. More precisely, in view of the bounds [14, Eqs. (2.17)–(2.18) and (2.20)–(2.21)], we simply replace (ignoring all the ρ-factors and using the normalization ⟨|Ai|2⟩ = 1 for the just mentioned terms in [14]) N k/2 Nℓ −→ mk , N k/2 (Nℓ)1/2 −→ sk , N k/2 −→ miso k , and N k/2 ℓ1/2 −→ siso k . (6.12) Given this similarity (6.12) we will henceforth be very brief and only point out a few minor adaptions of the proof in [14, Section 5] to our new conceptual notations in Sections 6.2.1–6.2.2, discussing the isotropic and averaged case, respectively. For further simplicity of notation, we shall drop all irrelevant sub-scripts of resolvents and deterministic matrices, i.e. write G = Gj and A = Aj. Additionally, we will also drop the qG- and G(γ)-notations (see [14, Eq. (5.10)]), indicating the precise step in the replacement procedure, as it will be irrelevant for the modifications discussed below. 6.2.1. Part (a): Proof of the isotropic law, Proposition 6.6 (cf. Section 5.2 in [14]). We start with some preliminaries. In order to express the bounds in (6.2) and (6.3) concisely, we employ the miso/siso-notation (the isotropic mean and standard deviation sizes, analogously to (5.5) in the average case) to write (6.2) and (6.3) as \f\f(M[1,k+1])xy \f\f ≲ (|||A|||∞,ℓ)k =: miso k and \f\f\f \u0000(GA)kG \u0001 xy − \u0000M[1,k+1] \u0001 xy \f\f\f ≺ (|||A|||∞,ℓ)k √ Nℓ =: siso k N 1/2 , (6.13) respectively (the general definition of miso/siso is given in (A.5)). Moreover, we also write Mj−i+1 ≡ M[i,j] for all 1 ≤ i < j ≤ k + 1 with a slight abuse of notation (see [14, Eq. (5.33)]). Lastly, we will heavily use the following relations, proven in parts (i)–(ii) of Lemma A.2, miso j miso k−j ≲ miso k , siso j siso k−j ≲ ℓ−1/2siso k , and miso k ≲ ℓ1/2 siso k (6.14) for all k ∈ N and 0 ≤ j ≤ k using the conventions miso 0 := 1 and siso 0 := ℓ−1/2 (recall ℓ = mini ηiρi). With (6.13)–(6.14) at hand, we can now discuss the two bits of the argument in [14, Section 5.2], which are not completely straightforward to adapt to our current setting (cf. Case (i) and Case (ii) in [14, Section 5.2.2]). We will refer to explicit equation numbers within a longer proof in [14] that we do not repeat here, hence the reader needs to be familiar with [14, Section 5.2] to follow the details. However, to facilitate a high level understanding without going into details, we recall the novel idea in [14]. Traditional GFT proofs via the Lindeberg strategy estimated the change of, say, E \f\f\u0000(GA)kG \u0001 xy \f\fp after each replacement vab → wab and showed that it is bounded by o(N −2)-times its natural target size, so N 2 replacements were affordable. In other words the telescopic summation over (a, b) ∈ [N]2 was done trivially. This does not hold for the self-consistent GFT argument in [14]: the replacement for some (a, b) pairs may be too large, but their sum is still affordable. We will refer to it as the gain from the summation idea. This is related to our efforts to control the observables in tracial norms; the simplest toy example is the estimate 1 N 2 X ab |Aab| ≤ N −1/2⟨|A|2⟩1/2 (6.15) which is optimal. However, if we use the best available bound |Aab| ≤ ∥A∥ for each summand individually, then the lhs. of (6.15) is overestimated by ∥A∥ which is much bigger than the rhs. With keeping this idea in mind, we now return to the detailed modifications in [14, Section 5.2.2]. The terms considered in Case (i) are the ones for which there are enough (G − M)-type terms to balance the N-prefactor (cf. (6.16) and (6.17)) by solely using (6.14). The terms in Case (ii) require to gain from the summation over all steps in the replacement procedure. 24 CIPOLLONI, ERD ˝OS, AND HENHEIK Case (i): First, the analog of [14, Eq. (5.34)] becomes (neglecting the irrelevant |Ψk|p−1- and N ξ-factors) N 1/2 siso k X 0≤kl≤k−1: P l kl=k E h\f\f\u0000(GA)k1G − Mk1+1 \u0001 xei \u0000Mk2+1 \u0001 ejej \u0000Mk3+1 \u0001 eiei \u0000Mk4+1 \u0001 ejej \u0000Mk5+1 \u0001 eiy \f\f + \f\f\u0000(GA)k1G − Mk1+1 \u0001 xei \u0000(GA)k2G − Mk2+1 \u0001 ejej \u0000Mk3+1 \u0001 eiei \u0000Mk4+1 \u0001 ejej \u0000Mk5+1 \u0001 eiy \f\f + ... i ≲ N 1/2 siso k X 0≤kl≤k−1: P l kl=k \" siso k1 N 1/2  5 Y l=2 miso kl ! + siso k1 siso k2 N  5 Y l=3 miso kl ! + ... # ≲ \u0014 1 + 1 (Nℓ)1/2 + ... \u0015 ≲ 1 . (6.16) In the penultimate step we used the relations in (6.14) multiple times to estimate siso k1 Q5 l=2 miso kl ≲ siso k and siso k1 siso kl Q5 l=3 miso kl ≲ ℓ−1/2siso k , and similarly for the other analogous terms indicated by dots. The last step in (6.16) is due to Nℓ > 1. Case (ii): Second, the key trick in [14, Section 5.2.2], the gain from summations described in [14, Exam- ple 5.7], turns into the following. The trivial estimate, cf. [14, Eq. (5.36)], reads (again neglecting the irrelevant |Ψk|p−1- and N ξ-factors) N 1/2 siso k X 0≤kl≤k: P l kl=k h\f\f\u0000Mk1+1 \u0001 xei \u0000Mk2+1 \u0001 ejej \u0000Mk3+1 \u0001 eiei \u0000Mk4+1 \u0001 ejej \u0000Mk5+1 \u0001 eiy \f\f + ... i ≲ N 1/2 siso k X 0≤kl≤k: P l kl=k \" 5 Y l=1 miso kl ! + ... # ≲ (Nℓ)1/2 , (6.17) where we again used (6.14) multiple times. Analogously to [14, Eq. (5.37)], this can be improved on by averaging over all replacement steps: Fixing one constellation of kl’s in (6.17), we find N 1/2 siso k 1 N 2 X i,j h\f\f\u0000Mk1+1 \u0001 xei \u0000Mk2+1 \u0001 ejej \u0000Mk3+1 \u0001 eiei \u0000Mk4+1 \u0001 ejej \u0000Mk5+1 \u0001 eiy \f\f + ... i ≲ (Nℓ)1/2 1 N 2 X i,j \"\f\f(Mk1+1)xei \f\f miso k1 + ... # ≲ (Nℓ)1/2 1 N 1/2 ≲ 1 (6.18) in the relevant ℓ ≤ 1 regime (the opposite regime being covered by Proposition 6.4). To go to the second line, we employed (6.14). In the penultimate step, we used X i \f\f(Mk1+1)xei \f\f ≤ √ N q\u0000|Mk1+1|2\u0001 xx ≲ √ N miso k1 , (6.19) which follows by a Schwarz inequality, completely analogously to [14, Eq. (5.38)–(5.39)]. With these two slight adjustments, which rest on the estimates in (6.14), the proof in [14, Section 5.2] can entirely be translated to our current setting in a straightforward way, so we omit further details. This concludes the proof of Proposition 6.6. □ 6.2.2. Part (b): Proof of the averaged law, Proposition 4.4 (cf. Section 5.3 in [14]). For the averaged law, in addition to the bounds in (6.13)–(6.14), we will also use the relations mk ≲ miso k , sk ≲ ℓ1/2 siso k , and siso k ≲ N \u0002 1 + (Nℓ)−1/2\u0003 sk (6.20) from (A.11)–(A.12) in Lemma A.3 for all k ∈ N. Just as in the case of Section 6.2.1, there are two bits of the argument in [14, Section 5.3], that are not entirely straightforward to adjust to the setting of the current paper (cf. Case (i) and Case (ii) in [14, Section 5.3]). Analogously to the isotropic case in Section 6.2.1, while the terms considered in Case (i) solely use (6.14) and (6.20), the terms in Case (ii) require to gain from the summation over all steps in the replacement procedure. OUT-OF-TIME-ORDERED CORRELATORS FOR WIGNER MATRICES 25 Case (i): First, consider [14, Eq. (5.54)] with d = 2 (for concreteness). Then, the estimate turns into (neglecting the irrelevant N ξ-factor) \u0012N sk \u00132 1 N 2 X k1+k2=k k′ 1+k′ 2=k \" miso k1 siso k2 N 1/2 miso k′ 1 siso k′ 2 N 1/2 + miso k1 miso k2 siso k′ 1 N 1/2 siso k′ 2 N 1/2 + ... # ≲ \u0014 1 + 1 Nℓ \u0015 ≲ 1 , where we used (6.14) and (6.20) to bound miso k1 siso k2 ≲ ℓ−1/2[1 + (Nℓ)1/2]sk as well as miso k1 miso k2 ≲ [1 + (Nℓ)1/2]sk and siso k′ 1 siso k′ 2 ≲ ℓ−1[1 + (Nℓ)1/2]sk in the penultimate step, and the last step used Nℓ > 1. Case (ii): Second, we again discuss how to gain from the summation, as originally explained in [14, Ex- ample 5.11]. The trivial estimate from [14, Eq. (5.55)], again neglecting the irrelevant |Ψk|p−1 factor and fixing one constellation of kl’s summing up to k, becomes (neglecting the irrelevant N ξ-factor) (sk)−1 h\f\f\u0000Mk1+1 \u0001 eiei \u0000Mk2+1 \u0001 ejej \u0000Mk3+1 \u0001 eiei \u0000Mk4+1 \u0001 ejej \f\f + ... i ≲ (sk)−1 \"Y l miso kl + ... # ≲ (Nℓ)1/2 , (6.21) where we used (6.14) and (6.20). Analogously to [14, Eq. (5.59)], we can again improve upon this by averaging over all replacement positions. The key for this gain from the summation is the bound ⟨|Mk+1|2⟩ ≲ (sk)2 ∀k ∈ N , (6.22) which can be obtained completely analogously to [14, Lemma 5.12]. Armed with (6.22), the analog of the improved bound [14, Eq. (5.59)] now reads (again neglecting the irrelevant N ξ-factor) (sk)−1 1 N 2 X i,j h\f\f\u0000Mk1+1 \u0001 eiei \u0000Mk2+1 \u0001 ejej \u0000Mk3+1 \u0001 eiei \u0000Mk4+1 \u0001 ejej \f\f + ... i ≲(sk)−1   Y l∈[4]   1 N X i \f\f\u0000Mkl+1 \u0001 eiei \f\f2 !1/2 + ...   ≲ (sk)−1   Y l∈[4] skl + ...   ≲ 1 , (6.23) where in the first step we employed a trivial Schwarz inequality. With the above two slight adjustments at hand, which basically rest on the estimates in (6.14), (6.20) and (6.22), we can straightforwardly translate the entire proof of the averaged part in [14, Section 5.3] to our current setting. This finishes our discussion of the adjustments of the arguments from [14, Section 5.2] and thus the proof of Proposition 4.4. □ Appendix A. Additional technical results In this section we prove several additional technical results which were used in the main sections. A.1. Bound on the deterministic approximation: Proofs of Lemmas 3.2 and 6.1. We will deduce Lemmas 3.2 and 6.1 from the following stronger bound. Part (a) of Lemma A.1 is already proven in [14, Lemma A.1] applied to the special case Ik = ∅. The proof of part (b) is analogous to that and hence omitted. Lemma A.1 (cf. Lemma A.1 in [14]). Fix k ≥ 1 and let A1, ..., Ak ∈ CN×N be traceless deterministic matrices. (a) Consider spectral parameters z1, ..., zk ∈ C \\ R and define η := minj∈[k] |Im zj|. Then, for every 1 ≤ s ≤ ⌊k/2⌋ and π ∈ NC([k]) with |π| = k + 1 − s, it holds that \f\f\f\f\f⟨pTrK(π)(A1, . . . , Ak−1)Ak⟩ Y S∈π m◦[S] \f\f\f\f\f ≲ 1 ηs−1     Y S∈K(π) |S|≥2 Y j∈S ⟨|Aj||S|⟩ 1 |S|     . (A.1) with m◦[S] being defined in (3.3). For s > ⌊k/2⌋ the lhs. of (A.1) equals zero. 26 CIPOLLONI, ERD ˝OS, AND HENHEIK (b) Consider spectral parameters z1, ..., zk+1 ∈ C \\ R and define η := minj∈[k+1] |Im zj|. Then, for every 1 ≤ s ≤ ⌈(k + 1)/2⌉ and π ∈ NC([k + 1]) with |π| = k + 1 − s, it holds that \r\r\r\r\rpTrK(π)(A1, . . . , Ak) Y S∈π m◦[S] \r\r\r\r\r ≲ 1 ηs−1     Y S∈K(π)\\B: |S|≥2 Y j∈S ⟨|Aj||S|⟩ 1 |S|       Y j∈B\\{k+1} ∥Aj∥   . (A.2) where B ≡ B(k + 1) ∈ K(π) being the unique block containing k + 1 (recall (3.1)). For s > ⌈(k + 1)/2⌉ the lhs. of (A.2) equals zero. Given Lemma A.1, analogously to [14, Appendix A.1], the proofs of Lemmas 3.2 and 6.1 immediately follow after realizing that η ≳ ℓ and applying H¨older’s and Young’s inequality. To show this mechanism, consider (A.1) for an example where k = 6 and s = 2, and focus on the non-crossing partition π = {15|2|3|4|6} for which K(π) = {1234|56}. In this case, the rhs. of (A.1) can be estimated as η−1  4 Y i=1 ⟨|Ai|4⟩1/4 !  6 Y i=5 ⟨|Ai|2⟩1/2 ! ≲ ℓ  4 Y i=1 \u0002 ⟨|Ai|6⟩1/8ℓ−1/8\u0003 \u0002 ⟨|Ai|2⟩1/8ℓ−1/8\u0003 !  6 Y i=5 ⟨|Ai|2⟩1/2ℓ−1/2 ! ≲ ℓ Y i∈[6] \u0012⟨|Ai|6⟩1/6 ℓ1/6 + ⟨|Ai|2⟩1/2 ℓ1/2 \u0013 . In the first step, we employed η ≳ ℓ and H¨older’s inequality in the form ⟨|Ai|4⟩1/4 ≤ ⟨|Ai|6⟩1/8⟨|Ai|2⟩1/8 for i ∈ [4]. In the second step, we then used Young’s inequality for i ∈ [4] and added ⟨|Ai|6⟩1/6ℓ−1/6 for i = 5, 6 to complete the |||Ai|||6,ℓ norm for all i ∈ [6] (recall (3.5) and (3.7)). □ A.2. GFT and isotropic local law: Additional proofs for Section 6. A.2.1. Isotropic law: Proof of Theorem 6.2. In this section we want to study chains of the form (G1A1 . . . AkGk+1)xy := ⟨x, G1A1 . . . AkGk+1y⟩, (A.3) for unit deterministic vectors x, y. Following the notation (5.4), by G[1,k+1],t we denote the evolution of the quantity in (A.3) along the Ornstein-Uhlenbeck flow (4.1) with the characteristic equation (4.2). Then, by (5.3) and Lemma 5.5 (used for k → k + 1), choosing Ak+1 = Nyx∗, we obtain the flow d(G[1,k+1],t − M[1,k+1],t)xy = 1 √ N N X a,b=1 ∂ab(G[1,k+1],t)xydBab,t + k 2(G[1,k+1],t − M[1,k+1],t)xydt + k+1 X i,j=1 i<j ⟨G[i,j],t − M[i,j],t⟩(M[1,i]∪[j,k+1],t)xydt + k+1 X i,j=1 i<j ⟨M[i,j],t⟩(G[1,i]∪[j,k+1],t − M[1,i]∪[j,k+1],t)xydt + k+1 X i,j=1 i<j ⟨G[i,j],t − M[i,j],t⟩(G[1,i]∪[j,k+1],t − M[1,i]∪[j,k+1],t)xydt + k+1 X i=1 ⟨Gi,t − mi,t⟩(G(i) [1,k+1],t)xydt, (A.4) where we used the notation (G[1,i]∪[j,k+1],t)xy := (G1,tA1 . . . Ai−1Gi,tGj,tAj . . . Ak−1Gk+1,t)xy and similarly for M[1,i]∪[j,k+1],t. OUT-OF-TIME-ORDERED CORRELATORS FOR WIGNER MATRICES 27 Deterministic control quantities. Next, we introduce the new isotropic control quantities, the ana- logues of the averaged quantities defined in (5.5) (recall (3.5) for the definition of |||Aα|||∞,ℓ): miso k (ℓ; AJk) := Y α∈Jk |||Aα|||∞,ℓ and siso k (ℓ; AJk) := ℓ−1/2 Y α∈Jk |||Aα|||∞,ℓ , (A.5) which will be called the isotropic mean size and isotropic standard deviation size, respectively. They are functions of a positive number ℓ (usually given by ℓ = mini ηiρi for some spectral parameters zi) and a multiset AJk = (Aα)α∈Jk of deterministic matrices of cardinality |Jk| = k. Similarly to the paragraph below (5.5), we may often omit the arguments of miso k and siso k , write Jk instead of AJk, and for time dependent spectral parameters we use the short–hand notations miso k (t) = miso k (t; Jk) = miso k (ℓt; AJk) and siso k (t) = siso k (t; Jk) = siso k (ℓt; AJk). Note that with this definitions, by (6.2), we have (analogously to (5.6)), with ηt := mini ηi,t, \f\f(M[i,j],t)xy \f\f ≲ miso j−i(t) and \f\f(M[1,i]∪[j,k+1],t)xy \f\f ≲ η−1 t miso k−(j−i)(t) . (A.6) We now record the following relations about miso k /siso k , analogously to Lemma 5.1. The proof is again an immediate consequence of (3.6) and ℓs ≳ ℓt for s ≤ t (recall the discussion below (4.5)) and hence omitted. Lemma A.2 (miso/siso-relations). Let k ≥ 1 and consider time-dependent spectral parameters z1,t, ..., zk+1,t and a multiset of traceless matrices AJk as above. Set ℓt := minj∈[k+1] ηj,tρj,t. Then, the mean size miso k and the standard deviation size siso k satisfy the following inequalities (using the conventions miso 0 (t) := 1 and siso 0 (t) := ℓ−1/2 t ). (i) Super-multiplicativity; i.e. for any 0 ≤ j ≤ k it holds that miso j (t; Jj) miso k−j(t; Jk−j) ≲ miso k (t; Jk) and siso j (t; Jj) siso k−j(t; Jk−j) ≲ ℓ−1/2 t siso k (t; Jk) (A.7) for all disjoint decompositions Jk = Jj ˙∪Jk−j. (ii) The mean size can be upper bounded by the standard deviation size as miso k (t; Jk) ≲ ℓ1/2 t siso k (t; Jk) . (A.8) (iii) The standard deviation size satisfies the doubling inequality siso 2k (t; Jk ∪ Jk) ≲ ℓ1/2 t \u0000siso k (t; Jk) \u00012 , (A.9) where Jk ∪ Jk denotes the union of the multiset Jk with itself. (iv) Monotonicity in time: for any 0 ≤ s ≤ t and α ∈ [0, 1/2], we have miso k (s; Jk) ≲ miso k (t; Jk) and siso k (s; Jk) ℓα s ≲ siso k (t; Jk) ℓα t . (A.10) Moreover, we have the following relations among miso/siso and m/s from (5.5), whose proofs are again immediate from (3.6) and hence omitted. Lemma A.3 (miso/siso-m/s-relations). Let k ≥ 1, consider a multiset AJk of traceless matrices as above and fix ℓ > 0. Then, the mean sizes miso k and mk, and the standard deviation sizes siso k and sk, satisfy the following inequalities. (i) The average sizes m/s are bounded by the isotropic sizes miso/siso: mk(ℓ; Jk) ≲ miso k (ℓ; Jk) and sk(ℓ; Jk) ≲ ℓ1/2 siso k (ℓ; Jk) . (A.11) (ii) The isotropic standard deviation size can be upper bounded by the average standard deviation size siso k (ℓ; Jk) ≲ N \u0002 1 + (Nℓ)−1/2\u0003 sk(ℓ; Jk) . (A.12) Stochastic control quantities. Consider deterministic vectors x, y ∈ CN with ∥x∥, ∥y∥ ≲ 1, traceless matrices A1, . . . , Ak, and for k ≥ 1 define, analogously to (5.12)–(5.13), Ψiso k (t) = Ψiso k (t; x, y; z[1,k+1]; A[1,k]) := N 1/2 siso k (ℓt; A[1,k])(Nℓt)1/4 \f\f(G[1,k+1],t − M[1,k+1],t)xy \f\f , Φiso k (t) = Φiso k (t; x, y; z[1,k+1]; A[1,k]) := N 1/2 siso k (ℓt; A[1,k]) \f\f(G[1,k+1],t − M[1,k+1],t)xy \f\f , (A.13) 28 CIPOLLONI, ERD ˝OS, AND HENHEIK where we denoted the multisets of deterministic matrices by A[1,k] and z[1,k+1] = (z1, ..., zk+1) with zi = zi,0 (initial condition), respectively. Note that by (1.4), using the convention siso 0 (t) := ℓ−1/2 t , we have Φ0(t) ≺ 1, and that by (6.7) it follows Φiso k (0) ≺ 1, (A.14) for any k ≥ 1. Similarly to the averaged case (see the two paragraphs around (5.12)–(5.13)), also in the isotropic case we introduced the two quantities in (A.13) as we will first prove Ψiso k (t) = Φiso k (t)/(Nℓt)1/4 ≺ 1 using the master inequalities in Proposition A.4, and then use this as an input to prove Φiso k (t) ≺ 1 in Proposition A.5. Proposition A.4 (Isotropic master inequalities). Fix k ∈ N, assume that Ψiso l (t) ≺ ψiso l , with ψiso 0 := 1 and Φl(t) ≺ 1 (with Φl(t) from (5.13)), for any 0 ≤ l ≤ k + 1(k odd) uniformly in t ∈ [0, T]. Then Ψiso k (t) ≺ 1 + ψiso k + ψiso k+1(k odd) (NℓT )1/8 + k−1 X l=1 ψiso l (A.15) uniformly in t ∈ [0, T]. Analogously to Section 5, using Proposition A.4 we show that Ψiso k (t) ≺ 1 and then use this information as input to conclude Φiso k (t) ≺ 1: Proposition A.5. Fix k ∈ N, assume that Φiso l (t) ≺ 1, for 0 ≤ l ≤ k − 2, Φl(t) ≺ 1 for 0 ≤ l ≤ k (with Φl(t) from (5.12)), and Φk(t) ≺ (Nℓt)1/4 for l ≤ 2k, uniformly in t ∈ [0, T]. Then Φiso k (t) ≺ 1 (A.16) uniformly in t ∈ [0, T]. Closing the hierarchy. We start showing that (A.15), using iteration as in Lemma 5.4, in fact implies Ψk(t) ≺ 1. We start with k = 1, 2. By (A.15), we have Ψiso 1 (t) ≺ 1 + ψiso 1 + ψiso 2 (NℓT )1/8 , Ψiso 2 (t) ≺ 1 + ψiso 2 (NℓT )1/8 + ψiso 1 . (A.17) Then, by iteration, we obtain Ψiso 1 (t) ≺ 1 + ψiso 2 (NℓT )1/8 , Ψiso 2 (t) ≺ 1 + ψiso 1 . (A.18) Finally, plugging the first inequality into the second one and using iteration once again we obtain Ψiso 1 (t)+ Ψiso 2 (t) ≺ 1. Next, we proceed by induction. Fix an even k ∈ N, and assume that Ψiso l (t) ≺ 1 for l ≤ k − 2, then by (A.15) we have Ψiso k−1(t) ≺ 1 + ψiso k−1 + ψiso k (NℓT )1/8 , Ψiso k (t) ≺ 1 + ψiso k (NℓT )1/8 + ψiso k−1. (A.19) Proceeding exactly as in (A.17)–(A.18), by (A.19), we conclude that Ψiso l (t) ≺ 1 for any l ≤ k. Finally, using that as a consequence of (Nℓt)1/4Φiso k (t) = Ψiso l (t) ≺ 1 the hypothesis of Proposition A.5 are satisfied, we conclude that Φiso k (t) ≺ 1 and so the proof of Theorem 6.2. □ A.2.2. Isotropic master inequalities: Proofs of Propositions A.4–A.5. Proof of Proposition A.4. Note that the second term in the first line of (A.4) can be incorporated into the lhs. by differentiating e−kt/2(G[1,k+1,t] − M[1,k+1,t])xy. The exponential factor ekt/2 ∼ 1 is irrelevant, we thus neglect this term from the analysis. In the following we will often use the simple bound (5.2) even if not stated explicitly. Additionally, every time that two resolvents get next to each other in a chain we use the integral representation (5.24) to reduce their number by one at the price of an additional 1/η–factor (see e.g. (5.23)). We now start with the computation of the quadratic variation of the martingale term in (A.4): 1 N k+1 X i=1 \u0002 G[1,i],t(G[1,i],t)∗\u0003 xx \u0002 (G[i,k+1],t)∗G[i,k+1],t \u0003 yy dt. (A.20) OUT-OF-TIME-ORDERED CORRELATORS FOR WIGNER MATRICES 29 Similarly to the averaged case (see (5.27)–(5.31)), to estimate the quadratic variation of the martingale term in (A.4) we rely on the following reduction inequality for k ∈ N even and j ≤ k (here for simplicity we drop the indices of G’s and A’s): \f\f(G[1,k+j+1])xy \f\f ≲ √ N⟨|G|A(GA)j−1|G|(AG∗)j−1A⟩1/2 Y v∈{x,y} [(GA)k/2|G|(AG∗)k/2]1/2 vv . (A.21) The proof of (A.21) is postponed to the end of this section. Recall the conventions ψiso 0 = 1 and siso 0 (t) = ℓ−1/2 t , then using (A.21) for j = k − 2i + 2, i ≤ k/2 for even k (and j = k − 2i + 1, i ≤ (k + 1)/2 for odd k) and then (A.8), (5.8), to bound (recall (5.28) in Footnote 16) \u0002 (G[i,k+1],s)∗G[i,k+1],s \u0003 yy ≺ √ N \u0012 miso k (s) + siso k (s)(Nℓs)1/4 √ N \u0013 \u0012 ℓsm2(k−2i+2)(s) + s2(k−2i+2)(s) N \u00131/2 ≲ siso k (s) q s2(k−2i+2)(s)ℓ1/2 s \u0000p Nℓt + (Nℓt)1/4ψiso k \u0001 , (A.22) we estimate each term of (A.20) by √ N siso k (t)(Nℓt)1/4   1 N k+1 X i=1 Z t 0 \u0002 G[1,i],s(G[1,i],s)∗\u0003 xx \u0002 (G[i,k+1],s)∗G[i,k+1],s \u0003 yy ds !1/2 ≺ √ N siso k (t)(Nℓt)1/4  ⌈k/2⌉ X i=1 Z t 0 siso k (s) Nη2s   miso 2(i−1)(s) + ψiso 2(i−1)siso 2(i−1)(s)(Nℓs)1/4 √ N ! × \u0000p Nℓs + ψiso k+1(k odd)(Nℓs)1/4\u0001q ℓss2(k−i+1)(s) ds !1/2 ≲ √ N siso k (t)(Nℓt)1/4   ⌈k/2⌉ X i=1 Z t 0 siso k (s)siso k−i+1(s)siso i−1(s) Nη2s ℓ3/2 s   1 + ψiso 2(i−1) (Nℓs)1/4 ! \u0000p Nℓs + ψiso k+1(k odd)(Nℓs)1/4\u0001 ds   1/2 ≲ 1 + ⌈k/2⌉ X i=1 q ψiso 2(i−1) (Nℓs)1/8 + q ψiso k+1(k odd) (Nℓt)1/8 + ⌈k/2⌉ X i=1 q ψiso 2(i−1)ψiso k+1(k odd) (Nℓt)1/4 . (A.23) Here in the second inequality (A.8)–(A.9), (A.11), and in the last inequality we used (A.7), (A.10). In the following computations, when two G’s, with spectral parameters having imaginary parts of the same sign appear next to each other (i.e. without a A in between), we use the integral representation (5.24) to reduce the number of G’s by one at the price of an additional 1/η. If the imaginary parts of the spectral parameters have different signs, we use resolvent identity (see e.g. around (5.23)–(5.24) in the averaged case). For the terms in the second line of (A.4) we estimate √ N siso k (t)(Nℓt)1/4 Z t 0 ⟨G[i,j],s−M[i,j],s⟩(M[1,i]∪[j,k+1],s)xy ds ≺ √ N siso k (t)(Nℓt)1/4 Z t 0 sj−i(s) Nηs miso k−j+i(s) ηs ds ≲ 1 (Nℓt)3/4 , (A.24) where we used (A.6)–(A.8), the second inequality in (A.11), and (A.10). For the terms in the third line of (A.4) we estimate √ N siso k (t)(Nℓt)1/4 Z t 0 ⟨M[i,j],s⟩(G[1,i]∪[j,k+1],s − M[1,i]∪[j,k+1],s)xy ds ≺ √ N siso k (t)(Nℓt)1/4 Z t 0 mj−i(s) ηs siso k−j+i(s)ψiso k−j+i(Nℓs)1/4 √ Nηs ds ≲ ψiso k−j+i, (A.25) where in the last inequality we used the first inequality of (A.11), (A.7)–(A.8). 30 CIPOLLONI, ERD ˝OS, AND HENHEIK For the terms in the fourth line of (A.4) we estimate √ N siso k (t)(Nℓt)1/4 Z t 0 ⟨G[i,j],s − M[i,j],s⟩(G[1,i]∪[j,k+1],s − M[1,i]∪[j,k+1],s)xy ds ≺ √ N siso k (t)(Nℓt)1/4 Z t 0 sj−i(s) Nηs siso k−j+i(s)ψiso k−j+i(Nℓs)1/4 √ Nηs ds ≲ 1 Nℓt ψiso k−j+i, (A.26) where in the last step we used the second inequality of (A.11) and the second inequality of (A.7). Finally, for the term in the last line of (A.4) we estimate √ N siso k (t)(Nℓt)1/4 Z t 0 ⟨Gi,s − mi,s⟩(G(i) [1,k+1],s)xy ds ≺ √ N siso k (t)(Nℓt)1/4 Z t 0 1 Nηs \u0012miso k (s) ηs + siso k (s)ψiso k (Nℓs)1/4 √ Nηs \u0013 ds ≲ 1 (Nℓt)3/4 + ψiso k Nℓt , (A.27) where we used (A.6) and (A.8) together with (A.8). Combining (A.23)–(A.27), recalling that ⟨M[i,i+1],s⟩ = 0 in (A.25), using (A.14) to bound Ψiso k (0) ≺ 1 and NℓT ≥ 1, ψiso l ≥ 1, ℓt ≳ ℓT , we conclude (A.15). □ Proof of Proposition A.5. The proof of this proposition is analogous to the proof of Proposition A.5. All the terms except for the martingale one are estimated as in the proof of Proposition A.5 after multiplying each line by (Nℓt)1/4 and setting ψiso l = 1. We conclude the proof pointing out that the only difference is in the estimate of the quadratic variation of the martingale term, i.e. (A.23) has to be replaced by √ N siso k (t)   1 N k+1 X i=1 Z t 0 \u0002 G[1,i],s(G[1,i],s)∗\u0003 xx \u0002 (G[i,k+1],s)∗G[i,k+1],s \u0003 yy ds !1/2 ≺ √ N siso k (t)  Z t 0 ℓssiso 2(i−1)(s)siso 2k−2(i−1)(s) Nη2s ds !1/2 ≲ 1, (A.28) where in the first inequality we used the definition (A.13) together with (A.6), (A.8), and in the second inequality we used (A.7), (A.9)–(A.10). □ Proof of (A.21). By spectral decomposition we estimate \f\f(Q1G(z)Q2G(w)Q3)xy \f\f = \f\f\f\f\f\f X ij ⟨x, Q1ui⟩⟨ui, Q2uj⟩⟨uj, Q3uj⟩ (λi − z)(λj − w) \f\f\f\f\f\f ≲ √ N(Q1|G(z)|Q∗ 1)xx(Q∗ 3|G(w)|Q3)yy⟨|G(z)|Q2|G(w)|Q∗ 2⟩1/2, (A.29) where in the last inequality we used Schwarz inequality to separate Q2 from Q1, Q3. Choosing z = zk/2+1, w = zk/2+j+1, and Q1 = G1A1 . . . Ak/2, Q2 = Ak/2+1Gk/2+2 . . . Ak/2+j, Q3 = Ak/2+j+1Gk/2+j+2 . . . Gk+1, this concludes the proof. □ References [1] A. Adhikari, J. Huang. Dyson Brownian motion for general β and potential at the edge. Probability Theory and Related Fields 178, 893–950 (2020). [2] A. Adhikari, B. Landon. Local law and rigidity for unitary Brownian motion. Probability Theory and Related Fields 187.3, 753–815 (2023). [3] A. Aggarwal, J. Huang. Edge Rigidity of Dyson Brownian Motion with General Initial Data. arXiv: 2308.04236 (2023). [4] A. Bloemendal, L. Erd˝os, A. Knowles, H.-T. Yau, J. Yin. Isotropic local laws for sample covariance and generalized Wigner matrices. Electronic Journal of Probability 19, 33, 1–53 (2014). [5] O. Bohigas, M.-J. Giannoni, C. Schmit. Characterization of chaotic quantum spectra and universality of level fluctuation laws. Physical Review Letters 52, 1–4 (1984). [6] P. Bourgade. Extreme gaps between eigenvalues of Wigner matrices. Journal of the European Mathematical Society 24, 2823–2873 (2021). [7] G. Cipolloni, L. Erd˝os, D. Schr¨oder. Eigenstate Thermalisation Hypothesis for Wigner matrices. Communications in Mathematical Physics 388, 1005–1048 (2021). OUT-OF-TIME-ORDERED CORRELATORS FOR WIGNER MATRICES 31 [8] G. Cipolloni, L. Erd˝os, D. Schr¨oder. Thermalisation for Wigner matrices. Journal of Functional Analysis 282, 109394 (2022). [9] G. Cipolloni, L. Erd˝os, D. Schr¨oder. On the Spectral Form Factor for Random Matrices. Communications in Mathe- matical Physics 401, 1665–1700 (2023). [10] G. Cipolloni, L. Erd˝os, D. Schr¨oder. Optimal multi-resolvent local laws for Wigner matrices. Electronic Journal of Probability 27, 1–38 (2022). [11] G. Cipolloni, L. Erd˝os, D. Schr¨oder. Rank-uniform local law for Wigner matrices. Forum of Mathematics, Sigma 10, E96 (2022). [12] G. Cipolloni, L. Erd˝os, D. Schr¨oder. Mesoscopic central limit theorem for non-Hermitian random matrices. Accepted to Probability Theory and Related Fields, arXiv: 2210.12060 (2022). [13] G. Cipolloni, L. Erd˝os, J. Henheik, D. Schr¨oder. Optimal Lower Bound on Eigenvector Overlaps for non-Hermitian Random Matrices. arXiv: 2301.03549 (2023). [14] G. Cipolloni, L. Erd˝os, J. Henheik. Eigenstate thermalisation at the edge for Wigner matrices. arXiv: 2309.05488 (2023). [15] G. Cipolloni, L. Erd˝os, Y. Xu. Universality of extremal eigenvalues of large random matrices. arXiv: 2312.08325 (2023). [16] B. Collins, S. Matsumoto, J. Novak. The Weingarten Calculus. Notices of the American Mathematical Society 69, 5 (2022). [17] J. Cotler, N. Hunter-Jones, J. Liu, B. Yoshida. Chaos, complexity, and random matrices. Journal of High Energy Physics 2017, 48, 1–60 (2017). [18] J. M. Deutsch. Quantum statistical mechanics in a closed system. Physical Review A 43, 2046–2049 (1991). [19] L. Erd˝os, H.-T. Yau, J. Yin. Rigidity of eigenvalues of generalized Wigner matrices. Advances in Mathematics 229, 1435–1515 (2012). [20] L. Erd˝os, A. Knowles, H.-T. Yau, J. Yin. The local semicircle law for a general class of random matrices. Electronic Journal of Probability 18, No. 59, 1–58 (2013). [21] L. Erd˝os, H.-T. Yau. A dynamical approach to random matrix theory. American Mathematical Society, Vol. 28 (2017). [22] L. Erd˝os, T. Kr¨uger, D. Schr¨oder. Random matrices with slow correlation decay. Forum of Mathematics, Sigma 7, E8 (2019). [23] P. J. Forrester. Differential identities for the structure function of some random matrix ensembles. Journal of Statistical Physics 183, 2, 33 (2021). [24] P. J. Forrester. Quantifying dip–ramp–plateau for the Laguerre unitary ensemble structure function. Communications in Mathematical Physics 387, 1, 215–235 (2021). [25] P. J. Forrester, M. Kieburg, S. H. Li, J. Zhang. Dip-ramp-plateau for Dyson Brownian motion from the identity on U(N). Accepted to Probability and Mathematical Physics, arXiv: 2206.14950 (2022). [26] E. M. Fortes, R. A. Jalabert, D. A. Wisniacki. Gauging classical and quantum integrability through out-of-time-ordered correlators. Physical Review E 100, 4, 042201 (2019). [27] I. Garc´ıa-Mata, R. A. Jalabert, D. A. Wisniacki. Out-of-time-order correlations and quantum chaos. Scholarpedia 18, 4, 55237 (2023). [28] P. Hayden, J. Preskill. Black holes as mirrors: quantum information in random subsystems. Journal of High Energy Physics 2007, 09, 120 (2007). [29] J. Huang, B. Landon. Rigidity and a mesoscopic central limit theorem for Dyson Brownian motion for general β and potentials. Probability Theory and Related Fields 175, 209–253 (2019). [30] A. Kitaev. Hidden correlations in the Hawking radiation and thermal noise. Talk at Breakthrough Prize Symposium YouTube (2014). [31] A. Knowles, J. Yin. The isotropic semicircle law and deformation of Wigner matrices. Communications on Pure and Applied Mathematics 66, 1663–1749 (2013). [32] G. Kreweras. Sur les partitions non crois´ees d’un cycle. Discrete mathematics 1, 333–350 (1972). [33] B. Landon, P. Sosoe. Almost-optimal bulk regularity conditions in the CLT for Wigner matrices. arXiv: 2204.03419 (2022). [34] M. Lemm, S. Rademacher. Out-of-time-ordered correlators of mean-field bosons via Bogoliubov theory. arXiv: 2312.01736 (2023). [35] L. Leviandier M. Lombardi, R. Jost, J. Pique. Fourier transform: A tool to measure statistical level properties in very complex spectra. Physical Review Letters 56, 2449–2452 (1986). [36] D. Markovi´c, M. ˇCubrovi´c. Detecting few-body quantum chaos: out-of-time ordered correlators at saturation. Journal of High Energy Physics 2022, 5, 1–28 (2022). [37] S. Pappalardi, F. Fritzsch, T. Prosen. General Eigenstate Thermalization via Free Cumulants in Quantum Lattice Systems. arXiv: 2303.00713 (2023). [38] J. Reker. Multi-Point Functional Central Limit Theorem for Wigner Matrices. arXiv: 2307.11028 (2023). [39] J. Reker. Fluctuation Moments for Regular Functions of Wigner Matrices. arXiv: 2307.11029 (2023). [40] Y. Sekino, L. Susskind. Fast scramblers. Journal of High Energy Physics 2008,10, 065 (2008). [41] S. Xu, B. Swingle. Scrambling Dynamics and Out-of-Time-Ordered Correlators in Quantum Many-Body Systems. PRX Quantum 5, 1, 010201 (2024). "
}