{
    "optim": "1 HBF MU-MIMO with Interference-Aware Beam Pair Link Allocation for Beyond-5G mm-Wave Networks Aleksandar Ichkov∗, Alexander Wietfeld†, Marina Petrova‡ and Ljiljana Simi´c∗ ✦ Abstract—Hybrid beamforming (HBF) multi-user multiple-input multiple-output (MU-MIMO) is a key technology for unlocking the directional millimeter-wave (mm-wave) nature for spatial multiplexing beyond current codebook-based 5G-NR networks. In order to suppress co-scheduled users’ interference, HBF MU-MIMO is predicated on having sufficient radio frequency chains and accurate channel state information (CSI), which can otherwise lead to performance losses due to imperfect interference cancellation. In this work, we propose IABA, a 5G-NR standard-compliant beam pair link (BPL) allocation scheme for mitigating spatial interference in practical HBF MU-MIMO networks. IABA solves the network sum throughput optimization via either a distributed or a centralized BPL allocation using dedicated CSI reference signals for candidate BPL monitoring. We present a comprehensive study of practical multi-cell mm-wave networks and demonstrate that HBF MU-MIMO without interference-aware BPL allocation experiences strong residual interference which limits the achievable network performance. Our results show that IABA offers significant performance gains over the default interference- agnostic 5G-NR BPL allocation, and even allows HBF MU-MIMO to outperform the fully digital MU-MIMO baseline, by facilitating allocation of secondary BPLs other than the strongest BPL found during initial access. We further demonstrate the scalability of IABA with increased gNB antennas and densification for beyond-5G mm-wave networks. Index Terms—Beyond-5G, millimeter-wave, HBF MU-MIMO, BPL allo- cation, interference mitigation. 1 INTRODUCTION The spectrum-rich millimeter-wave (mm-wave) bands are a key enabler for the capacity enhancement of 5G and Beyond-5G cellular networks [1], with 3GPP designating numerous bands in the frequency range 2 (FR2) between 24.5–71 GHz for commercial deployments [2]. Overcom- ing the challenging propagation and blockage-prone nature of the mm-wave channel necessitates large antennas and beamforming at the next generation node B (gNB) and the ∗Aleksandar Ichkov and Ljiljana Simi´c are with the Institute for Networked Systems at RWTH Aachen University, Aachen 52072, Germany (e-mail: aic@inets.rwth-aachen.de, lsi@inets.rwth-aachen.de). †Alexander Wietfeld was with the Institute for Networked Systems at RWTH Aachen University, Aachen, Germany. Now he is with the Chair of Communi- cation Networks at Technical University of Munich, Munich 80333, Germany (e-mail: alexander.wietfeld@tum.de). ‡Marina Petrova is with the Institute for Networked Systems and the Mobile Communications and Computing Teaching and Research Area at RWTH Aachen University, Aachen 52072, Germany (e-mail: petrova@mcc.rwth-aachen.de). users (UEs), and a new type of beam management, in which the gNB and UE need to sweep their beam candidates se- quentially in order to establish connectivity via a directional beam pair link (BPL) [3], [4]. The existing limited deployments of 5G-NR FR2 net- works [5], [6] rely on codebook-based analog beamforming (CBF), as a low complexity and cost-effective solution, given that digital beamforming (DBF) is prohibitively complex and costly for large antenna arrays requiring a dedicated radio frequency (RF) chain per antenna element [7]. How- ever, CBF limits the transmission/reception to a single beam per time slot and RF chain over the entire instantaneous bandwidth, i. e. constituting a time division multiple access (TDMA) system [8], which limits the per-UE throughput in multi-UE networks. To better utilize the large bandwidth and directional nature of mm-wave links for beyond-5G deployments, 5G-NR also specifies the use of hybrid beam- forming (HBF) with multiple RF chains to simultaneously serve multiple UEs via individual BPLs, i. e. spatial layers in a multi-user multiple input multiple output (MU-MIMO) configuration [8]. This improves the spectral efficiency as multiple UEs are served with spatial division multiple ac- cess (SDMA) using the same time-frequency resources, and reduces latency as more UEs can be served simultaneously instead of waiting for their TDMA time slot. Unlocking the full potential of mm-wave networks by efficiently sharing the network capacity via SDMA comes with many challenges in real network deployments [9]. HBF MU-MIMO offers an attractive solution for mitigating the co-scheduled UE beam interference via digital precoding for interference cancellation. However, the efficiency of HBF MU-MIMO is predicated on: (i) the antenna configuration having sufficient RF chains, (ii) the beam codebook having sufficient steering resolution and (iii) resource scheduling being dynamic and able to adapt to up-to-date channel state information (CSI). In practice, the predefined gNB/UE codebooks play a key role in acquiring accurate CSI. The mm-wave channel can only be observed through the code- book entries which project the received RF signal to the baseband [10], and should therefore be properly designed to provide sufficient gain and angular steering resolution to estimate the full channel matrix. Prior mm-wave net- working studies on HBF MU-MIMO [11]–[18] have typically focused on designing the digital precoder for interference arXiv:2402.17573v1  [cs.NI]  27 Feb 2024 2 Reference Interference Channel Beamforming Multi-cell Intra-cell Inter-cell studies management model model network interference interference [11]–[14] Interference cancellation Geometric HBF ✗ ✗ Added-noise constant [15], [16] Interference cancellation 3GPP, NYUSIM HBF ✓ ✗ Estimate [17], [18] Interference cancellation Geometric HBF ✓ ✗ Added noise-constant [20], [21] Spatial BPL allocation 3GPP, NYUSIM Idealized ✓ ✗ Estimate [22], [23] Spatial BPL allocation Log-distance (LOS only) Idealized ✓ ✗ Estimate [24], [25] Spatial BPL allocation 3GPP, NYUSIM CBF ✓ Estimate Estimate [26] Spatial BPL allocation 3D ray-tracing CBF ✓ ✓ ✓ This paper Both 3D ray-tracing HBF ✓ ✓ ✓ TABLE 1: Related work on interference management approaches for mm-wave SDMA networks. cancellation assuming availability of perfect CSI at the gNB. In practice, CSI reporting is time consuming and subject to the gNB/UE codebooks, network control signaling and latency constraints [11], [12], which can lead to system performance degradation of HBF MU-MIMO due to imper- fect interference cancellation, e. g. [13], [16]. Moreover, [19] demonstrates that even under ideal digital precoding, there is still a considerable amount of strong residual inter-cell interference, which is highly dependent on the multi-UE BPL allocation for the network. A number of mm-wave SDMA studies [20]–[26] have instead focused on clustering co-scheduled UEs that can be served via spatially sepa- rated BPLs for SDMA gains, using CBF with a sufficient number of individual antenna arrays to serve all UEs. However, [25], [26] have shown that under realistic antenna and channel models, CBF entails strong residual interference which limits the extent of achievable BPL separation and SDMA gains. Interference management in practical mm- wave SDMA networks should therefore jointly consider the MU-MIMO interference cancellation and spatial BPL allocation. 1.1 Related Work The prior literature of these two main approaches for inter- ference management in mm-wave SDMA networks is sum- marized in Table 1. The first approach relies on designing a co-scheduled UE precoder for interference cancellation based on CSI at the gNB using HBF MU-MIMO [11]–[18]. The second approach focuses on interference-aware and load-balancing multi-UE BPL allocation using CBF serving UEs via individual antenna arrays [20]–[26]. Interference management for HBF MU-MIMO [11]–[18] typically treats the UE co-scheduling problem within a single cell [11]–[14], or limited multi-cell scenarios [15]–[18], designing the digital baseband precoder, e. g. zero-forcing, under the assumption of a sufficient number of RF chains and availability of perfect CSI at the gNB. This is not always guaranteed in practice, which can lead to perfor- mance degradation due to imperfect CSI and in turn only partial interference cancellation [13]. Authors in [14] show the SDMA performance gains of HBF MU-MIMO over CBF and study the end-to-end network implications. However, they only consider a single gNB serving seven UEs, and still show that the network suffers from significant control overhead and delay of acquiring full per-UE CSI. Authors in [15]–[18] consider HBF MU-MIMO in limited multi-cell network scenarios. [15] proposes a HBF MU-MIMO frame- work based on full CSI and multi-cell cooperation, showing that non-coordinated can outperform fully-coordinated HBF MU-MIMO under availability of only quantized CSI [16]. Authors in [17] propose a near interference-free UE schedul- ing (NIF), with [18] further generalizing the NIF frame- work for different SDMA optimization objectives, assuming perfect intra-cell interference cancellation and very limited inter-cell interference. However, [17], [18] only assume in- terference as an added noise constant, and UEs with only line-of-sight (LOS) links to their serving gNB and non- LOS (NLOS) links to the other interfering gNBs. Impor- tantly, [15]–[18] assume perfect coordination and synchro- nization between the gNBs, and neglect the practical over- head and delay constraints of obtaining full per-UE channel estimates, and thus only demonstrate HBF MU-MIMO per- formance under idealized network conditions. Interference management in CBF mm-wave SDMA net- works focuses on spatial BPL allocation for clustering co- scheduled UEs that can be sufficiently spatially separated, e. g. [20]–[26]. Authors in [20]–[22] demonstrate SDMA gains when sufficient BPL separation can be maintained to effectively eliminate intra-cell interference, whereas [23] models the interference in the angular domain but considers LOS links only. However, the studies in [20]–[23] rely on statistical channel models and idealized sector antennas, that neglect the spatial distribution of feasible BPLs and the resulting interference implications. Authors in [24] propose a CBF approach using codebooks with low inter-beam over- lap, and show that it can outperform HBF MU-MIMO as- suming quantized CSI feedback. However, [24] only consid- ers a single gNB serving UEs based on sum-rate clustering and only estimates the interference as added noise. The au- thors in [25] propose a load-balancing UE association which swaps the worst gNB-UE connection (WCS) at each itera- tion considering the per-slot interference estimate. In [26] we show that under realistic channel considerations, the non-negligible sidelobes of realistic arrays result in signif- icant intra-cell interference which strongly limits the SDMA gains. Additionally, [26] proposes an interference-aware BPL allocation for CBF SDMA networks which outperforms the WCS benchmark [25]. In particular, [26] demonstrates the benefits of spatial BPL allocation by using secondary BPLs for interference mitigation, going beyond the default 5G-NR association to the strongest BPL found during initial access typically considered in the literature, e.g. [13]–[18], [24], [25]. 1.2 Contributions In this paper, we extend beyond the prior literature (cf. Table. 1) and propose an interference-aware BPL allo- cation (IABA) for practical mm-wave HBF MU-MIMO net- works that goes beyond the default 5G-NR association to the strongest BPL found during initial access. We are thus the 3 first to jointly consider MU-MIMO interference cancellation and spatial BPL allocation for interference management in practical mm-wave HBF MU-MIMO networks. The main contributions of this work are as follows: • We present an extensive study of multi-cell mm-wave HBF MU-MIMO networks based on site-specific chan- nel data obtained via 3D ray-tracing with realistic building and antenna models, the accuracy of which we have validated against real-world phased antenna arrays measurements [27], [28], and network config- uration following 3GPP specifications for multi-sector antennas, initial access and channel estimation [29]. • We therefore characterize the residual intra- and inter- cell interference in practical mm-wave HBF MU-MIMO networks, given the spatial distribution of feasible BPLs and 5G-NR CSI signaling, showing that interference becomes the main limiting factor of HBF MU-MIMO performance, which is in contrast to prior studies as- suming limited to no-interference operation [15]–[18]. • We propose IABA, a 5G-NR-compliant BPL allocation, as a solution for mitigating the spatial interference in practical mm-wave HBF MU-MIMO networks. We solve the network sum throughput optimization objec- tive via either a distributed or a centralized BPL allocation using dedicated channel state information-reference signal (CSI-RS) resources for candidate BPL monitoring. • Our results show that IABA offers significant net- work performance gains over default 5G-NR, by fa- cilitating allocation of secondary BPLs other than the strongest BPL found during initial access. We further demonstrate that under realistic CSI signaling con- straints, IABA allows HBF MU-MIMO to outperform the interference-agnostic DBF MU-MIMO baseline. 1.3 Organization of the paper The rest of this paper is organized as follows. Sec. 2 details the system model considerations, including channel and multi-panel antenna models, beamforming, channel estima- tion and multi-UE interference cancellation, and presents key performance evaluation metrics. Sec. 3 presents the BPL allocation problem and our IABA algorithm and 5G-NR- compliant operation. Sec. 4.1 presents the simulation model, and Sec. 4.2 presents the results. Sec. 5 concludes the paper. 2 SYSTEM MODEL 2.1 mm-Wave Channel Model We model the 3D directional mm-wave channel between the gNB and the UE as a set of K LOS and NLOS propagation paths using the geometric channel model [30]. Assuming a gNB as the transmitter with Nt antenna elements and a UE as the receiver with Nr antenna elements, we define the geometric Nr × Nt channel matrix H as H = r NrNt K K X k=1 αkar (ϕr k, θr k) aH t \u0000ϕt k, θt k \u0001 , (1) where αk denotes the complex channel gain of the kth path, and {ϕt k, θt k} and {ϕr k, θr k} denote the angle of departure (AoD) and angle of arrival (AoA) in azimuth and eleva- tion, respectively. The transmit and receive antennas are −90 −60 −30 0 30 60 90 −20 0 20 ϕ (◦) G (dBi) Fig. 1: Example codebook with 16 beams for a sector antenna covering the steering range of ϕ ∈ (−45◦, 45◦). described by their steering vectors at and ar, which are identical to the phase-shifting weights applied to steer the antenna arrays towards the AoD and AoA, respectively [10]. For the special case of an N element uniform linear array (ULA) positioned along the y-axis and steered towards angle ϕ in azimuth, the array steering vector is given as aULA(ϕ) = 1 √ N h 1 ej2π d λ sin(ϕ) · · · ej(N−1)2π d λ sin(ϕ)iT . (2) We generalize it to a uniform rectangular array (URA) in the y-z plane, with the array steering response given as aURA(θ, ϕ) = ah, ULA(ϕ) ⊗ av, ULA(θ), (3) where ⊗ denotes the Kronecker product of the horizontal steering vector determining the azimuth response ah, ULA(ϕ) and the vertical steering vector for the elevation response av, ULA(θ) of a same sized ULA (2). Finally, we express the downlink received signal y as y = wH c HWps + wH c n, (4) where wH c denotes the Hermitian of the combining vector, Wp denotes the precoding matrix, s denotes the data stream vector, and n denotes the noise vector. We use an open-source mm-wave ray-tracing tool to obtain site-specific directional channel data based on real 3D building and antenna models [27], [28]. We perform ded- icated ray-tracing runs for each gNB position in our multi- cell network (cf. Sec. 4.1), considering free-space propaga- tion and strong reflections (up to two-bounces) as dominant propagation mechanisms; diffraction is neglected due to its limited role at mm-wave [31]. The ray-tracing output is used to reconstruct the channel matrix as per (1). 2.2 Multi-Panel Antenna & Beamforming Model For the transmit/receive antennas, we employ the multi- panel antenna model [29], where the gNB/UE is equipped with Nsec = 4 sector antenna panels, each covering one sector/quadrant of the angular space. We assume that the gNB/UE has unified control over all its multi-panel anten- nas, which have a fixed initial orientation. To steer the in- dividual beams, we assume predefined codebooks for each sector antenna panel, Cg sec at the gNB and Cu sec at the UE of size nq bits, which consist of 2nq beams covering the angular steering range of ±45◦, following 3GPP’s specifications in Table. 7.3-1 in [29]. An example of such a sector antenna codebook consisting of 16 beams is shown in Fig. 1. For the beamforming, we assume a fully-connected HBF architecture at the gNB, mapping all RF chain outputs per 4 Digital  Beamformer Analog  Beamformer RF chain RF chain RF chain Multiple UE streams Nt Nu RF chain RF chain Analog  Beamformer Ng RF,sec   Ng RF = Nsec Ng RF,sec  Ng RF,sec   Nt UE 4 l4,1 l3,1 l2,1 UE 3 UE 2 UE 1 ii CBF architecture at the UE with Nsec= 4 sector panels, each consisting of Nr antenna elements, and Nu RF = 1 RF chain. Power amplifiers l1,1 i. Fully-connected HBF archicture at the gNB with Nsec= 4  sector panels,  each consisting of Nt antenna elements and NRF,sec RF chains. sector #1 sector #4 sector #3 sector #3 Low noise amplifiers Antenna weights Variable gain  amplifiers Nr Nr Receiver processing Summing  function sector #4 sector #1 sector #2 UE 6 l6,1 sector #1 UE 5 l5,1 sector #1 gNB sector #1 gNB sector #2 BPL Fig. 2: Illustration of a mm-wave network, with an example scenario of a gNB simultaneously serving Nu = 6 UEs. The gNB is using a fully-connected HBF architecture with Nsec = 4 sector panels each equipped with Nt antenna elements and N g RF,sec = 4 RF chains, i. e. the gNB can simultaneously serve up to N g RF = 16 UEs . For clarity, we only illustrate two out of the four gNB sector panels, with four UEs being served by sector #1 and two UEs served by sector #2. The UEs use a CBF architecture with Nsec = 4 sector panels, each equipped with Nr antenna elements, and N u RF = 1 RF chain. sector panel onto a common analog beamformer, which applies a sum of all phase-shifting outputs to each of the Nt elements of the sector antenna panel, as shown in Fig. 2. Each RF chain controls a part of the overall sector antenna panel, with a total of N g RF,sec RF chains per panel. Thus, the maximum number of UEs that can be served simultaneously at the gNB is constrained by the total number of RF chains , i. e. Nu ≤ N g RF , where N g RF = NsecN g RF,sec. At the UE, we assume a CBF architecture following 5G-NR specifications in [29], such that each UE is equipped with N u RF = 1 RF chain controlling Nsec = 4 sector antenna panels, each consisting of Nr antenna elements, as shown in Fig. 2. 2.3 Initial Access: Initial Serving BPL Selection Steering the antenna beams to the correct orientation for establishing a mm-wave BPL necessitates beam training [3]. A mm-wave BPL li,j is defined by the UE i, the serving gNB j, and the respective steering orientations at the gNB {ϕj li,j, θj li,j} and the UE {ϕi li,j, θi li,j}. We follow the 5G-NR initial access as our beam training procedure [3], and assume downlink control operation based on an exhaustive beam sweep over the codebook entries of Cj at gNB j and Ci at UE i, where Cj = Nsec S sec=1 Cj sec and Ci = Nsec S sec=1 Ci sec denote the complete gNB and UE codebooks consisting of all the entries for each sector antenna codebook. The initial serving BPL li,j for UE i is then selected out of the finite set of feasible BPLs found during initial access over all gNBs, Nl,i = S j∈G |Cj| S n=1 |Ci| S m=1 li,j,n,m as the one which maximizes the synchronization signal block (SSB) reference signal received power (RSRP), and is determined as li,j ← argmax li,j∈Nl,i ∀wp,li,j ∈Cj ∀wc,li,j ∈Ci PSSB \r\r\rwH c,li,jHi,jwp,li,j \r\r\r 2 , ∀j ∈ G (5) where PSSB denotes the SSB transmit power, G denotes the set of gNBs in the network, and wp,li,j and wc,li,j denote the precoding and combining vectors applied to steer the arrays towards the AoD and AoA of the BPL li,j, respectively. 2.4 Channel Estimation The exhaustive beam sweep of the finite gNB/UE code- books determines the steering orientations of the candidate BPLs that best correspond to the real AoD/AoA of the K LOS/NLOS channel propagation paths in (1), within the margins of the codebook steering resolution. To accommo- date for the inaccurate angular information during channel estimation, we use the wide-angle steering codebook which generates variable beamwidth patterns to fit a desired steer- ing resolution for a given antenna array [32], i. e. resulting in quantized channel estimates due to use of codebooks with finite steering resolution. Specifically, for both the gNB and the UE, we may define an azimuth steering codebook Cϕ of size nq bits, which is able to distinguish between 2nq angles over the range of 90◦ for each of the Nsec = 4 antennas. Similarly, we may define an elevation steering codebook Cθ of size nq − 1 bits over the range of 180◦ for each of the Nsec = 4 antennas. The finite channel estimation resolution over the azimuth/elevation steering ranges is thus given as ϕres = 360◦ Nsec · 2nq , θres = 180◦ Nsec · 2nq−1 . (6) The quantized angle estimates of the real AoD for the channel propagation paths in (1) are defined as ˆϕi,k = argmin ϕ∈Ci ϕ \r\rϕ − ϕt k \r\r , ˆθi,k = argmin θ∈Ci θ \r\rθ − θt k \r\r , (7) where the same principle holds equivalently for the AoD/AoA and each channel propagation path k in (1). We note that the use of finite resolution codebooks results in an inability to distinguish individual channel paths with the same quantized angles. In such cases, the channel estimation algorithm reports a single path with quantized parameters, i. e. the individual paths are merged into one known path 5 and their complex gains are combined. Finally, the estimated channel matrix ˆHi for UE i is given as ˆHi =    ˆH1,1 · · · ˆH1,4 ... ... ... ˆH4,1 · · · ˆH4,4   , (8) where e. g. ˆH1,4 ∈ CNr×Nt denotes the estimated channel matrix between the first sector antenna panel of UE i and the fourth sector antenna panel at the serving gNB j. Following 3GPP’s specifications, we distinguish between gNB/UE codebooks used for channel estimation and initial access, as well as reference signals used for each proce- dure [33]. Assuming downlink operation using the same codebook for channel estimation and initial access, the number of reference signals for CSI reporting is limited to 64, in line with 3GPP specifications for the number of SSBs at FR2 [3]. In 5G-NR HBF MU-MIMO terms [33], this corresponds to CSI reporting for Type-II codebooks with no oversampling and a sector antenna codebook size of nq = 4 bits, i. e. 16 beams per each of the four sector antennas and 64 beams in total. Type-II codebooks also support a more detailed CSI-RS-based reporting [34], with an oversampling factor of up to four for both azimuth and elevation, making a codebook size of nq = 6 bits also feasible, i. e. 64 beams per each of the four sector antennas and a total of 256 beams. In Sec. 4.2 we vary the size of the gNB/UE codebooks used for channel estimation, and study the corresponding accuracy of the estimated channel matrix which is then used for designing the digital baseband precoder for multi- UE interference cancellation (cf. Sec. 2.5). We additionally consider as a reference the ideal case, where the channel estimates are acquired using an infinite resolution codebook nq = ∞, such that the channel path angles and complex gains are assumed to be perfectly known, i. e. ˆH = H. 2.5 Multi-User Interference Cancellation The computation of the precoding weights for serving the multiple UEs at the gNB is split into two stages, as per [13]. In the first stage, following the initial exhaustive beam sweep, the codebook entries which maximize the RSRP are selected to steer the arrays at the gNB wp, RF,i, and the UE wc,i, towards the AoD/AoA of the serving BPL li,j (5). In the second stage, we need to compute the effective channel for each UE i based on the estimated channel ˆHi (8). For this, we use the precoding wp, RF,i and combining wc,i vectors from the first stage, as ˆHeff,i = wH c,i ˆHiWp,RF, (9) where Wp,RF ← \u0002wp,RF,1 · · · wp,RF,Nu \u0003 denotes the aggregate RF precoding matrix for the Nu UEs served by the gNB. Each UE feeds this channel information back to the gNB, with the effective channel vector reflecting a drastically reduced dimensionality, i. e. Nu ≪ NsecNt. We note that the accuracy of the effective channel depends on the esti- mated channel matrix ˆHi, which is dictated by the gNB/UE codebooks used for channel estimation (cf. Sec. 2.4). The gNB then designs the digital baseband precoder based on the UE channel feedback using zero-forcing for multi-UE interference cancellation as Wp,BB = ¯H \u0000 ¯HH ¯H \u0001−1 , (10) where ¯H = h ˆHH eff,1 · · · ˆHH eff,Nu i represents the aggregated effective channels for the Nu UEs. The resulting baseband precoding vectors for each UE i are then normalized to fulfill the power constraint, wp,BB,i = wp,BB,i ∥Wp,RFwp,BB,i∥F , where ∥ ∥F denotes the Frobenius norm. Finally, the individual precoding vector wp,i for UE i in (4) is generated by multiplying the RF and baseband precoding, wp,i = Wp,RFwp,BB,i, (11) with Wp,RF ∈ CNsecNt×Nu and wp,BB,i ∈ CNu×Nu. Effectively, the gNB precoder in the case of HBF maps the Nu UE streams to the N g RF RF chains, thus significantly reducing the complexity compared to DBF. 2.6 Performance Evaluation Metrics The signal-to-interference-plus-noise-ratio (SINR) for UE i served by gNB j via the serving BPL li,j is given as SINRi = RSSi Iintra,i + Iinter,i + N , (12) where N denotes the noise power, consisting of thermal noise over the system bandwidth plus a noise figure, and the received signal strength (RSS) is given by RSSi = Pi∥wH c,iHi,jwp,i∥2, (13) where Pi denotes the gNB transmit power allocated to UE i with the total transmit power Pmax equally shared among all allocated UEs at the gNB, and the precoding wp,i and combining wc,i vectors determined as in Sec. 2.5. We define the intra-cell interference Iintra,i and inter-cell interference Iinter,i for UE i served by gNB j as Iintra,i = PU∥wH c,iHi,jWj p∥2, (14) Iinter,i = PU∥wc,i X g̸=j Hi,gWg p∥2, (15) where PU denotes the gNB transmit power allocated to each UE and Wj p = \u0002wp,1, · · · , wp,Nu \u0003 denotes the precoding matrix for the Nu UEs served by the gNB. Lastly, to map the SINRi to the achievable throughput Ri, we adopt the wideband 5G-NR model [5] using an attenuated, truncated Shannon bound as Ri =    0 SINRi < SINRmin, Rmax SINRi ≥ SINRmax, αB log2(1 + SINRi) otherwise, (16) where α = 0.75 represents the implementation losses, B = 400 MHz denotes the bandwidth, SINRmin = −5 dB denotes the coverage threshold and SINRmax = 20.05 dB is the SINR required to get the maximum achievable throughput of Rmax = 2 Gbps. 3 MULTI-USER BPL ALLOCATION IN HBF MU-MIMO MM-WAVE NETWORKS 3.1 BPL Allocation Problem Assuming that a UE is only served by a single gNB via one BPL, we formulate the multi-UE BPL allocation that maximizes the network sum throughput as L = argmax L⊂Nl X i∈U Ri, (17) 6 s.t. SINRi ≥ SINRmin, ∀i ∈ L (18a) |Lj| ≤ N j RF , ∀j ∈ G (18b) X i∈Lj Pi ≤ Pmax, ∀j ∈ G (18c) where L denotes the set of allocated BPLs and Nl = NUE S i=1 Nl,i denotes the set of candidate BPLs for all UEs. The constraint in (18a) denotes the coverage threshold for BPL allocation. The constraint in (18b) denotes the maxi- mum number of UEs that can be served simultaneously on each gNB. The constraint in (18c) denotes the gNB transmit power allocation, with the total power equally split among the served UEs. We note that the combinatorial allocation problem (17) can be solved by exhaustive search, but this is computationally infeasible for all but very small networks. 3.2 IABA: Interference-Aware BPL Allocation We propose IABA, an interference-aware BPL allocation scheme which aims to mitigate spatial interference in HBF MU-MIMO mm-wave networks and maximize the net- work sum throughput (17). IABA is fully 5G-NR-compliant, and relies on monitoring candidate BPLs via a centralized CSI-RS allocation, i. e. cIABA, or a distributed, per-gNB CSI-RS allocation, i. e. dIABA. The detailed step-by-step operation of IABA is as follows (cf. Alg. 1). In the first step, the set of candidate BPLs Nl,i for each UE i is established following the exhaustive beam sweep of the gNB/UE codebooks during initial access. The UE is initially associated to the gNB which provides the strongest BPL as per (5). In the second step, the network sets up the monitoring of candidate BPLs by allocating dedicated CSI-RS resources. Each UE can monitor up to NCSI−RS BPLs, either solely on the serving gNB using dIABA or over the complete network using cIABA. In the third step, the multi-UE BPL allocation is executed by selecting among the NCSI−RS monitored BPLs using CSI-RS measurement reporting. The precoding/combining weights are computed for each new candidate BPL using (9)–(11), taking into account all previously allocated BPLs on the serving gNB. Following this, the network updates the SINR of the co- allocated BPLs, i. e. solely on the serving gNB for dIABA or across all gNBs for cIABA. The decision on whether the candidate BPL is allocated is then made in an interference- aware manner, as follows. If none of the previously allocated BPLs are degraded below the coverage threshold (18a), and the gNB has enough physical resources to serve all allocated UEs (18b), the candidate BPL is provisionally allocated to CSINRi. Otherwise, the candidate BPL is discarded. Once the NCSI−RS candidate BPLs for the UE have been checked, the candidate BPL in CSINRi providing the highest SINR is allocated to the final BPL allocation set L. If none of the candidate BPLs are eligible for allocation, the UE is dropped. In Sec. 4.2, we evaluate the proposed IABA against the default interference-agnostic 5G-NR baseline, where each UE is allocated its strongest BPL as found during initial access (Step 1 of Alg. 1), such that new allocations can lead to previously allocated BPLs being dropped from the network due to excessive interference. Algorithm 1 Interference-Aware BPL Allocation (IABA) Initialize: U, G, L, Cg, Cu, N g RF , N u RF , NCSI−RS. 1: Step 1. Initial user association 2: for each UE i in U do 3: Nl,i = S j∈G |Cj| S n=1 |Ci| S m=1 li,j,n,m, set of all candidate BPLs. 4: li,c ← argmax li,c∈Nl,i RSSi, initial serving BPL on gNB c (5). 5: Step 2. CSI-RS candidate BPL monitoring 6: for each UE i in U do 7: if (distributed IABA) then 8: Cl,i ← sort RSS (Nl,i,c), sorted set of candidate BPLs on the initial serving gNB c. 9: |Cl,i| = NCSI−RS, limit number of monitored BPLs. 10: else (centralized IABA) 11: Cl,i ← sort RSS (Nl,i), sorted set of all candidate BPLs. 12: |Cl,i| = NCSI−RS, limit number of monitored BPLs. 13: Step 3. Multi-UE BPL allocation 14: for each UE i in U do 15: CSINRi = {}, provisional BPL allocation set for UE i. 16: for each li,j in Cl,i do 17: Compute precoding/combining weights (9)–(11): 18: {wp,k} |Lj|+1 k=1 , {wc,k} |Lj|+1 k=1 , ∀k ∈ {L, li,j}. 19: Update metrics of allocated BPLs (12): 20: if (distributed IABA) then 21: SINRk, ∀k ∈ {Lj, li,j}. 22: else (centralized IABA) 23: SINRk, ∀k ∈ {L, li,j}. 24: Provisional BPL allocation: 25: if (SINRk ≥ SINRmin & |Lj| ≤ N j RF ), ∀k ∈ L then 26: CSINRi = {CSINRi, li,j}. 27: else 28: continue 29: if empty(CSINRi) then 30: drop UE i from network. 31: else 32: li,j ← argmax li,j∈CSINRi SINRi, L ← li,j. Output: L, final BPL allocation set. Complexity Analysis: Considering closely the multi-UE BPL allocation in Step 3 in Alg. 1, line 21/23 have the highest cost due to the computation of the updated SINR for all co-allocated BPLs. This involves the multiplication of the updated combining, channel, and precoding matrices as per (12), which is of complexity order O(N 2 t ) [11]. We note that the selection of the serving BPL for each UE i is then done in line 32 in Alg. 1 by finding the maximum SINR BPL in the provisional allocation set CSINRi, which requires |CSINRi|log(|CSINRi|) computations. dIABA runs independently on each gNB, having |Cl,i|NUE/NgNB iterations on average, where NUE = |U| and NgNB = |G|. In each iteration, the candidate BPLs for each associated UE are checked, in total |Cl,i| ≤ K, where K denotes the number of channel propagation paths between UE i and its serving gNB j in (1). We note that the exact number of candidate BPLs between a UE and its serving BS depends on their relative positions, site-specific channel and codebook considerations. The computational complexity of dIABA is thus given as O \u0010 K N 2 UE NgNB N 2 t \u0011 . cIABA runs a single loop with NUE iterations, con- sidering potentially all candidate BPLs over the complete 7 network, which constitutes |Cl,i|NgNB ≤ KNgNB repeti- tions of SINR calculations. The computational complexity of cIABA is thus given as O \u0000KNgNBN 2 UEN 2 t \u0001 . This shows that with network densification, the com- putational complexity of the centralized allocation cIABA scales with O(N 2 UENgNB), whereas for dIABA it scales with O(N 2 UE/NgNB). For the default 5G-NR BPL allocation, the calculation for each UE involves NUE/NgNB calculations on the serving gNB, as we need to calculate the SINR for all allocated BPLs including the new one, but only for the per-UE best RSS BPL found during initial access; this is done for every gNB so in total NgNB iterations. Thus, the computational complexity of default 5G-NR is given as O \u0010 N 2 UE NgNB N 2 t \u0011 . 3.3 5G-NR-Compliant IABA Operation The proposed IABA is fully compliant with the 5G-NR standard, and relies solely on standardized reference signals for dedicated channel measurements (CM) and interference measurements (IM) [35]. The detailed step-by-step 5G-NR standard-compliant operation of IABA is illustrated in Fig. 3. For initial access, we follow the downlink control oper- ation where the gNBs transmit SSB reference signals, such that each SSB corresponds to a different beam index (ID) in the gNB codebook (cf. Step 1 in Fig. 3). Following 3GPP’s specifications, the SSBs are allocated in the first 5 ms of an SS burst, which is transmitted with a periodicity of TSS = 20 ms. We note that 3GPP limits the maximum number of SSBs NSSB up to 64 for FR2 [3]. During the transmission of an SS burst, the UE keeps its beam fixed, and continues to sweep all of its beams over consecutive SS bursts, as illustrated in Fig. 3. A complete beam sweep of the gNB/UE codebooks thus takes MTSS, where M = |Cu| de- notes the number of beam entries in the UE codebook. The UE sends back a measurement report of the beam sweep, including the SSB-RSRP, SSB-ID and UE beam ID of the best NCSI−RS candidate BPLs, as shown in Fig. 3. The UE is consequently initially associated to the gNB which provides the strongest BPL in terms of SSB-RSRP (cf. Sec. 2.3). Following the initial access, the network sets up the monitoring of candidate BPLs (cf. Step. 2 in Fig. 3). For this, IABA uses dedicated non-zero power (NZP) CSI-RS re- sources to monitor the best NCSI−RS candidate BPLs found during initial access for each UE, with NCSI−RS ≤ 4 for FR2 [3]. After selecting the per-UE NCSI−RS BPLs for active monitoring, the network schedules the NZP CSI-RS CM/IM resources following the 5G-NR standardized methodol- ogy [36]. During the multi-UE BPL allocation, the network utilizes NZP CSI-RS CM resources for measuring the pre- coded RSRP/SINR, i. e. using the same precoding as for potential data transmission on the candidate BPL. Dedicated NZP CSI-RS IM resources are used to estimate the interfer- ence from other concurrent transmissions via interference- aware CSI-RS scheduling. NZP CSI-RSs can be transmitted in any orthogonal frequency-division multiplex (OFDM) symbols as configured by the radio resource control, and take fewer radio resources, e. g. one OFDM symbol, and are transmitted with lower periodicity compared to SSBs [3]. Step. 3 in Fig. 3 shows an example MU-MIMO scenario with three UEs, where one UE receives its NZP CSI-RS for CM Time Frequency Step 1. gNB/UE beam codebook sweep for initial beam pair link (BPL) selection  UE reports back  SSB-ID/RSRP of  best NCSI-RS BPLs  Step 2. NZP CSI-RS for monitoring of the best NCSI-RS candidate BPLs Step 3. NZP CSI-RS scheduling for MU-MIMO channel/interference measurements NZP CSI-RS IM Other (e. g. DATA, DM-RS) NZP CSI-RS CM UE 1 UE 3 UE 2 BPL #1 BPL #NCSI-RS BPL #1 BPL #NCSI-RS BPL #1 BPL #NCSI-RS SSB #1 SSB #2 SSB #NSSB UE Beam #1 SSB-RSRP UE Beam #2 SSB #1 SSB #2 SSB #NSSB UE Beam #M TSS TSS SSB #1 SSB #2 SSB #NSSB TSS BPL #1:      SSB ID: #1   RSPR: -44 dBm    UE Beam: #2 BPL #NCSI-RS:      SSB ID: #2   RSPR: -57 dBm    UE Beam: #M Time Frequency BPL #1 CSI-RS #1 CSI-RS #NCSI-RS BPL #NCSI-RS Time Frequency Fig. 3: 5G-NR-compliant operation for IABA: (i) SSB-based initial beam sweep for BPL selection, (ii) scheduling of NZP CSI-RS for BPL monitoring, (iii) NZP CSI-RS scheduling for MU-MIMO channel/interference measurements. while the other two conduct IM at the same time. IABA uses the dedicated NZP CSI-RS CM/IM to compute the precoding/combining before each BPL allocation (Step 3 of Alg. 1). At the UE, this corresponds to the beam entry used to steer the array towards the candidate BPL. At the gNB, this is reflected as using a different precoding matrix index for Type II codebooks, which provide multi-beam support suitable for interference cancellation in HBF MU-MIMO configurations with up to four spatial layers, as defined in Sec. 5.2.2.2.1–5 in TS 38.214 [33] and detailed in Sec. 2.4–2.5. 4 PERFORMANCE EVALUATION 4.1 Simulation Model We consider a realistic urban area in Seoul, with the mm-wave network consisting of gNBs and UEs deployed within a central 500 m × 500 m network area, as shown in Fig. 4. The gNB deployment follows a regular distri- bution on a uniform grid, where the gNB locations are mapped to the closest building corner near the actual grid position. We consider gNB deployment densities of λgNB = {64, 196} gNBs/km2. The sparse deployments are a representative of early mm-wave networks deployed as a hot-spot capacity extension, whereas the dense deploy- ments correspond to future mm-wave networks. The UEs are randomly deployed following a Poisson point process (PPP) with a density of λUE = 1000 UEs/km2. We assume an operating carrier frequency of fc = 28 GHz and a system bandwidth of B = 400 MHz, 8 Fig. 4: Illustration of the urban site in Seoul, showing the building layout and an example gNB (•) and UE (×) deployment over the network study area (green box); λgNB = 64 gNBs/km2 and λUE = 1000 UEs/km2. Parameter Value Network area size 500 m × 500 m gNB distribution uniform grid gNB density λgNB {64, 196} gNBs/km2 gNB height 6 m UE distribution PPP UE density λUE 1000 UEs/km2 UE height 1.5 m # sector antenna panels Nsec 4 # RF chains per gNB sector N g RF,sec 4 # RF chains per gNB N g RF 16 # RF chains per UE N u RF 1 gNB sector antenna size Nt {256, 1024} elements UE sector antenna size Nr 16 elements # bits for steering codebook nq {2, 4, 6, 8, 10, ∞} # SSBs NSSB 64 # monitored CSI-RS NCSI−RS {2, 4, ∞} Carrier frequency fc 28 GHz System bandwidth B 400 MHz Max. gNB transmit power Pmax 30 dBm Noise power N −78 dBm Coverage threshold SINRmin −5 dB Max. achievable throughput Rmax 2 Gbps TABLE 2: Studied cellular network parameters. corresponding to 5G-NR FR2 network deployments [2]. We consider saturated downlink traffic, and assume a maximum gNB transmit power of Pmax = 30 dBm and a noise power of N = −78 dBm, consisting of thermal noise over the system bandwidth plus a noise figure of 10 dB. We model the gNB antenna as per 3GPP’s specifications with a size of up to Nt = 1024 elements and N g RF = 4 RF chains per sector panel [29], deployed at a height of 6 m. Each gNB is thus equipped with a total of N g RF = NsecN g RF,sec = 16 RF chains. We assume a CBF architecture at the UE and a multi-sector antenna with Nr = 16 elements per sector panel, deployed at a height of 1.5 m. The UEs are equipped with N u RF = 1 RF chain, as per 5G-NR specifications [29]. Throughout, the results represent Monte Carlo simulations with 20 network realizations of random UE deployments. Table 2 summarizes the studied cellular network parameters. 4.2 Results In the following, we present the results of our extensive study of mm-wave HBF MU-MIMO performance and the evaluation of IABA under practical network constraints. In Sec. 4.2.1, we study the baseline performance of IABA and compare it against default 5G-NR1 for the ideal case of nq = ∞ and NCSI−RS = ∞. In Sec. 4.2.2 we study the effect of candidate BPL monitoring in IABA, and show that IABA significantly outperforms default 5G-NR under realis- tic CSI-RS signaling, i. e. NCSI−RS ≤ 4. In Sec. 4.2.3 we an- alyze the effect of quantized CSI feedback, i. e. nq < ∞, on the HBF MU-MIMO performance, showing the benefits of IABA and performance gains over the default interference- agnostic 5G-NR. Finally, in Sec. 4.2.4 we study the practical performance trade-offs in terms of CSI-RS BPL monitoring NCSI−RS and quantized CSI feedback nq, and show that IABA allows HBF MU-MIMO to even outperform the DBF MU-MIMO baseline, with further benefits of increased gNB antennas and densification in beyond-5G networks. 4.2.1 Beyond 5G-NR Baseline Performance Let us being by studying the performance of IABA, and compare it against the interference-agnostic, de- fault 5G-NR BPL allocation (referred to as 5G-NR) for our baseline network deployment of λgNB = 64 BSs/km2, λUE = 1000 UEs/km2, and Nt = 256/Nr = 16 elements. We additionally assume ideal channel estimation and CSI-RS BPL monitoring, i. e. nq = ∞ and NCSI−RS = ∞. Fig. 5 presents the resulting SINR, interference-to-noise- ratio (INR) and signal-to-noise-ratio (SNR) distributions and Fig. 6 illustrates the network BPL allocation, i.e. index/type of allocated BPLs, for the different BPL allocation schemes. Fig. 5a shows that the proposed IABA significantly improves both the coverage and achieved SINR over the 5G-NR baseline. The centralized approach cIABA improves the coverage by 20 percentage points (pp), and the median SINR by 10 dB over 5G-NR. The distributed approach dIABA also outperforms 5G-NR by 4 pp in terms of coverage and over 4 dB in the median SINR. Interestingly, while Fig. 5b confirms that zero-forcing in HBF MU-MIMO fully cancels the intra-cell interference, there is a significant portion of al- located UEs that are still affected by strong residual inter-cell interference, i. e. 60% of the UEs for cIABA and over 45% for dIABA/5G-NR experience inter-cell interference above the noise floor (INR > 0). We emphasize that this result is in contrast to assumptions made in prior mm-wave studies, which typically assume limited to no-interference due to simplified antenna/channel models, e.g. [17]–[19], [24], [25]. Let us further analyze the nature of the residual spatial interference in HBF MU-MIMO mm-wave networks to gain insight into how IABA achieves its performance gains over 1. In [26], we show that IABA outperforms WCS, as a literature benchmark [25] for spatial BPL allocation in CBF mm-wave SDMA networks. We expect the same performance trends to hold, and do not include an explicit comparison against WCS for HBF MU-MIMO in this work. We note that, as far as we are aware of, there are no other mm-wave networking studies on HBF MU-MIMO (cf. Table. 1) that consider multi-UE interference cancellation and spatial BPL allocation jointly. We therefore select HBF MU-MIMO with default 5G-NR UE association to the strongest gNB and BPL found during initial access (cf. Sec. 2.3) as our main performance evaluation benchmark. 9 −5 5 15 25 35 45 55 65 0 0.2 0.4 0.6 0.8 1 SINR (dB) CCDF 5G-NR dIABA cIABA (a) SINR −300 −240 −180 −120 −60 0 60 0 0.2 0.4 0.6 0.8 1 INR (dB) CCDF 5G-NR dIABA cIABA Iinter Iintra (b) INR −5 5 15 25 35 45 55 65 0 0.2 0.4 0.6 0.8 1 SNR (dB) CCDF 5G-NR dIABA cIABA (c) SNR Fig. 5: SINR, INR and SNR distribution for the different BPL allocation approaches, assuming nq = ∞, NCSI−RS = ∞, i. e. ideal channel estimation and CSI-RS BPL monitoring, and our baseline network of λgNB = 64 BSs/km2, λUE = 1000 UEs/km2, Nt = 256/Nr = 16 elements. 5G-NR dIABA cIABA 0 0.2 0.4 0.6 0.8 1 CCDF # 1 # 2 # 3 # 4 Other (a) Allocated BPL index 5G-NR dIABA cIABA 0 0.2 0.4 0.6 0.8 1 CCDF LOS NLOS DROP HO (b) Allocated BPL type Fig. 6: Index and type of the allocated BPLs, assuming nq = ∞, NCSI−RS = ∞, λgNB = 64 BSs/km2, λUE = 1000 UEs/km2, and Nt = 256/Nr = 16 elements. the 5G-NR baseline in Fig. 5a. Zero-forcing cancels intra- cell interference by projecting the UE’s channel vector on a precoding vector that is orthogonal to other UEs’ channel vectors (10). The penalty for this depends on the mutual channel correlation, and is reflected as a loss in the RSS if the channels are highly correlated, known as the zero-forcing penalty [12]. The mm-wave channel is sparse, and the effective UE channel depends on the choice of the beam codebook entries which maximize the RSS of the candidate BPLs found during initial access. In practice, the chosen beams amplify certain channel paths and attenuate others, so that the allocated BPLs in the 5G-NR baseline typically share common strong paths, e. g. for nearby co-located UEs, which results in high channel correlation. In such cases, the zero-forcing penalty incurs significant losses in order to fully cancel intra-cell interference, due to its inability to compensate for the low angular separation of the allocated BPLs. Namely, always selecting the best RSS BPLs at initial access for serving all UEs as in 5G-NR results in a high zero-forcing penalty and thus poor SNR after zero-forcing precoding, as shown in Fig. 5c. By contrast, the proposed IABA is able to significantly improve the SNR in Fig. 5c by effectively increasing the angular separation of the allocated BPLs after zero-forcing via selection of the nth-strongest BPLs at initial access, as shown in Fig. 6a. By allocating secondary BPLs to increase the angular BPL separation, i. e. n > 1, IABA reduces the zero-forcing penalty and mit- igates strong interference that would otherwise result by only allocating the best RSS BPL, i. e. n = 1. For example, 20% of the UEs for dIABA and 57% for cIABA are allocated BPLs other than the best RSS BPL, as shown in Fig. 6a. Moreover, Fig. 6b shows that 45% of the UEs are allocated NLOS BPLs for cIABA, compared to 27% for dIABA and only 19% for 5G-NR. cIABA further improves the overall network performance by allowing handovers for 21% of the UEs in Fig. 6b, thus having the benefit of load-balancing and outperforming the other BPL allocation approaches. In summary, the results in Figs. 5-6 demonstrate the significant benefit of interference-aware BPL allocation to manage the residual spatial interference in HBF MU-MIMO mm-wave networks that cannot be mitigated by zero- forcing alone even under ideal channel estimation (nq = ∞). 4.2.2 CSI-RS BPL Monitoring for IABA Let us next focus on how IABA achieves network-wide performance gains in practice for our baseline network deployment. Fig. 7 shows the SINR distribution and the allocated BPL index/type for varying NCSI−RS = {2, 4, ∞} under ideal channel estimation (nq = ∞). Fig. 7a shows that constraining NCSI−RS has only a limited impact on the achieved SINR for dIABA. This is because the ideal allocation (NCSI−RS = ∞) of the per-UE BPLs for dIABA picks at most the second best BPL for 88% of UEs, and 98% up to the fourth best BPL, as shown in Fig. 7b. Limiting NCSI−RS to four thus results in no significant impact of the achievable network performance for dIABA in Fig. 7a. In contrast, Fig. 7b shows that cIABA allocates the fifth or higher BPL index for 19% of the UEs for NCSI−RS = ∞. Im- portantly, only 45% of the UEs are allocated the best RSS BPL for NCSI−RS = ∞, compared to 50% for NCSI−RS = 4 and 68% for NCSI−RS = 2. Thus, limiting NCSI−RS for cIABA has a more significant impact in terms of SINR degradation in Fig. 7a than for dIABA. Reducing NCSI−RS also limits the use of secondary NLOS BPLs for interference mitigation in cIABA, and increases the primary use of LOS BPLs, e. g. from 37% for NCSI−RS = ∞ up to 46% for NCSI−RS = 2 in Fig. 7c. In addition, the load-balancing rate via han- dovers drops from 21% down to 5% for NCSI−RS = 2 in Fig. 7c. Consequently, Fig. 7a shows that cIABA with NCSI−RS = 2 achieves 15 pp lower coverage than cIABA with NCSI−RS = ∞, with its overall SINR performance being comparable to dIABA with NCSI−RS = ∞. Our results in Fig. 7 thus highlight that CSI-RS BPL monitoring improves both coverage and achievable SINR, 10 −5 5 15 25 35 45 55 65 0 0.2 0.4 0.6 0.8 1 SINR (dB) CCDF 5G-NR NCSI−RS = 2 dIABA NCSI−RS = 4 cIABA NCSI−RS = ∞ (a) SINR 2 4 ∞ 2 4 ∞ 2 4 ∞ 0 0.2 0.4 0.6 0.8 1 5G-NR dIABA cIABA NCSI−RS CCDF # 1 # 2 # 3 # 4 Other (b) Allocated BPL index 2 4 ∞ 2 4 ∞ 2 4 ∞ 0 0.2 0.4 0.6 0.8 1 5G-NR dIABA cIABA NCSI−RS CCDF LOS NLOS DROP HO (c) Allocated BPL type Fig. 7: SINR distribution and allocated BPL index/type for varying NCSI−RS, assuming ideal channel estimation nq = ∞, λgNB = 64 BSs/km2, λUE = 1000 UEs/km2, and Nt = 256/Nr = 16 elements. −5 5 15 25 35 45 55 65 0 0.2 0.4 0.6 0.8 1 SINR (dB) CCDF 5G-NR nq = 4 dIABA nq = 6 cIABA nq = ∞ (a) SINR −300 −240 −180 −120 −60 0 60 0 0.2 0.4 0.6 0.8 1 IintraNR (dB) CCDF 5G-NR nq = 4 dIABA nq = 6 cIABA nq = ∞ (b) IintraNR −60 −30 0 30 60 0 0.2 0.4 0.6 0.8 1 IinterNR (dB) CCDF 5G-NR nq = 4 dIABA nq = 6 cIABA nq = ∞ (c) IinterNR Fig. 8: SINR and INR distribution using quantized channel feedback from varying codebook sizes nq = {4, 6, ∞}, assuming NCSI−RS = 4, λgNB = 64 BSs/km2, λUE = 1000 UEs/km2, and Nt = 256/Nr = 16 elements. and is particularly important for cIABA. Limiting the num- ber of monitored candidate BPLs inherently limits the load- balancing opportunities for cIABA, considering that the best candidate BPLs found during initial access are provided by the initial serving gNB. Nonetheless, cIABA monitoring up to the NCSI−RS = 4 best candidate BPLs – in line with 3GPP’s specifications for FR2 [3] – is able to reap the benefits of IABA’s CSI-RS BPL monitoring and significantly outper- form 5G-NR in Fig. 7a, by allocating secondary BPLs to over 50% of the UEs (cf. Fig. 7b). This result demonstrates the practical feasibility of IABA for network-wide, interference- aware BPL allocation in HBF MU-MIMO networks. 4.2.3 CSI Reporting & Channel Feedback Quantization Next, we analyze the performance of IABA assuming quan- tized channel feedback for our baseline HBF MU-MIMO network deployment. We set NCSI−RS = 4 as per Sec. 4.2.2, and vary the size of the codebooks used for channel estima- tion, nq = {4, 6, ∞}, as discussed in detail in Sec. 2.4. Fig. 8 shows the resulting SINR and INR distributions using quantized channel feedback from varying codebook sizes. Fig. 8a shows that finite codebooks can achieve good coverage, but lead to significant performance degradation, i. e. over 10 dB loss in the median SINR for the smallest nq = 4 codebook compared to the ideal nq = ∞ codebook. Fig. 8a shows that a codebook of size nq = 6 bits still suffers from significant SINR loss compared to the ideal nq = ∞ codebook, due to the inability to perform ideal zero-forcing given the quantized channel estimates. We emphasize that this is despite the fact that a codebook of size nq = {4, 6} 4 6 ∞ 0 10 20 HPBW nq ∆ϕ (◦) (a) Angular misalignment ∆ϕ 4 6 ∞ 0 3 6 10 20 nq ∆G (dB) (b) Gain loss ∆G Fig. 9: Distribution of angular misalignment between the steering orientation of the codebook main lobe and the ideal BPL orientation ∆ϕ, and the incurred gain loss due to misalignment ∆G, assuming codebook sizes of nq = {4, 6, ∞} for our baseline network deployment. bits does not incur significant angular misalignment be- tween the steering orientation of the main lobe for the used codebook entry and the ideal BPL orientation corresponding to the true channel propagation path, i. e. the misalignment is within the half-power beamwidth (HPBW) in Fig. 9a. In particular, Fig. 9b shows that a codebook of size nq = 6 bits already performs very close to the ideal in terms of incurred gain loss due to misalignment. Instead the detrimental effect of the quantized codebook comes from poor intra-cell inter- ference suppression due to inaccurate channel estimates. Fig. 8b confirms that, unlike the ideal case of nq = ∞, the HBF MU-MIMO network is unable to fully cancel the intra- cell interference using a finite resolution codebook, and there is strong residual intra-cell interference affecting over 11 −5 5 15 25 35 45 55 65 0 0.2 0.4 0.6 0.8 1 SINR (dB) CCDF (a) SINR (nq = ∞, NCSI−RS = ∞) −5 5 15 25 35 45 55 65 0 0.2 0.4 0.6 0.8 1 SINR (dB) CCDF (b) SINR (nq = 6, NCSI−RS = 4) 0 0.5 1 1.5 2 0 0.2 0.4 0.6 0.8 1 R (Gbps) CCDF (c) Throughput (nq = 6, NCSI−RS = 4) Fig. 10: SINR and throughput distribution for different beyond-5G network configurations and practical channel estimation and CSI-RS reporting (λgNB = 64 BSs/km2, λUE = 1000 UEs/km2, and Nt = 256/Nr = 16 elements). 60% of UEs for nq = {4, 6}, regardless of the BPL allocation approach. On the other hand, Fig. 8c shows that the extent of inter-cell interference is not strongly affected as long as the codebook steering resolution covers the HPBW, as is the case for both codebooks of nq = {4, 6}. Fig. 8b thus high- lights that practical limitations on the channel estimation codebook size and resulting accuracy of channel estimates strongly limit the extent to which spatial interference in HBF MU-MIMO networks can be mitigated by interference can- cellation techniques such as zero-forcing. This emphasizes the even greater importance in practical networks of addi- tional interference mitigation via spatial separation of BPL allocation for beyond-5G deployments. Fig. 8 shows these benefits of interference-aware BPL allocation for practical deployments: IABA significantly improves coverage and SINR over 5G-NR under quantized CSI feedback nq = {4, 6} and realistic CSI-RS BPL monitoring NCSI−RS = 4. 4.2.4 Towards Practical Interference-aware BPL Allocation for Beyond-5G Finally, let us analyze the practical performance trade-offs in terms of channel estimation, CSI availability, and BPL mon- itoring, towards the feasibility of interference-aware BPL allocation as the proposed IABA for beyond-5G mm-wave networks. We consider codebook sizes of nq = {4, 6} bits as per Sec. 4.2.3, and set the number of monitored CSI-RS BPLs NCSI−RS = 4 as per Sec. 4.2.2. We then compare HBF MU-MIMO with different BPL allocation approaches against two reference mm-wave candidate architectures, both with default 5G-NR BPL allocation: (i) DBF MU-MIMO: UEs are served via SDMA using DBF and zero-forcing for multi-UE interference cancellation, following the same system model considerations as for HBF MU-MIMO in Sec. 2.2–2.4, (ii) CBF SU-MIMO: UEs are served via TDMA using CBF, corresponding to current 5G-NR FR2 networks. We start with the reference network performance under ideal conditions (nq = ∞, NCSI−RS = ∞) for our baseline network with λBS = 64 BSs/km2, λUE = 1000 UEs/km2, and Nt = 256/Nr = 16 elements. Fig. 10a presents the SINR distribution, confirming that DBF MU-MIMO performs the best, whereas CBF SU-MIMO is able to provide high SINR at the cost of reduced coverage. Fig. 10a also shows that HBF MU-MIMO with default 5G-NR BPL allocation performs the worst, with the proposed IABA enabling HBF MU-MIMO to close the gap to the DBF MU-MIMO baseline. In particular, Fig. 10a shows that HBF MU-MIMO with cIABA performs within 3.5 dB of the DBF MU-MIMO baseline for the median SINR, and significantly outperforms the default 5G-NR HBF MU-MIMO, e. g. 8.5 dB gain for the median SINR case. Let us now move to the more practical network deploy- ments, with Fig. 10b showing the SINR distribution for the case of nq = 6 bits and NCSI−RS = 4. Comparing Figs. 10a and 10b confirms that both HBF and DBF MU-MIMO suffer from significant performance degradation due to imperfect interference cancellation using quantized channel estimates, whereas CBF SU-MIMO performance is robust since the misalignment loss of the steering codebook is negligible (cf. Fig. 9). Importantly, Fig. 10b shows that HBF MU-MIMO benefits strongly from the proposed IABA, and is able to outperform DBF over the complete SINR range. This is also because DBF is particularly affected under quantized CSI feedback, since the accuracy of the estimated channel matrix is significantly degraded due to the higher dimensionality requirements, degrading the multi-UE interference cancel- lation performance. Namely, HBF MU-MIMO is affected by a quantized codebook to a lesser extent than DBF, due its lower requirements on the effective UE channel estimates. To better understand the network performance, Fig. 10c maps using (16) the SINR in Fig. 10b to the achievable per-UE throughput for the different configurations. Fig. 10c shows that HBF MU-MIMO with cIABA outperforms all other configurations, and achieves a median throughput of 1.35 Gbps, which is 35% higher than that of the DBF MU-MIMO baseline. Fig. 10c also shows that current 5G-NR deployments relying on CBF SU-MIMO are only able to achieve limited per-UE throughput when a large number of UEs are served on each gNB, due to the time resource sharing of TDMA. Furthermore, Fig. 10c shows that HBF MU-MIMO utilizing dIABA achieves better performance for over half of the UEs compared to the DBF MU-MIMO baseline, though at a cost of somewhat reduced coverage; this makes the less computationally demanding dIABA par- ticularly suitable for dense mm-wave SDMA deployments. Our results in Fig. 10 thus highlight that the move towards fully-scaled SDMA necessitates interference-aware BPL allocation in order to unlock the full potential of mm-wave for beyond-5G networks. With the envisioned antenna size increase and network densification, we lastly look at the scalability of IABA in practical mm-wave HBF MU-MIMO networks. In Fig. 11 we consider the case when UEs are equipped Nr = 16 elements per sector antenna, and 12 0 0.5 1 1.5 2 0 0.2 0.4 0.6 0.8 1 R (Gbps) CCDF Nt = 256 Nt = 1024 elements (a) Varying Nt (λgNB = 64 gNBs/km2). 0 0.5 1 1.5 2 0 0.2 0.4 0.6 0.8 1 R (Gbps) CCDF λgNB = 64 λgNB = 196 gNBs/km2 (b) Varying λgNB (Nt = 256 elements). Fig. 11: Throughput distribution for the different BPL allocation approaches, assuming HBF MU-MIMO with varying gNB antenna Nt and deployment density λgNB (λUE = 1000 BS/km2, Nr = 16 elements). present the throughput distribution for a larger gNB sector antenna of Nt = 1024 elements and a higher gNB density of λgNB = 196 gNBs/km2, alongside our baseline network deployment of Nt = 256/λgNB = 64 as shown in Fig. 10c. Fig. 11a highlights a strong benefit from increased gNB sector antenna for all BPL allocation approaches. The pro- posed IABA yields significant performance gains when moving from a 256- to 1024-element sector antenna: a two- fold increase in the median throughput for dIABA from 950 Mbps to 1.88 Gbps, and a similar increase for cIABA from 1.3 Gbps to 2 Gbps, as show in Fig. 11a. The increased gNB antenna directionality makes more candidate BPLs feasible for allocation, thus increasing the gNB’s ability to spatially distinguish nearby UEs and thus increase the co-scheduled UE BPL separation. For example, more than half of the UEs get the maximum achievable throughput of 2 Gbps with HBF MU-MIMO using cIABA, amounting to a 10 pp increase over the interference-agnostic 5G-NR baseline. Fig. 11a thus shows that large antenna arrays in fact benefit more from interference-aware BPL allocation, fur- ther highlighting the limiting factor of spatial interference in realistic mm-wave SDMA deployments. Fig. 11b presents the effect of network densification as another crucial aspect towards improving the wide-area mm-wave coverage and achievable performance, assuming Nt = 256 elements per gNB sector. The denser deployment increases the ability of dIABA and cIABA to mitigate inter- ference, and in particular, improves the load-balancing effect of cIABA. Fig. 11b shows that the three-fold increase in gNB deployment density results in a significant increase in the per-UE achievable throughput – over 60% of UEs get the maximum achievable throughput using cIABA, compared to the 35% for the sparse deployment. Similar trends are observed for both dIABA and 5G-NR. Importantly, Fig. 11b also shows that cIABA achieves full network-wide coverage for the dense deployment, and a 10 pp improvement in coverage compared to the 5G-NR baseline. This highlights the primary importance of interference-aware BPL alloca- tion for mm-wave SDMA in dense network deployments, thus validating the design strategy of the proposed IABA for practical beyond-5G HBF MU-MIMO networks. 5 CONCLUSIONS We proposed IABA, a 5G-NR standard-compliant BPL allo- cation scheme, for mitigating residual spatial interference in practical mm-wave HBF MU-MIMO networks. IABA solves the network sum throughput optimization via either a distributed or a centralized BPL allocation using dedi- cated CSI-RS resources for candidate BPL monitoring. We presented a comprehensive study of practical multi-cell mm-wave HBF MU-MIMO networks, and showed that spatial interference becomes the main limiting factor of HBF MU-MIMO performance, which is in contrast to prior mm-wave networking studies assuming simplified channel and antenna models and perfect CSI at the gNB. Our re- sults showed that IABA offers significant performance gains over default 5G-NR, by facilitating allocation of secondary BPLs other than the strongest BPL found during initial access. Importantly, we demonstrated that IABA allows HBF MU-MIMO to outperform the interference-agnostic DBF MU-MIMO baseline, with further benefits of increased gNB antennas and densification for beyond-5G mm-wave networks. Our ongoing work is focused on low-complexity BPL allocation schemes using site-specific codebooks for adaptive CSI acquisition and further spatial multiplexing gains in diverse network configuration deployments. REFERENCES [1] M. Xiao et al., “Millimeter wave communications for future mobile networks,” IEEE J. Sel. Areas Commun., vol. 35, no. 9, 2017. [2] “5G; NR; User Equipment (UE) radio transmission and reception; Part 2: Range 2 Standalone,” 3GPP TS 38.101-2 V15.5.0, 2019. [3] M. Giordani et al., “A tutorial on beam management for 3GPP NR at mmWave frequencies,” IEEE Commun. Surveys Tuts., vol. 21, no. 1, 2019. [4] Y. Heng et al., “Six key challenges for beam management in 5.5G and 6G systems,” IEEE Commun. Mag., vol. 59, no. 7, 2021. [5] S. Segan. (2019) Here’s the real truth about Verizon’s 5G network. PC Mag Digital Group. [Online]. Available: https://www.pcmag.com/news/367659/ heres-the-real-truth-about-verizons-5g-network [6] GSMA, “5G mmWave deployment best practices whitepaper,” White Paper, Nov. 2022. [Online]. Available: https://www.gsma.com/futurenetworks/resources/ 5g-mmwave-deployment-best-practices-whitepaper/ [7] S. Kutty and D. Sen, “Beamforming for millimeter wave communi- cations: An inclusive survey,” IEEE Commun. Surveys Tuts., vol. 18, no. 2, 2016. [8] “5G; Study on new radio access technology,” 3GPP, Tech. Rep., Oct. 2017. [9] Ericsson, “Massive MIMO handbook, Technology primer,” Tech. Rep., 2023. [Online]. Available: https://www.ericsson.com/en/ ran/massive-mimo [10] K. Hassan, M. Masarra, M. Zwingelstein, and I. Dayoub, “Channel estimation techniques for millimeter-wave communication sys- tems: Achievements and challenges,” IEEE Open J. Commun. Soc., vol. 1, 2020. [11] R. W. Heath et al., “An overview of signal processing techniques for millimeter wave MIMO systems,” IEEE J. Sel. Topics Signal Process., vol. 10, no. 3, 2016. 13 [12] M. N. Kulkarni, A. Ghosh, and J. G. Andrews, “A comparison of MIMO techniques in downlink millimeter wave cellular networks with hybrid beamforming,” IEEE Trans. Commun, vol. 64, no. 5, 2016. [13] A. Alkhateeb, G. Leus, and R. W. Heath, “Limited feedback hybrid precoding for multi-user millimeter wave systems,” IEEE Trans. Wireless Commun, vol. 14, no. 11, 2015. [14] F. G´omez-Cuba et al., “Hybrid beamforming in 5G mmWave networks: A full-stack perspective,” IEEE Trans. Wireless Commun, vol. 21, no. 2, 2022. [15] S. Sun, T. S. Rappaport, and M. Shaft, “Hybrid beamforming for 5G millimeter-wave multi-cell networks,” in Proc. IEEE INFOCOM Workshops, Honolulu, USA, Apr. 2018. [16] S. Sun, T. S. Rappaport, M. Shafi, and H. Tataria, “Analytical framework of hybrid beamforming in multi-cell millimeter-wave systems,” IEEE Trans. Wireless Commun, vol. 17, no. 11, 2018. [17] Z. Sha, S. Chen, and Z. Wang, “Near interference-free space- time user scheduling for mmwave cellular network,” IEEE Trans. Wireless Commun., vol. 21, no. 8, 2022. [18] Z. Sha, Y. Ming, C. Sun, and Z. Wang, “Versatile resource manage- ment for millimeter-wave cellular network: Near interference-free scheduling methodology,” IEEE Trans. Veh. Technol., vol. 72, no. 6, 2023. [19] A. Alizadeh, M. Vu, and T. S. Rappaport, “A study of interference distributions in millimeter wave cellular networks,” in Proc. IEEE COMCAS, Tel Aviv, Israel, 2019. [20] Z. Marzi and U. Madhow, “Interference management and capacity analysis for mm-wave picocells in urban canyons,” IEEE J. Sel. Areas Commun., vol. 37, no. 12, 2019. [21] P. Paul, H. Wu, and C. Xin, “BOOST: A user association and scheduling framework for beamforming mmwave networks,” IEEE Trans. Mobile Comput., vol. 20, no. 10, 2021. [22] Y. Li et al., “Radio resource management considerations for 5G millimeter wave backhaul and access networks,” IEEE Commun. Mag., vol. 55, no. 6, 2017. [23] Q. Xue, X. Fang, M. Xiao, and L. Yan, “Multiuser millimeter wave communications with nonorthogonal beams,” IEEE Trans. Veh. Technol., vol. 66, no. 7, 2017. [24] G. Kwon, N. Kim, and H. Park, “Millimeter wave SDMA with limited feedback: RF-only beamforming can outperform hybrid beamforming,” IEEE Trans. Veh. Technol., vol. 68, no. 2, 2019. [25] A. Alizadeh and M. Vu, “Load balancing user association in millimeter wave MIMO networks,” IEEE Trans. Wireless Commun, vol. 18, no. 6, 2019. [26] A. Ichkov, P. M¨ah¨onen, and L. Simi´c, “Interference-aware user association and beam pair link allocation in mm-wave cellular networks,” in Proc. IEEE WCNC, Glasgow, Mar. 2023. [27] A. Ichkov, P. M¨ah¨onen, and L. Simi´c, “Is ray-tracing viable for millimeter-wave networking studies?” in Proc. IEEE PIMRC, Lon- don, UK, Sep. 2020. [28] A. Schott, A. Ichkov, P. M¨ah¨onen, and L. Simi´c, “Measurement validation of ray-tracing propagation modeling for mm-wave networking studies: How detailed is detailed enough?” in Proc. EuCAP, Florence, Italy, Mar. 2023. [29] “Study on channel model for frequencies from 0.5 to 100 GHz (3GPP),” 3GPP, TR 38.901 V14.3.0, 2017. [30] O. E. Ayach et al., “Spatially sparse precoding in millimeter wave MIMO systems,” IEEE Trans. Wireless Commun., vol. 13, no. 3, 2014. [31] H. Zhao et al., “28 GHz millimeter wave cellular communication measurements for reflection and penetration loss in and around buildings in New York city,” in Proc. IEEE ICC, Budapest, Hun- gary, Jun. 2013. [32] R. Peng and Y. Tian, “Robust wide-beam analog beamforming with inaccurate channel angular information,” IEEE Commun. Lett., vol. 22, 2018. [33] “5G; NR; Physical layer procedures for data,” 3GPP, TR 38.214 version 16.0.2 Release 16, Jul. 2020. [34] Q. Ziao and Y. Haifan, “A review of codebooks for CSI feedback in 5G new radio and beyond,” Preprint, arXiv, 2023. [Online]. Available: https://arxiv.org/pdf/2302.09222.pdf [35] E. Onggosanusi et al., “Modular and high-resolution channel state information and beam management for 5G new radio,” IEEE Commun. Mag., vol. 56, no. 3, 2018. [36] H. Elgendi et al., “Interference measurement methods in 5G NR: Principles and performance,” in Proc. IEEE ISWCS, Oulu, Finland, Aug. 2019. "
}