{
    "optim": "1 CSI-Free Optimization of Reconfigurable Intelligent Surfaces with Interference by Using Multiport Network Theory Andrea Abrardo Senior Member, IEEE Abstract—Reconfigurable Intelligent Surfaces (RIS) will play a pivotal role in next-generation wireless systems. Despite efforts to minimize pilot overhead associated with channel estimation, the necessity of configuring the RIS multiple times before obtaining reliable Channel State Information (CSI) may significantly di- minish their benefits. Therefore, we propose a CSI-free approach that explores the feasibility of optimizing the RIS for the uplink of a communication system in the presence of interfering users without relying on CSI estimation but leveraging solely some a priori statistical knowledge of the channel. In this context, we consider a multiport network model that accounts for several aspects overlooked by traditional RIS models used in Communication Theory, such as mutual coupling among scattering elements and the presence of structural scattering. The proposed approach targets the maximization of the average achievable rate and is shown to achieve performance that, in some cases, can be very close to the case where the RIS is optimized leveraging perfect CSI. Index Terms—Reconfigurable intelligent surface, Multi-user uplink communications, CSI-free optimization, structural scat- tering, mutual coupling, optimization. I. INTRODUCTION Reconfigurable Intelligent Surfaces (RIS) are considered a pivotal technology for enabling the concept of the smart radio environment in the context of next-generation wireless systems, particularly those operating at mmWave frequencies or even higher [1]–[4]. In a smart radio environment, the wireless system goes beyond conventional communication de- vice parameters, with the environment itself (e.g., the channel) becoming a variable that can be optimized [5]–[7]. In RIS- aided communications, precise estimation of the cascaded channel (from the UE to RIS and from the RIS to the BS) is essential for effective phase-shift design and harnessing the benefits offered by RIS technology. However, this task is complex, mainly attributed to the passive characteristics of the RIS and the complexities posed by high-dimensional channels [8]–[10]. Indeed, since all RIS elements are passive, i.e., they cannot transmit, receive, or process any pilot signal, CSI estimation can only be performed by a central controller (e.g., the BS) at the expenses of a huge overhead needed to estimate the channel with respect to standard MIMO systems. Accordingly, CSI estimation has been the subject of several studies in recent years, with the goal of minimizing A. Abrardo is with the University of Siena and CNIT, Italy (e-mail: abrardo@unisi.it). The work is supported by the 6G SHINE European project. I would like to express my sincere gratitude to Professor Marco Di Renzo and Professor Alberto Toccafondi for their invaluable contributions to this work. The collaboration with Marco Di Renzo in several past and present research activities in the field of RIS modeling and optimization has been instrumental in shaping the direction of this research. The support of Alberto Toccafondi allowed to enrich my understanding and expertise in electromagnetic modeling. the number of pilot RIS configurations required for accu- rate estimation [11]–[14]. The presence of electromagnetic interference, which cannot be ignored, particularly with very large RIS surfaces, can further complicate the CSI problem if appropriate countermeasures are not implemented, as shown in [15], [16]. Despite efforts to minimize pilot overhead associated with channel estimation, the need to configure the RIS multiple times before obtaining reliable CSI may significantly dimin- ish their benefits, especially if the number of individually reconfigurable elements is excessively large or if an inefficient channel estimation algorithm is utilized [17], [18]. Further- more, considering the dynamic nature of the wireless channel and user mobility, reconfiguring a RIS within a timescale aligned with the coherence time of the environment (e.g., the channel) can be challenging, particularly in highly dynamic environments [3]. To address these open research issues, some authors have recently delved into research on RIS-aided systems that do not strictly depend on perfect CSI knowledge, e.g., see [17], [19]–[23]. Specifically, in [19], the phase shifts of the RIS and the transmit beamforming/precoding vector at the ac- cess point are optimized using a two-timescale beamforming optimization algorithm. The RIS is optimized based on the statistical CSI of all links, which is operated on a long time- scale, effectively reducing the CSI overhead. Simultaneously, the transmit beamforming/precoding vectors at the access point are designed based on the instantaneous CSI of the effective channels, given the optimized RIS configuration. Following a different direction, in [17], [20], the RIS design is conducted offline assuming a priori statistical knowledge of UE locations. This involves a two-phase optimization process, encompassing an offline phase (long-term and sporadic) and an online phase (short-term and more frequent). During the online phase, communication between the BS and the UEs is optimized without interaction with the RISs. The key advantage of this approach is that information necessary for RIS optimization can either be known beforehand (e.g., knowledge of UEs confined within a specific area) or can be occasionally learned during system operation, leveraging a localization infrastructure. In all the previously mentioned works, and in the majority of works addressing RIS optimization for communications and/or CSI estimation, a RIS is characterized as a planar array comprising a given number of reflective elements strategically positioned at sub-wavelength intervals. The impedance of each element can be finely adjusted to introduce a controllable phase-shift to the incident wave before reflecting it. By optimizing the phase-shift pattern across the RIS, it becomes possible to manipulate the reflected wavefront, directing it arXiv:2402.17651v1  [cs.IT]  27 Feb 2024 2 into a beam aimed at the intended receiver. These models are not always electromagnetically consistent, since they do not consider several aspects that play an important role in characterizing the operation of a realistic RIS [24]–[26]. Recent results highlight, in fact, the critical need of using realistic reradiation models [27], which result in a strong in- terplay between the surface-level optimization of RISs and the element-level design of the RIS elements [28]. In this context, multiport network theory has been proved to be a suitable approach for modeling and optimizing RIS-aided channels [29]. The motivation for using multiport network theory lies in its inherent capability of modeling the electromagnetic mutual coupling between closely-spaced radiating elements, which is a key distinguishing feature of RISs, especially for realizing advanced wave transformations at a high power efficiency [30]–[32]. The first multiport model for RIS-aided channels was introduced in [33], assuming a minimum scattering radiating element configuration. The model employed thin wire dipoles as scattering elements for analytical tractability, aligning with the discrete dipole approximation [34]. A similar model based on the coupled dipoles formalism is presented in [35]. The distinctive feature of the communication model in [33] is its non-linearity, arising from the tunable impedances, leading to a system response affected by electromagnetic mutual coupling between closely spaced RIS elements. Subsequently, this multiport model has been applied in various works consid- ering different communication scenarios, such as Single-Input Single-Output (SISO), Multiple-Input Single-Output (MISO), and Multiple-Input Multiple-Output (MIMO), and different channel models [17], [36]–[42]. In two recent works [43], [44], an easily applicable mul- tiport network model is proposed, based on the S and Z parameters representation of the network. This model re- veals the approximations inherently considered in classical RIS models used in communication theory that assume the RIS as an ideal scatterer. These classical models overlook the effects of: (i) electromagnetic mutual coupling between scattering elements; (ii) correlation between the phase and amplitude of the reflection coefficient; (iii) the presence of a structural scattering component, leading to an unwanted specular component of the reflected wavefront. In all these works dealing with multiport network models, the channel is assumed to be perfectly known at the central controller, and RIS optimization is carried out accordingly. A. Contribution In this work, we adopt the CSI-free approach, exploring the feasibility of optimizing the RIS without relying on CSI esti- mation. Similar to other works proposing methods for cascade channel estimation, such as [9], [16], and [45], we presume a priori statistical knowledge of the channel, specifically the correlation matrix. The two main novel contributions of this work are listed below. • Instead of utilizing the knowledge of the channel correla- tion matrix to develop an efficient channel estimation, we employ it directly for RIS optimization, as proposed in [19], [17], and [20]. However, unlike these works, we do not rely on a Monte Carlo approach for RIS optimization, which can be computationally very intensive. Instead, we employ an approach that optimizes the RIS directly based solely on the correlation matrix of the channel. This approach is generalized to accommodate the presence of a certain number of interferers in the form of other transmitting nodes. • The proposed approach fot CSI-free RIS optimization leverages the multiport network model proposed in [44]. As discussed earlier, this model allows for a more real- istic characterization of the RIS compared to the ideal models considered so far in the field of CSI estimation or CSI-free RIS optimization. The offline CSI-free RIS optimization proposed in this paper is carried out assuming that in the channel between the Base Station (BS) and the RIS, the presence of natural scattering can be neglected and that the BS and the RIS are positioned in fixed and known locations. The first assumption arises from the consideration that the BS and the RIS can, in many cases, be optimally deployed to have a very strong Line-of- Sight (LOS) component. However, in the model considered for simulations, we will take into account the presence of multipath also in the BS-RIS link. In the Results section, we will demonstrate the validity of the proposed approach and how the CSI-free approach allows for achieving good performance in terms of achievable throughput in an uplink communication scenario. It is also demonstrated how the use of simplified models that assume the Reconfigurable Intelligent Surface (RIS) as an ideal scatterer results in a significant performance loss due to model mismatch. B. Paper Outline and Notation The rest of this paper is organized as follows. In Sec- tion II, we introduce the model adopted for the system, including the propagation models and the communication scenario. In Section III, the multiport network model for the Reconfigurable Intelligent Surface (RIS) characterization is proposed. In Section IV, we provide an iterative algorithm with provable convergence that allows carrying out the CSI- free RIS optimization. Numerical results are presented in Section V, while conclusions are drawn in Section VI. Notation: Unless otherwise specified, matrices are denoted by bold uppercase letters (i.e., X), vectors are represented by bold lowercase letters (i.e., x), and scalars are denoted by normal font (i.e., x). (·)T, (·)H and (·)−1 stand for the trans- pose, Hermitian transpose and inverse of the matrices. The symbol ⊙ represents the Hadamard (element-wise) product while with diag (x) we mean the diagonal matrix obtained from the element of vector x. The notation ||x|| signifies the Euclidean norm of the vector x, and E{·} represents the statistical expectation. II. SYSTEM MODEL We consider a wireless scenario with Nu single-antenna UEs that must establish a communication link with an N- element BS. The BS antennas are arranged in a uniform planar 3 Fig. 1: RIS-aided communication system. array (UPA) with NH rows and NV columns, resulting in N = NHNV . In this environment, a Reconfigurable Intelli- gent Surface (RIS) is present with the goal of supporting the communication of one of the UEs, referred to as the reference user. The RIS is equipped with M passive reconfigurable elements, forming a UPA with MH rows and MV columns, where M = MHMV . Without loss of generality, we assume that the first UE serves as the reference user. Hence, in the considered scenario, the objective of the RIS is to maximize the rate of the first UE, while users i, where i = 2, . . . , Nu, act as interferers. Since we are interested in finding the optimal Reconfig- urable Intelligent Surface (RIS) configuration, we neglect in what follows the direct links between the User Equipments (UEs) and the Base Station (BS) that are not under the control of the RIS. On the other hand, as discussed in most previous works on RIS, e.g., see [17], [46], [47], in the presence of a strong BS-UE direct link, the impact and contribution of the RISs are usually not very significant. Hence, optimizing the RISs to take into account this possibility typically has no significant benefit. Accordingly, denoting by ti ∈ CM×1 the channel between UE i and the RIS, and by S ∈ CN×M the channel between the RIS and the BS, we can express the received vector y ∈ CN×1 as follows: y = S∆(z) Nu X i=1 tisi + n. (1) Here, ∆(z) ∈ CM×M is the RIS reflecting matrix, dependent on a vector z ∈ CM×1 of tunable parameters, si represents the transmitted symbol by UE i, and n ∈ CN×1 is the thermal noise with variance σ2 n. Concerning the matrix S, it is assumed to be perfectly known from the network deployment. On the other hand, the Base Station (BS) and the Reconfigurable Intelligent Surface (RIS) are typically in fixed positions and arranged to establish a strong LOS that depends solely on their respective positions. Therefore, the channel can be assumed to be deterministic and known. In the model considered for simulations, we will take into account the presence of a certain amount of multipath in the BS-RIS link, showing that this presence does not impact the validity of this assumption, provided, of course, that the LOS component overwhelms the scattering component. Conversely, the channels ti are not known to the BS, and for this reason, the optimization of the Reconfigurable Intelligent Surface (RIS) requires either a direct estimation or prior knowledge of certain statistical parameters characteriz- ing these channels. This latter approach is considered in this paper as it avoids the heavy overhead of channel estimation, as discussed in Section I. In particular, we assume to know the correlation matrices: Rti = E \u0000titH i \u0001 (2) with i = 1, . . . , Nu and we denote by x = t1s1, the intended signal, and by wi = tisi, with i > 1 the interfering users. Then we introduce: Rx = E \u0000xxH\u0001 = σ2 1Rt1 Rwi = E \u0000wiwH i \u0001 = σ2 i Rti i = 2, . . . , Nu (3) where σ2 i = E \u0000|si|2\u0001 is the transmitted power of the i-th UE. It is worth noting that this assumption is often employed to support Channel State Information (CSI) estimation in previous works, such as [20], [48], [49]. In our paper, we utilize this a-priori information to optimize the Reconfigurable Intelligent Surface (RIS) without involving any channel estimation phase. III. RIS MODELS A. Communication Theory (CT) Model The model traditionally used to characterize RIS and inte- grate them into a communication system is to represent them as surfaces composed of ideal scatterers capable of imparting a phase shift on the impinging signal. This model, which we will refer to as the Communication Theory model (CT) hereafter, can be represented by a diagonal reflection matrix with elements: [∆CT (z)]m,m = K0Γm (4) where K0 is a constant depending on the geometry of the scatterer, and Γm = ejϕm is the load reflection coefficient which can be changed by acting on the tunable parameter zm. B. Multiport Network (MP) Model Referring to the multiport Z-parameters representation of an end-to-end channel matrix involving an RIS presented in [43], we have: ∆MP (z) = −2Y0(ZSS + r0IM + ZR)−1. (5) Here, ZSS ∈ CM×M represents the matrix of self and mutual impedances of the RIS, ZR = diag(z) where z are tunable impedances connected at the RIS ports, r0 is a small parasitic resistance, IM is the identity matrix, and Y0 is a reference admittance which depends, among other factors, on the reference impedance Z0. For simplicity, it is assumed that Z0 is the same for all ports and equal to Z0 = 50Ω. Note that (5) has dimensions of Ω−2, which is consistent with 4 the fact that when using the Z-parameter representation of the multiport, S and ti in (1) are impedance matrices with dimensions of Ω. C. Comparison between CT and MP models The CT model in (4) can be seen as a particular case of the more general MP model in (5), as broadly discussed in [43]. It is indeed straightforward to derive the CT model from the MP one my making the following assumptions. First we neglect the parasitic resistance r0 and impose ZSS = Z0IM. In this manner, beyond ignoring the mutual coupling, the scattering matrix of the RIS becomes zero, and the effect of the RIS is solely to introduce a pure phase shift to the incident signal. This simplified model is denoted by ideal Multi-Port (iMP) which, from (5), yields a diagonal RIS reflection matrix with elements: [∆iMP (z)]m,m = −2Y0(Z0 + zm)−1. (6) Hence, it is easy to verify that: ∆iMP (z) = ∆CT (z) − Y0 Z0 IM, (7) when K0 = Y0 Z0 and Γm(zm) = jbm−Z0 jbm+Z0 . The above equation allows to shed light on a third important approximation which is inherent in the CT model, in which ∆S = − Y0 Z0 IM is not considered. This term corresponds to the scattered signal obtained when the the RIS is terminated with impedances zm = Z0, i.e., when the load reflection coefficient is zero, and hence the CT model would entails zero scattered energy. This structural component causes the RIS to behave like a scatterer that does not introduce any phase shift on the incident signal, thereby introducing a specular component that, as we will see, cannot be ignored without significantly deteriorating performance in certain situations. IV. RIS OPTIMIZATION A. Problem Formulation From now on, we will consider the case where the RIS is terminated with a purely reactive impedance, which is the case of interest where we have maximum signal reflection. Therefore, we consider z = jb. For simplicity, we denote ∆(b) = ∆(jb). Hence, denoting by Φ = S∆(b) and emphasizing the effect of the intended UE with respect to the others, we can rewrite (1) as follows: y = Φx + Φ Nu X i=2 zi + n. (8) The BS estimates the transmitted signal s1 by using the combining vector v ∈ CN×1 to obtain: ˆs1 = vHy = vHΦx + vHΦ Nu X i=2 zi + vHn. (9) Considering the worst-case bound for the evaluation of the rate based on the assumption of uncorrelated additive noise given in [50], we can write the following expression for the ergodic achievable uplink rate: R = Ex [log2 (1 + γ(x, Φ))] (10) where Ex is the expectation with respect to x and γ(x, Φ) = vHΦxxHΦHv E \u0012Nu P i=2 vHΦzizH i ΦHv + vHvσ2n \u0013 (11) = vHΦxxHΦHv vH \u0012 Φ Nu P i=2 RwiΦH + σ2nIN \u0013 v In order to provide a CSI-free RIS design, the RIS could therefore be designed with the aim of maximizing: Z w γ(w, Φ)fx(w)dw (12) Where fx(w) is the probability density function (pdf) of x, i.e., aimed at maximizing the average rate. This approach has already been proposed in previous works, for example, see [51] and [17], for traditional RIS models. However, it has the drawback of requiring knowledge of the full channel statistics. Moreover, since the integral in (12) cannot be evaluated in closed form, it is necessary to rely on a Monte Carlo approach. To overcome these challenges, we consider the upper bound Rb ≥ R derived from the concavity of the logarithm function, where: Rb = log2 {1 + Ex [γ (x, Φ)]} . (13) From (11) we have: Ex [γ (x, Φ)] = vHΦRxΦHv vH \u0012 Φ Nu P i=2 RwiΦH + σ2nIN \u0013 v (14) for which it is only necessary to know the channel correlation. To further elaborate, we are then in the position to formulate the optimal CSI-free RIS design as: b∗ = arg max b vHΦ(b)RxΦ(b)Hv vHΦ(b) Nu P i=2 RwiΦ(b)Hv + vHvσ2n (15) s.t. Φ ∈ F where the feasible set F = {Φ ∈ C1×M|Φ = S∆(b)} (16) enforces the multiport network model, where b represents the tunable reactances of the RIS, i.e., b ∈ RM. To further elaborate, we first observe that problem (15) is not convex in b. Hence, we provide in the following an alternative formulation of the same problem which allows to get a local optimum. First, to reduce the dimension of the problem we consider the eigen-decomposition Rx = UDUH and denote by r the rank of Rx. Then, we denote by r ∈ Cr×1 a vector of i.i.d. Gaussian random variables with r ∼ N(0, Ir). Observing that 5 UD 1 2 r and x have the same correlation matrix, we rewrite (8) as: y = ΦUD 1 2 r + Φ Nu X i=2 zi + n. (17) The linear minimum mean square error (LMMSE) estimator of r from vHy is the linear filter Λ ∈ Cr×1 designed to minimize the mean square error (MSE) between the vector r and its MMSE estimate ˆr = ΛvHy, i.e., Er = E n\r\rΛvHy − r \r\r2o . (18) The linear estimator that minimizes (18) is then given by: Λ(Φ)= D 1 2 UHΦHv vH \u0012 ΦRxΦH + Φ Nu P i=2 RwiΦH + σ2nIN \u0013 v , (19) where Λ(Φ) ∈ Cr×1 depends on the RIS phase-shift matrix Φ. Substituting (19) into (18) yields: Er(Φ) = tr \u0010 Ir − Λ(Φ)vHΦUD 1 2 \u0011 . (20) Denoting s = D 1 2 UHΦHv, from (19), (20) can be written as: Er(Φ) = tr     Ir − ssH vH \u0014 Φ \u0012 Rx + Nu P i=2 Rwi \u0013 ΦH + σ2nIN \u0015 v      = r − sHs vH \u0014 Φ \u0012 Rx + Nu P i=2 Rwi \u0013 ΦH + σ2nIN \u0015 v = r − 1 + 1 Ex [γ (x, Φ)] + 1 (21) Thus, problem (15) is equivalent to: b∗ = arg min b Er(Φ(b)) (22) s.t. Φ ∈ F In other words, the optimal design of the Reconfigurable In- telligent Surface (RIS), aimed at maximizing the ergodic rate for a given combining vector v without channel estimation, is equivalent to the optimal RIS design for minimizing the estimation error of the channel based on a single observation of the received signal obtained using the same combining vector v. This equivalence holds particularly when channel estimation employs a Linear Minimum Mean Squared Error (LMMSE) estimator. Problem (22) is still not convex in b. To address the solution of (22), we make a simplifying assumption, neglecting the fact that Λ(Φ) depends on the value of Φ. Hence, we express the objective function of (22) as Er(Φ) = Er(Λ, Φ(b)), (23) as if Λ and Φ were independent variables. Under this hypoth- esis, (22) can be solved by following an alternating optimiza- tion (AO) approach. The AO is an iterative algorithm whose key advantage is that it simplifies the optimization process by breaking it into smaller subproblems, which are easier to solve. The AO approach is especially helpful when the original problem involves complicated interactions or dependencies among the variables. In particular, we propose a two-step iterative algorithm, where Er is alternatively optimized with respect to Λ and Φ. Being Λ(k) and Φ(k) the values found at iteration k, at iteration k + 1 we proceed as follows: 1) Having fixed the value of Φ = Φ(k), we minimize (23) by computing Λ(k+1) as Λ(Φ) in (19). This optimization is unconstrained and is a straightforward application of MSE minimization; 2) Fixing the value of Λ as Λ(k+1), the MSE takes the expression given in (24) and Er(Λ, Φ) is now a convex function of Φ. The RIS phase-shift matrix is computed as the solution of the minimization Φ(k+1) = arg min Φ Er \u0010 Λ(k+1), Φ \u0011 , s.t. Φ ∈ F. (25) Regarding the convergence of the proposed technique we can observe that, since in both steps we minimize the MSE, at each iteration the MSE either decreases or reaches a point where it remains unchanged. Given that the MSE is a positive value, the procedure will ultimately converge to a local optimum. B. Solution of (25) 1) Solution for the MP case: The main difficulty posed by (25) is the nonlinearity of Φ(b) = S∆(b), where ∆(b) is defined in (5). To elaborate, for the sake of notation convenience, let us introduce Q and q ∈ Cr×1 as: Q = vH   Φ(b)   Rx + Nu X i=2 Rwi ! ΦH(b) + σ2 nIN ! v q = vHΦ(b)UD 1 2 (26) It is then easy to show that: Er \u0010 Λ(k+1), Φ(b) \u0011 = \r\r\rΛ(k+1)\r\r\r 2 Q−2ℜ r X j=1 h Λ(k+1) j qj i + r. (27) The proposed approach to RIS optimization utilizes the Neu- mann series approximation to linearize the matrix inverses for small variations of the solution, similar to traditional Z-matrix- based approaches (see, e.g., [36]). However, as demonstrated in [44], working with the phase of the reflection coefficients rather than directly with the tunable reactances b leads to better performance in terms of algorithm convergence. For further clarification, when neglecting the parasitic resistance r0, the reflection coefficient Γm of the m-th port of the RIS becomes a pure phase shift, i.e., Γm = ejϕm, and we can 6 express it as: Γm =jbm − Z0 jbm + Z0 → bm = Z0 j 1 + ejϕm 1 − ejϕm dbm dϕm = 2Z0 ejϕm (ejϕm − 1)2 = (28) 2Z0 jbm − Z0 (jbm + Z0) \u0010 jbm−Z0 jbm+Z0 − 1 \u00112 = −b2 m + Z2 0 2Z0 Hence, denote by B(k) = diag \u0000b(k)\u0001 and ϕ(k) the tunable re- actances matrices and the corresponding reflection coefficient phase vector at iteration k of the iterative algorithm. Consider- ing small variations of ϕ(k) for evaluating the solution at next step, i.e., ϕ(k+1) = ϕ(k) + δ, with δ ∈ C1×M and δm << 1, we have: B(k+1) ≈ B(k) + F(k)diag (δ) (29) where F(k) ∈ CM×M is a diagonal matrix with entries F(k) m,m = −(b(k) m ) 2+Z2 0 2Z0 . Since Φ = S∆(b), from (5) and (26) we have: Q = 4Y 2 0 vH ( S(ZSS + r0 + jB)−1   Rx + Nu X i=2 Rwi ! (30) × \u0002 S(ZSS + r0 + jB)−1\u0003H + σ2 nIN o v q = −2Y0vHS(ZSS + r0 + jB)−1UD 1 2 . From (29) we have: S(ZSS + r0 + jB(k+1)−1 (31) = S(ZSS + r0 + jB(k) + jF(k)diag (δ))−1, We then introduce the following terms: A(k) = \u0010 ZSS + r0 + jB(k)\u0011−1 (32) G(k) = jSA(k)F(k). Invoking the Neumann series approximation for matrix inver- sion, we have: S(ZSS + r0 + jB(k+1))−1 ≈ SA(k) − G(k)diag (δ) A(k) (33) where the approximation holds when: \r\r\r\rF(k)diag (δ) \u0010 ZSS + r0 + jB(k)\u0011−1\r\r\r\r ≤ ϵ (34) with ϵ << 1. Denoting by P = F(k)A(k), condition (34) can be expressed as: M X m=1 δ2 mθ2 m < ϵ2 (35) where θm represents the entries of the main diagonal of PPH. Then: Q ≈ 4Y 2 0 vH ( (SA(k) − G(k)diag (δ) A(k))   Rx + Nu X i=2 Rwi ! (36) × h SA(k) − G(k)diag (δ) A(k)iH + σ2 nIN \u001b v q ≈ −2Y0vH \u0010 SA(k) − G(k)diag (δ) A(k)\u0011 UD 1 2 Introduce now the terms: R = Rx + Nu X i=2 Rwi C1 = 4Y 2 0 vHSA(k)R h A(k)iH SHv C2 = 4σ2 nY 2 0 vHSA(k)Rv d = −2Y0vHSA(k)UD 1 2 (37) which allows us to reformulate the expression of Q and q as: Q ≈ C1 + C2 − 2ℜ \u001a 4Y 2 0 vHG(k)diag (δ) A(k)R h A(k)iH SHv \u001b (38) + 4Y 2 0 vHG(k)diag (δ) A(k)R h A(k)iH diag (δ) h G(k)iH v q ≈ d + 2Y0vHG(k)diag (δ) A(k)UD 1 2 It is now convenient to introduce the terms: RA = A(k)R h A(k)iH ∈ CM×M f1 = 4Y 2 0 vHG(k) ∈ C1×M f2 = RASHv ∈ CM×1 f3 = h G(k)iH v ∈ CM×1 f4 = 2Y0vHG(k) ∈ C1×M f5 = A(k)UD 1 2 Λ(k+1) ∈ CM×1 (39) F1 = diag(f1) ∈ CM×M F3 = diag(f3) ∈ CM×M f1,2 = f T 1 ⊙ f2 ∈ CM×1 f4,5 = f T 4 ⊙ f5 ∈ CM×1 Accordingly, by considering only the terms in (27) that depend on the optimization variable δ, we can approximate the MSE Er \u0010 Λ(k+1), Φ(b) \u0011 =tr ( Λ(k+1) \" vH   Φ(b)   Rx + Nu X i=2 Rwi ! ΦH(b) + σ2 nIN ! v # Λ(k+1)H−2ℜ h Λ(k+1)vHΦ(b)UD 1 2 i +Ir ) . (24) 7 (27) as: ˆEr \u0010 Λ(k+1), Φ(δ) \u0011 = \r\r\rΛ(k+1)\r\r\r 2 δF1RF3δT (40) − 2δ \u0014\r\r\rΛ(k+1)\r\r\r 2 ℜ (f1,2) + ℜ (f4,5) \u0015 We are now in a position to define the problem for finding the optimal δ as: δ∗ = arg min δ ˆEr \u0010 Λ(k+1), Φ(δ) \u0011 (41) s.t. M X m=1 δ2 mθ2 m < ϵ2 The problem in (41) is now convex and can be easily solved in the Lagrangian domain. First, from (40) we derive the gradient of the Lagrangian: ∇δ \" ˆEr \u0010 Λ(k+1), Φ(δ) \u0011 + µ  M X m=1 δ2 mθ2 m − ϵ2 !# = 2δ \r\r\rΛ(k+1)\r\r\r 2 ℜ (F1RF3) (42) − 2 \r\r\rΛ(k+1)\r\r\r 2 ℜ (f1,2) − ℜ (f4,5) + 2δΨ where µ > 0 is a Lagrange multiplier and Ψ ∈ CM×1 is a vector with entries θ2 m. Accordingly, denoting by M = \r\rΛ(k+1)\r\r2 ℜ (F1RF3) and v = \r\rΛ(k+1)\r\r2 ℜ (f1,2) + ℜ (f4,5), we finally obtain δ∗ = [M + µ × diag (Ψ)]−1 v (43) where µ is set to satisfy the constraint in (41). Finally, we can evaluate B(k+1) ≈ B(k) + F(k)diag (δ∗) and go to the next iteration of the AO algorithm. 2) Solution for the CT model: In the CT case, it is necessary to use (4) instead of (5). This firstly entails using a diagonal ZSS with entries Z0, which is trivial and does not lead to differences regarding the solution of problem (25). Secondly, it is necessary to subtract ∆S in (33), resulting in: S(ZSS + r0 + jB(k+1))−1 (44) ≈ SA(k) − G(k)diag (δ) A(k) − ∆S. From this point onwards, the optimization can proceed straightforwardly in the same manner as described above for the MP case. V. NUMERICAL RESULTS We present some numerical results to assess the effective- ness of the proposed optimization algorithms. Considering the scenario depicted in Fig. 1, we assume the carrier frequency is f0 = 30 GHz, the RIS is centered at position PR = (0, 0, 3) m, and the BS is positioned at PBS = (−7, 7, 2) m, corre- sponding to an angle of −π/4 with respect to the RIS. The Nu UEs are situated at positions Pi = (Xi, Yi, 0) m, indicating that they are located on the opposite side of the room from the BS. Specifically, P0 is the position of the user of interest and Pi, i > 0 are the positions of the interfering users. Following the RIS structure proposed in [44], the scatterers of the RIS consist of identical metallic dipoles with a radius of λ/500 and a length of L = 0.46λ. The dipoles are configured as a uniform planar array (UPA) with MH elements along the x axis and MV elements along the z axis. The spacing between the elements is set to dx = λ/Q in the x direction, where Q is an integer determining the dipole density. Conversely, the spacing between elements in the z direction is dz = 3/4λ. We then choose MH = 16λ/dx and MV = 4, resulting in an RIS forming a rectangle with an area of 50λ2. Regarding the BS, it is equipped with N = 16 antennas arranged in two linear arrays along the z axis, with each array containing 8 antennas along the x axis. The antennas at the BS are separated by λ/2 in the x-axis and 3λ/4 in the z-axis. Similar to the RIS, these antennas are metallic dipoles with a radius of λ/500 and a length of L = 0.46λ. Regarding the noise, the variance σ2 is calculated to achieve a signal-to-noise ratio of -20 dB in the case where the RIS is configured randomly and for a transmitted power Ptx = 20 dBm. Finally, the UEs are equipped with single dipole antennas having the same characteristics. In the following two subsections, we describe the models used for RIS optimization and for generating simulation results. A. Model considered for RIS optimization Given the potential presence of both Line of Sight (LOS) and non-Line of Sight (NLOS) components in practical chan- nels, we characterize the RIS-UE channel using a generalized spatially correlated Rician fading model [52]. This approach is widely used in the literature to account for the presence of multipath fading in RIS-aided communications, as shown, for example, in [42] for a multiport network model using S- parameters. As for the LOS, it is assumed that the prior positions of the nodes are known with circular uncertainty, meaning the nodes are uniformly distrubuted within a circle of radius σ around the actual position, corresponding to the localization error. The correlation matrices of the LOS components are then computed using a classical model for correlation calculation based on the angular spread with which the signal can arrive given the known localization error. For simplicity, consider a planar geometry where the arrival angle depends only on the azimuth φ, and assume knowledge of the range ∆i of possible arrival angles for the signal from i-th UE, given its uncertainty region (see the illustrative example in Fig. 2). Denoting by xm the x location of the m-th dipole of the RIS, with m = 1, . . . , M, when a plane-wave impinges on the RIS from the azimuth angle φ, the array response vector can be written as [53] a(φ) = h ej 2π λ x1 sin φ, . . . , ej 2π λ xM sin φiT , (45) where λ is the wavelength. Hence, the channel correlation matrices Ri are evaluated as: Ri = βi Z φi+∆i/2 φi−∆i/2 f(φi, ∆i)a(φ)aH(φ)dφ (46) where f(φi, ∆i) = 4(φ−φi) ∆i is the spatial scattering distri- bution function which derives from the uniform distribution 8 Fig. 2: Angle spread for correlation evaluation assumption within the circle, βi is the channel gain which is evaluated assuming a LOS propagation model. Note that this model is equivalent to the spatial correlation matrix model proposed in [53], [54]. However, in this case this model is considered only for CSI-free RIS optimization purposes and does not reflect the model which is generated in the simulations, as explained below. The same model is assumed for the NLOS component. In particular, considering a Ricean factor K1 and an angular spread ∆m and the correlation matrix of the NLOS part is: Wi = βi K1 Z φi+∆m/2 φi−∆m/2 f(φi, ∆m)a(φ)aH(φ)dφ (47) Hence, we evaluate Rx = R1 + W1 and Rwi = Ri + Wi, with i > 1. B. Model considered for Simulations Given the estimated positions of the nodes, the true posi- tions are generated according to the uncertainty model, which selects a random point within the circle of the uncertainty region. Meanwhile, the BS is positioned at a fixed location. Subsequently, the Line of Sight (LOS) components of the matrices S and the vectors ti, along with the matrix ZSS, are derived from the multiport network model introduced in [33], utilizing the nodes’ positions. This model’s accuracy has been confirmed in [44] through comparison with a full-wave numerical simulator. To streamline the simulations, we assume that the antennas at the BS are isolated dipoles, neglecting mutual coupling effects at the BS. Subsequently, following the Ricean channel model outlined earlier, a Gaussian NLOS component is incor- porated. Specifically, if S and ti represent the terms computed by the model [33], the actual S(e) and t(e) i are determined by introducing multipath effects in the form of additive Gaussian noise with a covariance matrix calculated as in (47). Notably, we generate the NLOS for the i-th RIS-UE channels, taking into account the angle spreading ∆m and the Ricean factor K1. For the BS-RIS channel, we consider the angle spreading ∆(BS) m and a Ricean factor K0. It’s worth mentioning that although we include the NLOS component in the BS-RIS channel in the simulations, this effect is not accounted for in the analysis, assuming that K0 can be very high. The direct path BS-UE is not modeled, assuming it is entirely blocked. The transfer function used to compute the achievable rate is calculated as in (1) using S(e) and t(e) i , and the rate is determined as in (10), i.e., with exact channel knowledge. This corresponds to the assumption that given the RIS optimization obtained in an offline phase, during actual transmission, the RIS becomes an integral part of the environment, and com- munication follows standard end-to-end channel estimation strategies, which can be conducted with pilot sequences and receiver CSI estimation. Thus, the computed rate assumes ideal channel estimation in this phase or negligible errors affecting it. C. Results In the following figures, we present the results obtained from simulations to validate the CSI-free optimization ap- proach proposed in Section IV. In this regard, the combining vector v is a beamforming vector. Specifically, denoting φBS as the arrival angle of the signal at the BS from the RIS, v is calculated as v = a(φBS), where a is defined in (45). Therefore, the results are obtained for two different schemes, namely OPT-NoCSI and CT-NoCSI which correspond to the solution of (25) for the MP, and CT models, respectively. These approaches will be compared with OPT-CSI, which corresponds to the OPT-NoCSI scheme in the case where the channel is exactly known for all involved nodes. This scheme, representing the ultimate upper bound benchmark, can be easily derived from the OPT-NoCSI scheme by calculating Rx = σ2 1t(e) 1 \u0010 t(e) 1 \u0011H and Rwi = σ2 i t(e) i \u0010 t(e) i \u0011H . In the initial figures, the convergence behavior for the OPT-NoCSI algorithm is depicted for the case where Nu = 3, with positions P0 = 10 (cos π/8, sin π/8, 0), P1 = 10 (cos π/4, sin π/4, 0), and P2 = 10 (cos 3π/8, sin 3π/8, 0), and for three values of dipoles’ distances: dx = λ/2, dx = λ/4, and dx = λ/8. Specifically, the rate value (13) expressed in bit/s/Hz is plotted against the iteration index k. In other words, the node positions are assumed such that the two interfering nodes are located at the same distance of 10 meters from the useful node, corresponding to the case where the signal-to-interference ratio (SIR) is equal to 1, with angles between the nodes differing by π/8. The Ricean factors K0 and K1 for the BS-RIS and RIS-UEs links are set to K0 = 20 and K1 = 10, respectively. Figure 3 (a), (b), (c) and (d) report the results for four different position uncertainty: σ = 0 m, σ = 0.1 m, σ = 0.5 m and σ = 1 m, respectively. It can be observed that the proposed algorithm allows for an increasing rate Rb with iterations, thus enabling convergence to a local optimum in all cases. In this regard, it is noted that when the dipoles are spaced by λ/2, convergence is faster, which can be explained by the lesser effect of the non-diagonals of the Z matrix. On the other hand, better performance is observed when the dipoles are closer, an effect already highlighted in previous works using multiport network models. It is noted that this improvement is achieved for the same RIS aperture of 50λ2. Finally, it is observed that increasing position uncertainty results in only a slightly 9 0 0.5 1 1.5 2 2.5 3 Iterations 104 0 2 4 6 Rb (a) dx = /2 dx = /4 dx = /8 0 0.5 1 1.5 2 2.5 3 Iterations 104 0 2 4 6 Rb (b) dx = /2 dx = /4 dx = /8 0 0.5 1 1.5 2 2.5 3 Iterations 104 0 2 4 6 Rb (c) dx = /2 dx = /4 dx = /8 0 0.5 1 1.5 2 2.5 3 Iterations 104 0 2 4 6 Rb (d) dx = /2 dx = /4 dx = /8 Fig. 3: Convergence behavior for the OPT-NoCSI algorithm for the case where Nu = 3 and for three values of dipoles’ distances: dx = λ/2, dx = λ/4, and dx = λ/8. The node positions are assumed such that the two interfering nodes are located at the same distance of 10 meters from the useful node, with angles between the nodes differing by π/8. The results for four different position uncertainty, namely σ = 0 m, σ = 0.1 m, σ = 0.5 m and σ = 1 m, are reported in Figs. (a), (b), (c) and (d), respectively. perceptible performance degradation. For example, in the case of λ/8, the rate decreases from approximately 6.5 to 6. It should be emphasized that this is not the actual rate measured by the simulations and reported in the subsequent graphs, but only the rate used in the objective function to optimize the RIS in the offline phase. In Figs. 4-6, the trend of the rate R in (10) evaluated through simulations is depicted, considering σ = 0.5 m in the case of Nu = 2 with the intended UE positioned at P0 = 10 (cos π/8, sin π/8, 0) while the interfering UE is positioned at 12 different possible positions P1 = Ti = 10 [cos(i × π/32), sin(i × π/32)] with i = 1, 2, . . . , 15. Ac- cordingly, the interfering user is at the same distance from the RIS as the useful user but with different angles. In Figs. 4-6(a), the case dx = λ/2 is considered, whereas in 4-6(b) dx = λ/4 is reported. Furthermore, the three figures 4, 5, and 6 refer to the values of σ = 0.5, 1, 2 m, respectively. The curves correspond to the OPT-NoCSI, OPT-CT, and OPT- CSI cases described earlier. It is noted that at position T4, the interfering user is on average in the same position as the intended UE, thus an average rate equal to one is expected since SIR = 1 and the interference cannot be removed, as indeed happens in all considered cases. It is also noted that at position T8, the interfering user is at an angle π/4, 1 2 3 4 5 6 7 8 9 10 11 12 13 14 15 Interfering position index 0 1 2 3 4 5 6 R (a) Specular position OPT-NoCSI OPT-NoCSI (Rb) OPT-CT OPT-CSI 1 2 3 4 5 6 7 8 9 10 11 12 13 14 15 Interfering position index 0 2 4 6 8 R (b) Specular position OPT-NoCSI OPT-NoCSI (Rb) OPT-CT OPT-CSI Fig. 4: Rate R in (10) evaluated through simulations consider- ing σ = 0.5 m in the case of Nu = 2, with the intended UE positioned at P0 = 10 \u0000cos π 8 , sin π 8 , 0 \u0001 while the interfer- ing user is positioned at 12 possible different positions, Pi = 10 {cos[π/8 + (i − 1)π/32], sin[π/8 + (i − 1)π/32], 0}, with i = 1, . . . , 12. The case (a) refers to dx = λ 2 , while the case (b) reports the case dx = λ 4 corresponding to the specular position of the RIS with respect to the BS. In this case, it is evident that the CT model fails, as the RIS is optimized without considering the specular component, which in this case produces strong interference. The dashed curve also reports the value of Rb defined in (13), which corresponds to the objective used by the optimizer. It is noted how this value closely approximates the rate R found through simulations in all cases. Finally, it is noted that the optimizer OPT-NoCSI, in many cases, even for relevant position estimation errors, manages to achieve performance reasonably close to the OPT-CSI case, which requires an exact channel estimation and, in any case, provides much better performance than the OPT-CT case, especially in the presence of consistent mutual coupling (i.e., for dx = λ/4), and when the interferer is close to the specular angular position. In the last two figures, namely 7 and 8, we present the scenario where there is only one transmitting node positioned at a distance of 10 m and at all possible angular positions ϕ from 0 to 90 degrees. In this setting, we depict the power received at the BS (in dBW) as a function of the angle ϕ. The RIS is optimized using the OPT-NoCSI and CT approaches for the case Nu = 2, where the central position of the reference 10 1 2 3 4 5 6 7 8 9 10 11 12 13 14 15 Interfering position index 0 1 2 3 4 5 6 R (a) Specular position OPT-NoCSI OPT-NoCSI (Rb) OPT-CT OPT-CSI 1 2 3 4 5 6 7 8 9 10 11 12 13 14 15 Interfering position index 0 2 4 6 8 R (b) Specular position OPT-NoCSI OPT-NoCSI (Rb) OPT-CT OPT-CSI Fig. 5: Rate R in (10) evaluated through simulations considering σ = 1 m for the same setting of Fig. 4. node is P0 = 10 \u0000cos π 8 , sin π 8 , 0 \u0001 , corresponding to an angle of 22.5 degrees, and that of the interfering node is P1 = 10 \u0000cos π 4 , sin π 4 , 0 \u0001 , corresponding to the specular position at 45 degrees. In 7 (a), (b), (c), the cases dx = λ/2 and σ = 0.5, 1, 2 m are depicted, respectively. In 8 (a), (b), (c), the same cases are illustrated for dx = λ/4. The objective of these figures is to showcase the type of beam created by the RIS in the direction of the useful node and its ability to reject interference. The first notable observation is that in the CT case, the interference is not eliminated. This occurs because in this model, structural scattering is not considered, and thus, the interference originating from the direction π/4 is significantly underestimated. Conversely, in the OPT-NoCSI case, the RIS places a null in the direction of the specular component. In both cases, the RIS generates a beam in the direction of the useful signal. However, in the CT case when dx = λ/4, the beam is not centered due to the mismatch of the model, which does not account for mutual couplings. Both the null towards the interferer and the beam towards the intended UE become wider as the uncertainty regarding the possible position of the interferer increases (observe the difference in the beams when transitioning from case (a) to case (c)). This behavior aligns with expectations, as an increase in position uncertainty necessitates ’illuminating’ or ’eliminating’ larger portions of space with the RIS. 1 2 3 4 5 6 7 8 9 10 11 12 13 14 15 Interfering position index 0 1 2 3 4 5 6 R (a) Specular position OPT-NoCSI OPT-NoCSI (Rb) OPT-CT OPT-CSI 1 2 3 4 5 6 7 8 9 10 11 12 13 14 15 Interfering position index 0 2 4 6 8 R (b) Specular position OPT-NoCSI OPT-NoCSI (Rb) OPT-CT OPT-CSI Fig. 6: Rate R in (10) evaluated through simulations considering σ = 2 m for the same setting of Fig. 4. VI. CONCLUSION In this paper, we have addressed the challenge of optimizing Reconfigurable Intelligent Surfaces (RIS) for uplink commu- nication systems in the presence of interfering users with- out relying on Channel State Information (CSI) estimation. Our proposed CSI-free approach leverages a priori statistical knowledge of the channel to maximize the average achievable rate. To account for practical considerations often overlooked in traditional RIS models, we developed a multiport network model that incorporates factors such as mutual coupling among scattering elements and the presence of structural scattering. Through simulations, we have demonstrated the effectiveness of our approach, showing that it can achieve performance levels close to those obtained with perfect CSI in some cases. REFERENCES [1] C. Liaskos and al., “A new wireless communication paradigm through software-controlled metasurfaces,” IEEE Comm. Mag., vol. 56, no. 9, pp. 162–169, Sep. 2018. [2] M. Di Renzo and al., “Smart radio environments empowered by recon- figurable AI meta-surfaces: an idea whose time has come,” EURASIP Journal on Wir. Comm. and Net., vol. 2019, no. 1, p. 129, 2019. [3] Q. Wu and al., “Intelligent reflecting surface aided wireless communi- cations: A tutorial,” IEEE Trans. on Comm., 2021. [4] M. Di Renzo and al., “Smart radio environments empowered by reconfigurable intelligent surfaces: How it works, state of research, and road ahead,” IEEE JSAC, vol. 38, no. 11, pp. 2450–2525, July 2020. 11 0 10 20 30 40 50 60 70 80 90  (deg.) -140 -135 -130 -125 -120 -115 -110 Prx (dBW) (a) Specular position UE position OPT-NoCSI OPT-CT 0 10 20 30 40 50 60 70 80 90  (deg.) -140 -135 -130 -125 -120 -115 -110 Prx (dBW) (b) Specular position UE position OPT-NoCSI OPT-CT 0 10 20 30 40 50 60 70 80 90  (deg.) -140 -135 -130 -125 -120 -115 -110 Prx (dBW) (c) Specular position UE position OPT-NoCSI OPT-CT Fig. 7: Power received at the BS (in dBW) as a function of the angle ϕ of the transmitting node. The RIS characterized by dx = λ/2 and it is optimized using the OPT-NoCSI and CT approaches for the case Nu = 2, where the reference node at an angle of 22.5 degrees, and the interfering node is at 45 degrees (specular direction). [5] Y. Liu and al., “Reconfigurable intelligent surfaces: Principles and opportunities,” arXiv:2007.03435, 2020. [6] M. Di Renzo and al., “Analytical modeling of the path-loss for recon- figurable intelligent surfaces – Anomalous mirror or scatterer ?” 21st Int. Workshop on Signal Proc. Advances in Wir. Comm., May 2020. [7] E. Bj¨ornson, H. Wymeersch, B. Matthiesen, P. Popovski, L. Sanguinetti, and E. de Carvalho, “Reconfigurable intelligent surfaces: A signal processing perspective with wireless applications,” IEEE Signal Process. Mag., vol. 39, no. 2, pp. 135–158, Mar. 2022. [8] X. Wei, D. Shen, and L. Dai, “Channel estimation for ris assisted wireless communications—part i: Fundamentals, solutions, and future opportunities,” IEEE Communications Letters, vol. 25, no. 5, pp. 1398– 1402, 2021. [9] ¨O. T. Demir and E. Bj¨ornson, “Is channel estimation necessary to select phase-shifts for RIS-assisted massive MIMO?” IEEE Trans. Wireless Commun., pp. 1–1, Jun. 2022. [10] ¨O. T. Demir, E. Bj¨ornson, and L. Sanguinetti, “Exploiting array ge- ometry for reduced-subspace channel estimation in RIS-aided commu- nications,” in 2022 IEEE 12th Sensor Array and Multichannel Signal Processing Workshop (SAM), 2022, pp. 455–459. [11] X. Wei, D. Shen, and L. Dai, “Channel estimation for ris assisted wireless communications—part ii: An improved solution based on double-structured sparsity,” IEEE Communications Letters, vol. 25, no. 5, pp. 1403–1407, 2021. [12] G. Zhou, C. Pan, H. Ren, P. Popovski, and A. L. Swindlehurst, “Channel estimation for RIS-aided multiuser millimeter-wave systems,” IEEE Trans. Signal Process., vol. 70, pp. 1478–1492, Mar. 2022. [13] T. L. Jensen and E. De Carvalho, “An optimal channel estimation scheme for intelligent reflecting surfaces based on a minimum variance unbiased estimator,” in ICASSP 2020 - 2020 IEEE International Con- ference on Acoustics, Speech and Signal Processing (ICASSP), 2020, pp. 5000–5004. [14] J. Chen, Y.-C. Liang, H. V. Cheng, and W. Yu, “Channel estimation for reconfigurable intelligent surface aided multi-user mmWave MIMO systems,” IEEE Trans. Wireless Commun., vol. 22, no. 10, pp. 6853– 6869, Oct. 2023. [15] A. de Jesus Torres, L. Sanguinetti, and E. Bj¨ornson, “Electromagnetic 0 10 20 30 40 50 60 70 80 90  (deg.) -140 -135 -130 -125 -120 -115 -110 Prx (dBW) (a) Specular position UE position OPT-NoCSI OPT-CT 0 10 20 30 40 50 60 70 80 90  (deg.) -140 -135 -130 -125 -120 -115 -110 Prx (dBW) (b) Specular position UE position OPT-NoCSI OPT-CT 0 10 20 30 40 50 60 70 80 90  (deg.) -140 -135 -130 -125 -120 -115 -110 Prx (dBW) (c) Specular position UE position OPT-NoCSI OPT-CT Fig. 8: Power received at the BS (in dBW) as a function of the angle ϕ of the transmitting node for dx = λ/4 and the same setting as Fig. 7. interference in RIS-aided communications,” IEEE Wireless Commun. Lett., vol. 11, no. 4, pp. 668–672, Apr. 2022. [16] W.-X. Long, M. Moretti, L. Sanguinetti, and R. Chen, “Channel esti- mation in RIS-aided communications with interference,” IEEE Wireless Commun. Lett., vol. 12, no. 10, pp. 1751–1755, Oct. 2023. [17] A. Abrardo, D. Dardari, M. Di Renzo, “Intelligent Reflecting Surfaces: Sum-Rate Optimization Based on Statistical Position Information,” IEEE Transactions on Communications, vol. 69, no. 10, pp 7121-7136 [18] A. Zappone and al., “Overhead-aware design of reconfigurable intelli- gent surfaces in smart radio environments,” IEEE Trans. on Wireless Comm., Vol. 20, no. 1, pp. 126-141, 2021 [19] M.-M. Zhao, Q. Wu, M.-J. Zhao, and R. Zhang, “Intelligent reflecting surface enhanced wireless networks: Two-timescale beamforming op- timization,” IEEE Transactions on Wireless Communications, vol. 20, no. 1, pp. 2–17, 2021. [20] F. Jiang, A. Abrardo, K. Keykhosravi, H. Wymeersch, D. Dardari, and M. D. Renzo, “Two-timescale transmission design and ris optimization for integrated localization and communications,” IEEE Trans. on Wire- less Comm., vol. 22, no. 12, pp. 8587–8602, April 2023. [21] Q.-U.-A. Nadeem, A. Chaaban, and M. Debbah, “Opportunistic beam- forming using an intelligent reflecting surface without instantaneous CSI,” IEEE Wireless Communications Letters, to appear, 2020. [22] Z. Peng, T. Li, C. Pan, H. Ren, W. Xu, and M. Di Renzo, “Analysis and optimization for IRS-aided multi-pair communications relying on statistical csi,” arXiv:2007.11704, 2020. [23] D. Dardari and D. Massari, “Using metaprisms for performance im- provement in wireless communications,” arXiv:2003.13505, 2020. [24] M. Di Renzo, F. H. Danufane, and S. A. Tretyakov, “Communication models for reconfigurable intelligent surfaces: From surface electromag- netics to wireless networks optimization,” Proc. IEEE, vol. 110, no. 9, pp. 1164–1209, 2022. [25] M. Di Renzo, A. Ahmed, A. Zappone, V. Galdi, G. Gradoni, M. Moccia, and G. Castaldi, “Digital reconfigurable intelligent surfaces: On the im- pact of realistic reradiation models,” CoRR, vol. abs/arXiv:2205.09799, 2022. [26] S. Abeywickrama, R. Zhang, Q. Wu, and C. Yuen, “Intelligent reflecting surface: Practical phase shift model and beamforming optimization,” IEEE Trans. Commun., vol. 68, no. 9, pp. 5849–5863, 2020. [27] M. Di Renzo, A. Mohamed, A. Zappone, G. Gradoni, M. Rossi, 12 M. Moccia, G. Castaldi, and V. Galdi, “Effects of realistic reradia- tion models in digital reconfigurable intelligent surfaces,” Journal of Information and Intelligence, 2023. [28] A. Rafique, N. U. Hassan, M. Zubair, I. H. Naqvi, M. Q. Mehmood, M. Di Renzo, M. Debbah, and C. Yuen, “Reconfigurable intelligent surfaces: Interplay of unit cell and surface-level design and performance under quantifiable benchmarks,” IEEE Open J. Commun. Soc., vol. 4, pp. 1583–1599, 2023. [29] M. T. Ivrlac and J. A. Nossek, “Toward a circuit theory of communi- cation,” IEEE Trans. Circuits Syst. I Regul. Pap., vol. 57-I, no. 7, pp. 1663–1683, 2010. [30] M. Di Renzo, A. Zappone, M. Debbah, M. Alouini, C. Yuen, J. de Rosny, and S. A. Tretyakov, “Smart radio environments empowered by reconfigurable intelligent surfaces: How it works, state of research, and the road ahead,” IEEE J. Sel. Areas Commun., vol. 38, pp. 2450– 2525, 2020. [31] M. Movahediqomi, G. Ptitcyn, and S. Tretyakov, “Comparison between different designs and realizations of anomalous reflectors for extreme deflections,” IEEE Transactions on Antennas and Propagation, pp. 1–1, 2023. [32] Y. Li, X. Ma, X. Wang, G. Ptitcyn, M. Movahediqomi, and S. A. Tretyakov, “Tunable perfect anomalous reflection using passive ape- riodic gratings,” CoRR, vol. abs/arXiv:2303.05411, 2023. [33] M. D. R. G. Gradoni, “End-to-end mutual coupling aware communica- tion model for reconfigurable intelligent surfaces: An electromagnetic- compliant approach based on mutual impedances,” IEEE Wireless Commun. Lett., vol. 10, no. 5, pp. 938–942, May 2021. [34] P. C. Chaumet, “The discrete dipole approximation: A review,” Mathe- matics, vol. 10, no. 17, 2022. [35] R. Faqiri, C. Saigre-Tardif, G. C. Alexandropoulos, N. Shlezinger, M. F. Imani, and P. del Hougne, “Physfad: Physics-based end-to-end channel modeling of ris-parametrized environments with adjustable fading,” IEEE Trans. Wirel. Commun., vol. 22, no. 1, pp. 580–595, 2023. [36] M. D. R. X. Qian, “Mutual coupling and unit cell aware optimization for reconfigurable intelligent surfaces,” IEEE Wireless Commun. Lett., vol. 10, no. 6, pp. 1183–1187, June 2021. [37] H. E. Hassani, X. Qian, S. Jeong, N. S. Perovic, M. D. Renzo, P. Mursia, V. Sciancalepore, and X. Costa-Perez, “Optimization of ris-aided mimo – a mutually coupled loaded wire dipole model,” arXiv, June 2023. [38] N. S. Perovic, L. Tran, M. Di Renzo, and M. F. Flanagan, “Optimization of ris-aided SISO systems based on a mutually coupled loaded wire dipole model,” CoRR, vol. abs/arXiv:2305.12735, 2023. [39] M. Akrout, F. Bellili, A. Mezghani, and J. A. Nossek, “Physically consistent models for intelligent reflective surface-assisted communi- cations under mutual coupling and element size constraint,” CoRR, vol. abs/arXiv:2302.11130, 2022. [40] K. Konno, S. Terranova, Q. Chen, and G. Gradoni, “Generalised impedance model of wireless links assisted by reconfigurable intelligent surfaces,” CoRR, vol. abs/arXiv:2306.03761, 2023. [41] P. Zheng, X. Ma, and T. Y. Al-Naffouri, “On the impact of mutual coupling on ris-assisted channel estimation,” CoRR, vol. abs/arXiv:2309.04990, 2023. [42] S. Shen, B. Clerckx, and R. Murch, “Modeling and architecture design of reconfigurable intelligent surfaces using scattering parameter network analysis,” IEEE Transactions on Wireless Communications, vol. 21, no. 2, pp. 1229–1243, 2022. [43] A. Abrardo, A. Toccafondi, and M. D. Renzo, “Analysis and opti- mization of reconfigurable intelligent surfaces based on s-parameters multiport network theory,” arXiv:2308.16856 [cs.IT], accepted in IEEE EUCAP 2024, August 2023. [44] ——, “Design of reconfigurable intelligent surfaces by using s- parameter multiport network theory – optimization and full-wave vali- dation,” arXiv:2311.06648 [cs.IT], November 2023. [45] W.-X. Long, M. Moretti, A. Abrardo, L. Sanguinetti, and R. Chen, “Mmse design of ris-aided communications,” arXiv:2312.07864 [cs.IT], December 2023. [46] N. S. Perovic and al., “Achievable rate optimization for mimo systems with reconfigurable intelligent surfaces,” arXiv:2008.09563, 2020. [47] T. V. Chien and al., “Reconfigurable intelligent surface-assisted cell-free massive mimo systems over spatially-correlated channels,” https://arxiv.org/pdf/2104.08648.pdf, 2021. [48] O.T.Demir, E. Bjornson, and L. Sanguinetti, “Exploiting array geometry for reduced-subspace channel estimation in ris-aided communications,” 2022 IEEE 12th Sensor Array and Multichannel Signal Processing Workshop, pp. 445–459, 2022. [49] W.-X. Long, M. Moretti, A. Abrardo, L. Sanguinetti, and R. Chen, “Mmse design of ris-aided communications,” arXiv:2312.07864, 2023. [50] B. Hassibi and B. M. Hochwald, “How much training is needed in multiple-antenna wireless links?” IEEE Trans. Inf. Theor., vol. 49, no. 4, pp. 951–963, Apr 2003. [51] M.-M. Zhao, Q. Wu, M.-J. Zhao, and R. Zhang, “Intelligent Reflect- ing Surface Enhanced Wireless Network: Two-timescale Beamforming Optimization,” arXiv e-prints, Dec. 2019. [52] M. McKay and I. Collings, “General capacity bounds for spatially correlated rician mimo channels,” IEEE Transactions on Information Theory, vol. 51, no. 9, pp. 3121–3145, 2005. [53] ¨O. T. Demir, E. Bj¨ornson, and L. Sanguinetti, “Channel modeling and channel estimation for holographic massive MIMO with planar arrays,” IEEE Wireless Commun. Lett., vol. 11, no. 5, pp. 997–1001, May 2022. [54] E. Bj¨ornson and L. Sanguinetti, “Rayleigh fading modeling and chan- nel hardening for reconfigurable intelligent surfaces,” IEEE Wireless Commun. Lett., vol. 10, no. 4, pp. 830–834, Apr. 2021. "
}