{
    "optim": "Prepared for submission to JCAP\nOptimization of foreground moment\ndeprojection for semi-blind CMB\npolarization reconstruction\nA. Carones,a,b M. Remazeillesc\naDipartimento di Fisica, Universit`a di Roma “Tor Vergata”, via della Ricerca Scientifica 1, I-00133,\nRoma, Italy\nbSezione INFN Roma 2, via della Ricerca Scientifica 1, I-00133, Roma, Italy\ncInstituto de F´ısica de Cantabria (CSIC-UC), Avda. los Castros s/n, 39005 Santander, Spain\nE-mail: alessandro.carones@roma2.infn.it, remazeilles@ifca.unican.es\nAbstract. Upcoming Cosmic Microwave Background (CMB) experiments, aimed at measuring pri-\nmordial CMB polarization B-modes, require exquisite control of instrumental systematics and Galac-\ntic foreground contamination. Blind minimum-variance techniques, like the Needlet Internal Linear\nCombination (NILC), have proven effective in reconstructing the CMB polarization signal and mit-\nigating foregrounds and systematics across diverse sky models without suffering from foreground\nmismodelling errors. Still, residual foreground contamination from NILC may bias the recovered\nCMB polarization at large angular scales when confronted with the most complex foreground sce-\nnarios. By adding constraints to NILC to deproject statistical moments of the Galactic emission, the\nConstrained Moment ILC (cMILC) method has been demonstrated to further enhance foreground\nsubtraction, albeit with an associated increase in overall noise variance. Faced with this trade-off be-\ntween foreground bias reduction and overall variance minimization, there is still no recipe on which\nmoments to deproject and which are better suited for blind variance minimization. To address this,\nwe introduce the optimized cMILC (ocMILC) pipeline, which performs full automated optimization\nof the required number and set of foreground moments to deproject, pivot parameter values, and de-\nprojection coefficients across the sky and angular scales, depending on the actual sky complexity,\navailable frequency coverage, and experiment sensitivity. The optimal number of moments for de-\nprojection, before paying significant noise penalty, is determined through a data diagnosis inspired by\nthe Generalized NILC (GNILC) method. Validated on B-mode simulations of the PICO space mis-\nsion concept with four challenging foreground models, ocMILC exhibits lower Galactic foreground\ncontamination compared to NILC and cMILC at all angular scales, with limited noise penalty. This\nmulti-layer optimization enables the ocMILC pipeline to achieve unbiased posteriors of the tensor-\nto-scalar ratio, regardless of foreground complexity.\nKeywords: CMBR polarization – CMBR experiments\narXiv:2402.17579v1  [astro-ph.CO]  27 Feb 2024\nContents\n1\nIntroduction\n1\n2\nSky simulations\n3\n3\nDiagnosis of foreground complexity with GNILC\n5\n3.1\nMethodology\n5\n3.2\nNeedlet frame implementation\n7\n3.3\nDiagnostic maps\n8\n4\nThe optimized cMILC (ocMILC) method\n10\n4.1\nBaseline cMILC approach\n10\n4.2\nOptimization of moment deprojection\n15\n5\nDiscussion\n22\n6\nConclusions\n25\nA Results for PICO CBE sensitivities\n26\n1\nIntroduction\nAccurate measurements of the temperature anisotropies of the Cosmic Microwave Background (CMB)\nhave yielded stringent constraints on viable cosmological models [1, 2]. Future CMB experiments,\nfeaturing enhanced sensitivity, will provide additional insights into CMB polarization anisotropies\n[3–6]. On the one hand, an accurate reconstruction of the CMB E-mode polarization anisotropies\nwill lead to a cosmic-variance limited measurement of the optical depth to last scattering surface τ\n[5, 6], providing new constraints on the cosmic reionization history [7, 8] and the sum of neutrino\nmasses [3, 9, 10]. On the other hand, a detection of the primordial CMB B-mode polarization may\nopen a new window on the physics of the early Universe by setting constraints on the tensor-to-scalar\nratio r, thereby shedding light on the cosmic inflation scenario [11].\nTo achieve these goals, future CMB experiments require exquisite control of the contamination\nfrom Galactic foregrounds and instrumental systematics. In recent years, several component sep-\naration pipelines, both parametric [12–17] and blind [18–24], have been developed or customized\nfor this purpose. Given the huge amplitude discrepancy between Galactic foregrounds and CMB\nB-modes, these pipelines need to demonstrate robustness against the complex and unknown proper-\nties of Galactic foreground emissions, including spatial variations in their spectral energy distribution\n(SED) along and across the lines of sight [25], as well as resulting foreground spectral distortions\n[26] and spectral decorrelation [27].\nParametric component separation methods are engineered to yield minimal uncertainty in the\nretrieval of CMB B-modes, as long as the assumed parametric foreground model aligns with the actual\nforegrounds in the data. However, given the aforementioned intricacies in the foreground properties,\nparametric methods are also prone to potential biases in the recovery of the CMB B-mode signal\nwhen confronted with incorrect or incomplete modelling of poorly understood foregrounds [28]. In\ncontrast, blind minimum-variance approaches to component separation, like the Needlet Internal Lin-\near Combination (NILC) method [21], offer the possibility of extracting the CMB polarization E- and\n– 1 –\nB-mode fields from multifrequency data without making any assumption about the foregrounds, thus\navoiding mismodelling errors. However, if the polarized Galactic foregrounds turn out to be highly\ncomplex, as in the case of multi-layer contributions to thermal dust emission along the line-of-sight\nand spectral decorrelation [29], minimum-variance methods like NILC may return CMB polariza-\ntion maps that are still significantly contaminated by Galactic foreground residuals, as highlighted in\n[23, 24, 30].\nTo overcome these issues, intermediate approaches at the intersection of parametric and blind\nmethods can be pursued, using either partial information on Galactic foregrounds or some effective\nmodelling. For instance, information on the spatial variations of the foregrounds across the sky\ncan be inferred from the data and exploited to optimize the domains over which the NILC variance\nis minimized, as implemented in the Multi-Clustering NILC method [24]. As an alternative semi-\nblind approach, the Constrained Moment ILC (cMILC) method [23] relies on effective foreground\nmodelling through statistical moment expansion around fixed pivot spectral parameters to project\nout some of these moments through nulling constraints added to NILC, while leaving higher-order\nmoments and unmodelled foregrounds for blind variance minimization. Through nulling constraints\nfor moment deprojection, the cMILC method facilitates the handling of foreground moments and\nSED distortions resulting from line-of-sight and beam averaging of spatial variations in foreground\nspectral properties by CMB instruments. In addition, it allows for imperfect parameterization of\nthe foregrounds by leaving any higher-order correction to the moment expansion or any omitted\nforeground to blind variance minimization. This semi-blind technique has proven more effective\nthan NILC in reducing Galactic contamination in the recovered CMB B-mode map when applied to\ncomplex foreground simulations of future CMB satellite experiments such as LiteBIRD and PICO\n[23, 31].\nHowever, the reduction of the residual foreground contamination bias in the cMILC CMB solu-\ntion is counterbalanced by an increase of the overall variance associated with instrumental noise and\nunconstrained foreground moments, since each additional nulling constraint in cMILC effectively re-\nduces the number of frequency channels available for variance minimization. Faced with this trade-off\nbetween bias reduction and variance increase, certain foreground moments may be more conducive\nto variance minimization than deprojection, particularly when they exert a dominant influence on\nthe overall variance in the data, while other subdominant moments may be better addressed through\ndeprojection. However, no recipe for determining which moments to deproject and which to retain\nfor variance minimization has been provided thus far. In the baseline cMILC approach, the depro-\njection of zeroth-order moments is prioritized, anticipating their significant contribution to the bulk\nof Galactic foreground emission. Nonetheless, the optimal solution might favour the deprojection of\nhigher-order components, relegating dominant moments to blind variance minimization. Moreover,\nif the actual SED of polarized thermal dust and synchrotron emissions significantly deviates from\nthe prevalent parameterization of a single modified blackbody (MBB) and a power-law, respectively,\nthen the deprojection of SED moments with fixed values of pivot spectral parameters across the sky\nand angular scales may prove less effective.\nIn this work, we introduce the optimized cMILC (ocMILC) pipeline, where the choice of mo-\nments to deproject, the values of pivot parameters, and the amount of deprojection of each moment\nis optimized through a fully data-driven approach. Specifically, the optimal number of moments to\ndeproject before paying significant noise penalty is determined depending on the experimental config-\nuration by applying the strategy of the Generalized Needlet ILC (GNILC) method [32]. This method\nprovides a blind diagnosis of the actual complexity of the Galactic foreground emission across the sky\nand angular scales, yielding maps of the local number of independent foreground degrees of freedom\nas byproducts. Such a diagnostic tool is valuable for informing the foreground model parameter-\n– 2 –\nization and tuning component separation pipelines according to the observed sky complexity and\nexperimental configuration. The new ocMILC framework is tested and validated on a set of complex\nforeground scenarios using comprehensive simulations of the Probe of Inflation and Cosmic Origins\n(PICO) mission concept [6]. We choose this experimental configuration as a proof of concept, given\nits high sensitivity and broad frequency coverage, allowing us to thoroughly assess the robustness of\nthe proposed approach against various thermal dust and synchrotron models.\nThe paper is organized as follows: In Section 2, we provide a description of the PICO sky\nsimulations involving four different foreground models. Section 3 outlines our strategy, inspired by\nGNILC, for conducting a data-driven diagnosis of foreground complexity. Based on this diagnos-\ntic, Section 4 introduces the ocMILC pipeline for optimizing foreground moment deprojection and\npresents the results for different Galactic dust scenarios. Section 5 explores the application of the\nocMILC methodology when incorporating various polarized synchrotron and anomalous microwave\nemission (AME) models. Our conclusions are summarized in Section 6.\n2\nSky simulations\nAs a proof of concept, we perform simulations of multifrequency sky maps based on the experimental\nsetup of the PICO mission. PICO, a NASA probe-scale space mission concept, is anticipated to be\nthe most sensitive among the proposed next-generation CMB space missions, targeting a sensitivity\non the tensor-to-scalar ratio of r ≤ 0.0002 at a 95% confidence level (CL) and aiming for a cosmic-\nvariance limited measurement of the optical depth to last scattering, σ(τ) = 0.002 [6]. To meet\nthese objectives, PICO will conduct full-sky observations in 21 frequency channels spanning from\n21 to 799 GHz with high signal-to-noise to disentangle Galactic foreground emission from the CMB\npolarization signal. Given its extensive frequency coverage and high sensitivity, PICO serves as an\nideal experimental framework to assess the robustness and flexibility of the proposed optimization of\nmoment deprojection across various thermal dust and synchrotron models.\nThe PICO sky maps are generated by co-adding simulated maps of CMB, Galactic foregrounds,\nand instrumental noise across the 21 frequency bands, according to the instrument specifications\nreported in [6].\nCMB polarization anisotropies are generated using the HEALPix Python package1 [33, 34],\nbased on the CMB angular power spectra of the Planck 2018 best-fit parameters [35] with a tensor-\nto-scalar ratio r = 0, and include the contribution from the gravitational lensing effect.\nThe instrumental noise is simulated as white and isotropic Gaussian realizations, with standard\ndeviations in each pixel corresponding to the polarization sensitivities of the baseline PICO configu-\nration as reported in [6]. The combined noise level for this configuration is equal to 0.87 µK · arcmin.\nIn [6, 30], it has been demonstrated that the targeted sensitivity r < 0.0002 (95% CL) can be achieved\nfor most foreground scenarios with the so-called Current Best Estimate (CBE) PICO configuration,\nfeaturing a combined noise level of 0.61 µK·arcmin. However, for the purpose of our study relying on\nthe more conservative baseline PICO configuration, with a combined noise level of 0.87 µK · arcmin,\nwe estimate a target sensitivity of about r < (0.87)2/(0.61)2 × 0.0002 = 0.0004 (95% CL). Here, the\nnoise levels are squared, as the tensor-to-scalar ratio parameter is associated with power spectrum\nrather than map noise. In Appendix A, we show that, by adopting the CBE PICO configuration, we\ncan indeed achieve r < 0.0002 (95% CL) with the ocMILC method.\nMaps of polarized Galactic emission are generated using the PySM Python package [36, 37].\nGiven the current lack of knowledge about the polarized Galactic emission at the targeted sensitivity,\nwe explore a range of foreground sky models that remain consistent with existing observations. Four\n1https://github.com/healpy/healpy\n– 3 –\ndistinct models of Galactic thermal dust emission are examined in this study and are described below,\nusing the terminology of the PySM:\n• d1: The thermal dust emission at each line-of-sight ˆn and each frequency ν is characterized by\na modified blackbody (MBB) SED in intensity units\nXd(ˆn, ν) = Xd(ˆn, νd)\n ν\nνd\n!βd(ˆn) Bν (Td(ˆn))\nBνd(Td (ˆn)) ,\n(2.1)\nwhere X = {Q, U} are Stokes parameters, Bν(T) is the blackbody spectrum, βd is the dust spec-\ntral index, Td is the dust temperature, and Xd(ˆn, νd) represents the dust template at a reference\nfrequency νd. Both βd and Td vary across the sky, as estimated from the Planck data analysis\nusing the Commander algorithm [38]. The thermal dust template is given by the Commander\ndust Q and U maps at 353 GHz of the Planck 2015 data release, smoothed with a Gaussian\nbeam of full width at half maximum (FWHM) 2.6◦, with stochastic small-scale fluctuations\nadded via the procedure described in [36].\n• d4: In this model, the thermal dust emission is composed of two distinct MBB components,\nas fitted to Planck and DIRBE/IRAS data in [39]. The temperatures of these two components\nvary across the sky, while the spectral indices remain constant with values β(1)\nd\n= 1.63 and\nβ(2)\nd\n= 2.82. The Q and U templates at the reference frequency are obtained by scaling the dust\nintensity templates of [39] to 353 GHz and applying the polarization fraction and polarization\nangles of the d1 model. Gaussian small-scale fluctuations are generated similarly to the d1\nmodel.\n• d7: Simulations of thermal dust emission are based on a physical model of dust grains with a\ndistribution of sizes, composition, and temperatures. Additionally, an environmental radiation\nstrength field is assumed across the sky based on the dust temperature map obtained in [38].\nThe model also accounts for magnetic dipole radiation from iron grains [40], resulting in a\nSED that deviates from a simple MBB spectrum.\n• d12: In this model, the dust emission is composed of six distinct emitting layers [29], so that\nthe effective SED varies not only across the sky but also along the line-of-sight, leading to\nspectral decorrelation across frequencies. It represents the most complex dust model among\nthe four considered in this study. Specifically, the maps of Stokes parameters at a frequency ν\nare given by the superposition of six templates scaled with a MBB law, each associated with a\ndifferent map of spectral indices and temperatures:\nXd(ˆn, ν) =\n6\nX\nk=1\nX(k)\nd (ˆn, ν0)\n ν\nν0\n!β(k)\nd (ˆn)\nBν\n\u0010\nT (k)\nd (ˆn)\n\u0011\n,\n(2.2)\nsuch that it matches the total dust emission of the Planck GNILC intensity and polarization\nmaps at 353 GHz [41].\nGalactic synchrotron emission is simulated using the PySM s1 model, which assumes a power-\nlaw SED in brightness temperature units [42]\nXs(ˆn, ν) = Xs(ˆn, νs)\n ν\nνs\n!βs(ˆn)\n,\n(2.3)\n– 4 –\nwhere βs is the synchrotron spectral index, varying with the position ˆn in the sky. Xs(ˆn, νs) represents\nthe synchrotron template at a reference frequency νs. The chosen templates are the WMAP 9-year 23-\nGHz Q and U maps [43], smoothed with a Gaussian kernel of FWHM 5◦, with small-scale fluctuations\nadded using the procedure outlined in [36]. The synchrotron spectral index map is derived through a\nspectral fit to the Haslam 408-MHz data and the WMAP 23-GHz 7-year data [44].\nIn summary, four distinct PICO data sets, hereafter referred to as d1, d4, d7, and d12, are\ncreated by combining the respective dust model maps with the PySM s1 synchrotron maps and the\nrandom realizations of CMB and instrumental noise. For each data set, 50 simulations are generated,\neach featuring distinct realizations of CMB and instrumental noise. All maps are generated at the\nHEALPix resolution Nside = 512, and the resulting PICO frequency maps are smoothed to a common\nresolution of FWHM = 38′ before undergoing component separation analysis.\n3\nDiagnosis of foreground complexity with GNILC\nThe complex properties of the polarized Galactic foregrounds at microwave frequencies are not yet\nfully understood at the anticipated sensitivity levels of future CMB experiments. It has also been\nshown that any slight mismodelling of the foregrounds can strongly bias the estimated tensor-to-\nscalar ratio due to huge amplitude discrepancies between foregrounds and CMB B-modes [28]. Fur-\nthermore, the integration of foreground emission along the line-of-sight and within the beam by CMB\ninstruments leads to spatial averaging of each foreground spectral parameter, which results in spec-\ntral distortions of the expected foreground SEDs [26, 45] and spectral decorrelation of the foreground\nemission across frequencies [25, 27]. Additional spectral averaging occurs during data processing\nsteps such as spherical harmonic transforms. All these processes effectively augment the list of ex-\npected foreground parameters, adding further complexity to the modelling of the foregrounds. While\nthese effects are small compared to the amplitude of the foreground emission, they can be large com-\npared to the amplitude of the primordial CMB B-mode polarization, hence can no longer be neglected\nfor accurate component separation.\nTo avoid making incorrect assumptions about the number of foregrounds and their spectral\nproperties, it is useful to adopt a data-driven approach which can inform us on the actual complexity\nof foregrounds in sky observations. The Generalized Needlet ILC (GNILC) method [32, 46] of-\nfers an avenue, by providing maps of the effective number of independent foreground components\nacross the sky and different angular scales as byproducts, based on the experiment’s sensitivity and\nfrequency coverage. These GNILC byproduct maps, revealing the effective dimension of the fore-\nground subspace, can in turn inform the Constrained Moment ILC (cMILC) method [23] about the\noptimal number of nulling constraints or moments to deproject without incurring significant noise\npenalty, depending on the sky area and the range of angular scales. Besides, parametric component\nseparation methods may also benefit from these diagnostic maps to gauge the expected volume of the\nforeground parameter space depending on the sky regions.\n3.1\nMethodology\nInstead of making spectral assumptions, GNILC relies on statistical decorrelation to estimate the\nnumber of independent foreground degrees of freedom and perform component separation. It cap-\nitalizes on the fact that while the noise is largely uncorrelated across frequencies, the foreground\nemission, fν(ˆn), remains strongly correlated, such that it can be decomposed, at any frequency ν, onto\na common basis of a few independent templates {ti(ˆn)}i∈[1,m]:\nfν(ˆn) =\nm\nX\ni=1\nαν,i(ˆn) ti(ˆn) ,\n(3.1)\n– 5 –\nwhere the number m of independent templates is typically smaller than the number of frequency\nchannels. The effective number m of these independent templates may vary depending on local\nsignal-to-noise variations across the sky and angular scales. The focus is on mapping this number m\nrather than the templates themselves to provide insight into the complexity of the foreground sky.\nIn polarization, we can assume that data at different frequencies, dν, are the superposition of\nthree distinct types of components:\ndν(ˆn) = c(ˆn) + fν(ˆn) + nν(ˆn) ,\n(3.2)\nwhere (assuming CMB temperature units) c(ˆn) denotes frequency-independent CMB anisotropies,\nfν(ˆn) is the Galactic foreground emission, nν(ˆn) the instrumental noise, and ν = 1, . . . , Nν, with Nν\nthe number of available frequency channels. From Equation 3.2, the elements of the Nν × Nν data\ncovariance matrix for frequency pairs (ν, ν′) read as\nCνν′(ˆn) = ⟨dν(ˆn) dν′(ˆn)⟩ = CCMB\nνν′\n(ˆn) + Fνν′(ˆn) + Nνν′(ˆn) ,\n(3.3)\nwhere CCMB, F, and N denote respectively the CMB, foreground, and noise covariance matrices. In\nEquation 3.3 we fairly assume that the three components are statistically uncorrelated. In practice,\nthe ensemble average of Equation 3.3 is substituted with a sample average:\nCνν′(ˆn) =\nX\nˆn′\nW \u0000ˆn, ˆn′\u0001 dν\n\u0000ˆn′\u0001 dν′ \u0000ˆn′\u0001 ,\n(3.4)\nwhere W (ˆn, ˆn′) are the weights associated to a Gaussian convolution kernel centred at ˆn, with a\nstandard deviation large enough to sample an adequate number of modes.\nConsidering that our focus is on Galactic foregrounds, we rewrite Equation 3.3 as\nC(ˆn) = F(ˆn) + CN(ˆn) ,\n(3.5)\nwhere CN is the nuisance covariance matrix collecting the contribution from CMB and instrumental\nnoise covariance matrices.\nUnlike the foreground covariance matrix, the nuisance covariance matrix can be estimated from\nsimulations based on the knowledge of the instrument and the CMB statistics. The estimated nuisance\ncovariance matrix, ˆCN(ˆn), is then used as an input of the GNILC pipeline to compute the whitened\ndata covariance matrix:\n˜C(ˆn) =\n\u0010 ˆC−1/2\nN\nC ˆC−1/2\nN\n\u0011\n(ˆn) ≃\n\u0010 ˆC−1/2\nN\nF ˆC−1/2\nN\n\u0011\n(ˆn) + 1 ,\n(3.6)\nwhere the last equality follows from Equation 3.5 and is exact if the estimated nuisance covariance\nmatrix perfectly captures the statistics of the CMB and noise components, and 1 denotes the identity\nmatrix.\nTherefore, the eigendecomposition and diagonalization of the whitened data covariance matrix\nmust have the following structure:\n˜C(ˆn) ≃\n\u0010\nUF(ˆn) | UN(ˆn)\n\u0011\n\nλ1(ˆn) + 1\n...\nλm(ˆn)(ˆn) + 1\n1\n...\n1\n\n UF(ˆn)T\nUN(ˆn)T\n!\n,\n(3.7)\n– 6 –\nwhere all eigenvalues significantly greater than one correspond to the independent eigenmodes of\nthe Galactic emission which locally dominate over the variance of the noise and CMB components.\nTherefore, in each point of the sky ˆn, we are able to estimate the number of independent Galac-\ntic foreground modes, m(ˆn), given the sensitivity of the considered experiment through this model-\nindependent approach where we only need to assume the two-point statistics of the noise and CMB\ncomponents in the polarization data. The m independent foreground eigenmodes are simply collected\nin the Nν × m matrix UF.\nWe note that, in the above treatment, we considered the CMB as a nuisance whose covariance\nmatrix can be predicted. This may not be exactly the case at large angular scales for CMB B-modes\nsince the value of the tensor-to-scalar ratio r is unknown. However, this issue can be addressed by\nconsidering only the noise in the nuisance covariance matrix (CN = N), in which case our method\noutputs the number of independent modes from both foregrounds and CMB that dominate over the\nnoise:\nm(ˆn) = mfgds(ˆn) + mCMB(ˆn) ,\n(3.8)\nwith mCMB(ˆn) = 0 or 1, as the CMB is fully correlated between frequencies. Given the sensitivity of\nfuture CMB experiments, we expect the lensing CMB B mode signal to dominate over instrumental\nnoise across the range of observed angular scales (see e.g. figure 1 of [30]). Therefore,\nm(ˆn) = mfgds(ˆn) + 1 .\n(3.9)\nThe GNILC approach thus allows one to perform a blind diagnosis of the complexity of the Galactic\nforeground emission in the observed sky and to possibly compare it with that expected from various\nforeground models.\n3.2\nNeedlet frame implementation\nWe expect the ’foregrounds-to-noise’ ratio, as traced by the whitened covariance matrix ˜C(ˆn) (Equa-\ntions 3.6 and 3.7), to vary not only across the sky but also across angular scales. Most likely, mfgds\nwill be higher at large angular scales where diffuse Galactic emission is brighter than CMB and noise\nby orders of magnitude, while it will be lower at small angular scales where the noise dominates the\ncovariance budget. This reasoning supports an implementation of our diagnostic tool in wavelet do-\nmain. The GNILC pipeline has been developed in a framework of specific spherical wavelets called\nneedlets [47, 48]. In such a framework, the data dν(ˆn) are convolved by a set of needlet bandpass\nfilters in harmonic domain in order to form needlet coefficient maps, βj\nν(ˆn), including sky emission\nfrom specific ranges of angular scales:\nβ j\nν(ˆn) =\nX\nℓ,m\n\u0010\naℓm,ν bj\nℓ\n\u0011\nYℓm(ˆn) ,\n(3.10)\nwhere aℓm,ν are the spherical harmonic coefficients of the frequency maps dν(ˆn), b j\nℓ is the jth needlet\nbandpass, and Yℓm(ˆn) are spherical harmonics.\nIn this work, we employ cosine-shaped needlet bandpasses defined as\nbj\nℓ =\n\ncos\n \nℓ j\npeak − ℓ\nℓ j\npeak − ℓ j−1\npeak\nπ\n2\n!\nif ℓ j−1\npeak ≤ ℓ < ℓ j\npeak\ncos\n \nℓ − ℓ j\npeak\nℓ j+1\npeak − ℓ j\npeak\nπ\n2\n!\nif ℓ j\npeak ≤ ℓ < ℓ j+1\npeak\n,\n(3.11)\n– 7 –\n3\n5\n10\n50\n100\n200\n500\n0.0\n0.2\n0.4\n0.6\n0.8\n1.0\nbj\nFigure 1. Cosine needlet bandpass windows in harmonic domain used in this work.\nwhere ℓpeak = 0, 50, 100, 200, 300 for j = 1, . . . , 5. These needlet bandpasses in harmonic domain are\nplotted in Figure 1, with each of them covering a specific range of multipoles. By construction, these\nneedlet bands satisfy P\nj(bj\nℓ)2 = 1 for all multipoles, so that the inverse needlet transform\ndν(ˆn) =\nX\nj\nX\nℓ,m\nb j\nℓ\n\u0010\naℓm,ν bj\nℓ\n\u0011\nYℓm(ˆn)\n(3.12)\nretrieves the initial data. Since the needlet bands have compact support in harmonic domain, the\nneedlet coefficient maps, β j\nν(ˆn), are obtained at a HEALPix Nside equal to the smallest power of 2\nlarger than ℓ j\nmax/2, where ℓ j\nmax is the maximum multipole of the jth needlet band.\nThe methodology presented above is applied to the multifrequency needlet coefficient maps,\nβ j\nν(ˆn), instead of the original sky maps, dν(ˆn). The data and nuisance covariance matrices, C j(ˆn) and\nC j\nN(ˆn) of Equation 3.5, are thus computed separately for each range of angular scales selected by\nthe needlet bands. This implementation allows us to produce maps of the number of independent\nforeground modes, m j\nfgds(ˆn), across the sky and in different ranges of angular scales.\n3.3\nDiagnostic maps\nWe perform our GNILC diagnosis on the simulated PICO d1, d4, d7, and d12 data sets, each rep-\nresenting different foreground scenarios detailed in Section 2. In this analysis, the CMB signal is\nconsidered part of the nuisance budget of GNILC, allowing us to estimate the number, mfgds, of in-\ndependent degrees of freedom associated with Galactic emission detectable by a telescope like PICO\nfor each foreground scenario. We perform this diagnosis for both E- and B-modes, presenting results\nfor the baseline realization nsim = 0, although similar conclusions can be drawn for other realizations.\n– 8 –\nmfgds\nd1s1 (E)\n1\n5\nmfgds\nd1s1 (B)\n1\n5\nmfgds\nd4s1 (E)\n1\n5\nmfgds\nd4s1 (B)\n1\n5\nmfgds\nd7s1 (E)\n1\n5\nmfgds\nd7s1 (B)\n1\n5\nmfgds\nd12s1 (E)\n1\n5\nmfgds\nd12s1 (B)\n1\n5\nFigure 2. Maps of the detected number, m j\nfgds, of independent foreground E-mode components (left) and B-\nmode components (right) at needlet scale j = 5. The results are shown for four distinct foreground scenarios,\nd1 (first row), d4 (second row), d7 (third row), and d12 (fourth row), and they reveal varying degrees of\ncomplexity. These diagnostic maps, which partition the sky into clusters of uniform foreground complexity,\nwere generated using the GNILC methodology outlined in Section 3, applied to full-sky frequency maps of\nPICO E- and B-modes.\n– 9 –\nMaps of m j\nfgds(ˆn) for the fifth needlet scale (j = 5) are shown in Figure 2 for the four distinct\ndata sets (d1, d4, d7, and d12). They provide the effective number of independent foreground com-\nponents detected across the sky in both in E- and B mode fields at this scale, thereby partitioning the\nsky into clusters of uniform foreground complexity. These diagnostic maps reveal different degrees\nof complexity across the sky depending on the underlying foreground scenario, even though all con-\nsidered foreground models are consistent with Planck observations. In particular, d12 and d1 models\nexhibit a larger number of independent foreground modes detected across more extensive sky regions\ncompared to d4 and d7 models, with indications of higher complexity for d12. These results hold\nfor both E- and B-modes. The effective lower complexity of d4 with two MBB components for dust\ncompared to the single-MBB d1 model, is attributed to the absence of spatial variations of each MBB\nspectral index in d4. The highest level of complexity detected for d12 can be attributed to the multi-\nlayer structure of the dust emission in this model. Therefore, with high polarization sensitivity, as in\nthe case of PICO, our approach offers a reliable tool for discriminating between different foreground\nmodels. Moreover, the observed decrease in the effective number of independent foreground modes\ntowards high Galactic latitudes aligns with the spatial extent of Galactic emission in the sky and the\nprevalence of noise in the data at these latitudes. In E-modes, we also observe larger values of mfgds\nthan in B-modes over larger regions of the sky. This discrepancy arises from the foreground E/B\nratio, which exceeds 2. However, this trend is partially compensated by the even higher CMB E/B\nratio, mitigating the discrepancy between E- and B-modes concerning the number of independent\nforeground modes.\nIn Table 1 we report the excursion set of mfgds observed in the four PICO data sets at the five\ndifferent needlet scales. For each value, the corresponding sky fraction is also reported in parenthe-\nses. As expected, the effective number of independent degrees of freedom of the Galactic emission\ndecreases towards smaller angular scales, where the foreground power decreases while the CMB and\nnoise have relatively larger power. Differences among the four data sets are noticeable. The d1 and\nd12 data sets exhibit larger values of mfgds at the largest angular scales and over larger portions of the\nsky at intermediate and small angular scales, both in E- and B-modes. Compared to other data sets,\nthe d12 data set, which incorporates multilayer dust emission, exhibits higher complexity in broader\nregions of the sky for all needlet scales. Again, in general, higher values of mfgds are found on larger\nportions of the sky for E-modes.\nBy diagnosing the number of independent modes of the Galactic foreground emission above the\nnoise level, the blind approach outlined in this section can be leveraged to enhance the optimization\nof CMB component separation. In the following, we exploit this information to optimize the selection\nof deprojected moments for the Galactic foregrounds within the framework of the semi-blind cMILC\ncomponent separation method. Besides, the distribution of mfgds values has the potential to inform\nparametric component separation methods on the expected dimension of the parameter space for the\nforeground model to be fitted in specific sky regions and at particular angular scales, minimizing the\nimpact of significant statistical uncertainty in the reconstructed maps of different components.\n4\nThe optimized cMILC (ocMILC) method\n4.1\nBaseline cMILC approach\nAs demonstrated in [23], although the blind NILC method provides the CMB solution with mini-\nmum overall variance, it does not achieve minimum foreground variance. This minimum foreground\nvariance can be attained through the more constrained semi-blind cMILC method, which involves the\ndeprojection of certain foreground components. Achieving minimum foreground variance is essential\nto alleviate systematic biases in the recovered tensor-to-scalar ratio, especially in cases where residual\n– 10 –\nTable 1. Number mfgds of independent modes characterizing Galactic foreground emission, as de-\ntected by GNILC within each needlet band, for the PICO baseline configuration and four distinct\nforeground scenarios. The results are presented separately for E-modes (top table) and B-modes\n(bottom table). In cases where multiple values are observed, the corresponding sky fraction (in per-\ncentage) associated with each value of mfgds is provided in parentheses.\nE-modes\nModel\nmfgds (fsky(%))\nj = 1\nj = 2\nj = 3\nj = 4\nj = 5\nd1s1\n6\n5 (97), 6 (3)\n3 (3), 4 (81), 5 (16)\n3 (36.8), 4 (63), 5 (0.2)\n1 (0.5), 2 (30.3), 3 (46.2), 4 (23)\nd4s1\n5\n4 (1.2), 5 (98.8)\n3 (54), 4 (31), 5 (15)\n3 (82), 4 (18)\n1 (2), 2 (30), 3 (63), 4 (5)\nd7s1\n5\n5\n3 (13), 4 (71), 5 (16)\n3 (62), 4 (37.9), 5 (0.1)\n2 (31.3), 3 (67), 4 (1.7)\nd12s1\n6\n5 (11), 6 (89)\n4 (70), 5 (26), 6 (4)\n3 (18), 4 (80), 5 (3)\n1 (1), 2 (27.8), 3 (26.5), 4 (44.5), 5 (0.2)\nB-modes\nModel\nmfgds (fsky(%))\nj = 1\nj = 2\nj = 3\nj = 4\nj = 5\nd1s1\n6\n4 (13), 5 (87)\n3 (4), 4 (95), 5 (1)\n2 (11.5), 3 (28), 4 (60.5)\n1 (0.7), 2 (68), 3 (16.3), 4 (15)\nd4s1\n5\n4 (16), 5 (84)\n3 (59), 4 (40), 5 (1)\n2 (12), 3 (72), 4 (16)\n1 (3), 2 (67), 3 (25.5), 4 (4.5)\nd7s1\n5\n4 (13), 5 (87)\n3 (17), 4 (82), 5 (1)\n2 (12), 3 (53), 4 (35)\n2 (71.5), 3 (27), 4 (1.5)\nd12s1\n6 (82), 7 (18)\n5 (17), 6 (83)\n4 (77), 5 (23)\n2 (9), 3 (15.3), 4 (75), 5 (0.7)\n1 (2), 2 (51), 3 (20.4), 4 (26.6)\nforeground contamination after component separation surpasses the CMB and noise power at large\nangular scales. Such unfavourable outcome was observed in the case of NILC for the multi-layer dust\nscenario with PICO [30] and for less complex foreground skies in experimental configurations with\nnarrower frequency coverage [31].\nGalactic emission exhibits three-dimensional characteristics [25], extending along the line of\nsight, and its spectral parameters vary spatially both along and across the lines of sight. When in-\ntegrated along the line of sight and within the instrumental beam by CMB instruments, the super-\nposition of emitting elements with varying spectral parameters results in spectral distortions of the\nbaseline SEDs of the Galactic components. As demonstrated in the seminal work of [26], these fore-\nground distortions can be accurately captured through a Taylor moment expansion of the baseline\nSEDs around pivot values of the spectral parameters. Foreground subtraction can then be enhanced\nby deprojecting certain moments of the Galactic foreground emission from the output CMB solution,\na technique introduced by the cMILC method [23].\nReferring to Equation 2.3, the Galactic synchrotron emission can be expanded around a baseline\npower-law SED up to second order in βs(ˆn) as:\nXs(ˆn, ν) = Xs(ˆn, νs)\n\"\nfsync(ν, ¯βs) +\n\u0010\nβs(ˆn) − ¯βs\n\u0011\n∂βs fsync(ν, ¯βs)\n+ 1\n2\n\u0010\nβs(ˆn) − ¯βs\n\u00112 ∂2\nβs fsync(ν, ¯βs) + O\n\u0012\u0010\nβs(ˆn) − ¯βs\n\u00113\u0013 #\n,\n(4.1)\nwhere\nfsync(ν, ¯βs) =\n ν\nνs\n!¯βs\n(4.2)\n– 11 –\nis a power-law with fixed pivot spectral index ¯βs. Equation 4.1 highlights moments of the synchrotron\nspectral index, (βs(ˆn) − ¯βs)k, with uniform SEDs ∂k\nβs fsync(ν, ¯βs).\nSimilarly, from Equation 2.1, the moment expansion of the thermal dust emission around a\nbaseline MBB SED up to second order reads as:\nXd(ˆn, ν) = Xd(ˆn, νd)\n\"\nfdust(ν, ¯βd, ¯Td) +\n\u0010\nβd(ˆn) − ¯βd\n\u0011\n∂βd fdust(ν, ¯βd, ¯Td)\n+\n\u0010\nTd(ˆn) − ¯Td\n\u0011\n∂Td fdust(ν, ¯βd, ¯Td) + 1\n2\n\u0010\nβd(ˆn) − ¯βd\n\u00112 ∂2\nβd fdust(ν, ¯βd, ¯Td)\n+\n\u0010\nβd(ˆn) − ¯βd\n\u0011 \u0010\nTd(ˆn) − ¯Td\n\u0011\n∂βd∂Td fdust(ν, ¯βd, ¯Td)\n+ 1\n2\n\u0010\nTd(ˆn) − ¯Td\n\u00112 ∂2\nTd fdust(ν, ¯βd, ¯Td) + O\n\u0012\u0010\nβd(ˆn) − ¯βd\n\u00113 ,\n\u0010\nTd(ˆn) − ¯Td\n\u00113\u0013 #\n,\n(4.3)\nwhere\nfdust(ν, ¯βd, ¯Td) =\n ν\nνd\n!¯βd+1 exp\n\u0010\nhνd/k ¯Td(ˆn)\n\u0011\n− 1\nexp\n\u0010\nhν/k ¯Td(ˆn)\n\u0011\n− 1\n(4.4)\nis the MBB function for data in brightness temperature units, with fixed pivot values of the spectral\nindex and temperature ¯βd and ¯Td.\nWe assume the observed averages of spectral parameters across the sky as pivot values to ensure\nthat most of the Galactic emission projects onto the zeroth-, first-, and second-order moments of the\nexpansion: ¯βs ≃ −3 [41, 44, 49, 50], ¯βd ≃ 1.5, and ¯Td ≃ 20 K [41]. However, further refinement of\nthe most suitable pivot values for spectral parameters could be achieved by considering the observed\naverage in the sky area outside the Galactic mask used in the analysis or by requiring the cancellation\nof first-order moments in the average [51].\nThe cMILC weights are built to deproject some of these foreground moments by adding to\nNILC nulling constraints against their homogeneous SEDs, while the remaining unconstrained con-\ntamination is left to blind variance minimization:\n\nminw\n\u0010\nwTC w\n\u0011\nwT · aCMB = 1\nwT · f sync(¯βs) = 0\nwT · ∂βs f sync(¯βs) = 0\nwT · f dust(¯βd, ¯Td) = 0\nwT · ∂βd f dust(¯βd, ¯Td) = 0\nwT · ∂Td f dust(¯βd, ¯Td) = 0\n...\n,\n(4.5)\nwhere w = {w j\nν(ˆn)} represents the vector of frequency-dependent, pixel-dependent, and scale-dependent\ncMILC weights, C = {C j\nνν′(ˆn)} denotes the data covariance matrix with the same dependencies as\nthe weights, ∂kβd∂nTd f dust(¯βd, ¯Td) = {∂k\nβd∂n\nTd fdust(ν, ¯βd, ¯Td)} and ∂kβs f sync(¯βs) = {∂k\nβs fsync(ν, ¯βs)} are\nthe frequency-dependent but pixel-independent dust and synchrotron moment SEDs, and aCMB =\n{aCMB,ν} stands for the CMB SED, which is independent of frequency in CMB temperature units.\nThe number of nulling constraints on moments in Equation 4.5 is only limited by the number of\navailable frequency channels and the sensitivity of the experiment.\n– 12 –\nBy collecting the SED vectors of the CMB and selected foreground moments into the mixing\nmatrix\nA =\n\u0010\naCMB\nf sync(¯βs)\nf dust(¯βd, ¯Td)\n∂βd f dust(¯βd, ¯Td)\n. . .\n\u0011\nand the deprojection coefficients into the vector:\ne = (1\n0\n0\n0\n. . .)T ,\n(4.6)\nthe cMILC weights can be expressed in the compact form:\nw = eT h\nATC−1 A\ni−1 ATC−1 .\n(4.7)\nThe cMILC method, initially introduced in [23], has since been applied in various subsequent works\n[31, 52–56]. In such a framework, NILC represents simply a subcase of cMILC where only the first\nelement of e and first column of A are employed in Equation 4.7.\nAdding constraints to null some of the foreground moments and, thereby, remove systematic\nbiases generally results in an increase of the variance of the noise and unconstrained foreground\ncomponents, such as non-included higher-order moments. There is thus a trade-off between depro-\njection and blind variance minimization, where components that significantly contribute to the overall\nvariance in the data may be better suited for variance minimization rather than deprojection. How-\never, in the baseline cMILC approach, there is no inherent procedure for selecting which moments\nshould be prioritized for deprojection and which ones should be left for variance minimization.\nTo illustrate some limitations of the baseline cMILC approach, we applied both NILC and\ncMILC pipelines to different PICO data sets as discussed in Section 2, using the needlet frame im-\nplementation presented in Section 3.2. For each data set, we considered 50 simulations with dis-\ntinct random realizations of the CMB and instrumental noise, and we implemented three versions of\ncMILC:\n1. cMILC-0, where all zeroth-order moments are deprojected.\n2. cMILC-01, where all zeroth- and first-order moments are deprojected.\n3. cMILC-012, where all zeroth-, first-, and second-order moments are deprojected.\nIn all cases, the pivot values of the spectral parameters were held fixed to their average across the sky\nin the PySM d1s1 model: ¯βs = −3, ¯βd = 1.54, and ¯Td = 19.6 K.\nForeground and noise residuals are calculated by applying the NILC and cMILC weights de-\nrived from the specified data set to the foreground and noise inputs of that simulation, serving il-\nlustrative purposes. Throughout this paper, to alleviate residual foreground contamination along the\nGalactic plane, the angular power spectra for d1, d4, and d7 are computed over fsky = 70% of the sky\nusing the publicly available Planck GAL70 mask applied to the maps. For d12, a more conservative\nmasking strategy is employed, by extending the Planck GAL70 mask through smoothing the average\nd12 foreground residuals with a 5◦ beam and thresholding them to achieve a final sky fraction of\nfsky = 40%. Although the d12 mask is constructed from foreground residuals that may not be ac-\ncessible in real data analysis, it is employed solely for comparing outcomes from different pipelines\nwithin the same clean 40% region of the sky. The angular power spectra are computed using the py-\nmaster Python package2 of the MASTER estimator [57, 58], which facilitates proper deconvolution\nof masking and beam smoothing effects [59].\n2https://namaster.readthedocs.io/en/latest/\n– 13 –\n5\n10\n50\n100\n200\n500\n10\n9\n10\n7\n10\n5\n10\n3\n10\n1\nCBB [ K2]\nd1, fsky=70%\nNILC\ncMILC-0\ncMILC-01\ncMILC-012\nforegrounds\nnoise\nCMB input\nr\n[0.4 10\n3, 4 10\n3]\n5\n10\n50\n100\n200\n500\n10\n9\n10\n7\n10\n5\n10\n3\n10\n1\nCBB [ K2]\nd7, fsky=70%\nNILC\ncMILC-0\ncMILC-01\nforegrounds\nnoise\nCMB input\nr\n[0.4 10\n3, 4 10\n3]\nFigure 3. Angular power spectra of foreground (solid) and noise (dashed) residuals in B-modes resulting from\nthe application of NILC (blue), cMILC-0 (orange), and cMILC-01 (green) to PICO d1 (left) and d7 (right) data\nsets. For the d1 case, results of cMILC-012 (red) are also presented. All the power spectra are binned with\n∆ℓ = 5 and computed over 70% of the sky. The grey shaded area denotes the range of primordial tensor CMB\nB-mode power spectra corresponding to tensor-to-scalar ratio values r ∈ [0.0004, 0.004].\nThe results for PICO data sets d1 and d7 are reported in Figure 3, showing the angular power\nspectra of foreground and noise residuals when applying NILC, cMILC-0, cMILC-01, and cMILC-\n012. Residuals from the most constrained version cMILC-012 are exclusively shown for the d1 data\nset. The comparison is made against the primordial CMB B-mode signal across a range of tensor-\nto-scalar ratio values, r ∈ [0.4 × 10−3, 4 × 10−3], where r = 0.4 × 10−3 represents the actual upper\nbound at 95% CL targeted by PICO for its baseline instrumental configuration, as adopted in this\nwork (refer to Section 2 for details on rescaling PICO CBE to baseline sensitivity).\nThe results from Figure 3 lead to several conclusions. For the PICO d1 data set, the cMILC\nforeground residuals are lower than those of NILC at intermediate and small angular scales. How-\never, on the largest angular scales, the averaging processes significantly distort the foreground SEDs,\nand the rigid cMILC deprojection fails to adequately suppress these low-ℓ distortions of the Galactic\nemission compared to simple variance minimization. As previously demonstrated in [23], imposing\nthe deprojection of more moments in Equation 4.5 results in a penalty to the residual noise bud-\nget. This is particularly noticeable when examining the residuals from the application of cMILC-012\n(where all zeroth-, first-, and second-order moments are deprojected) to the PICO d1 data set: the\nCMB solution, derived from the linear combination of 21 frequency channels with nine fully depro-\njected moments, suffers from a significant increase in noise contamination. Therefore, a compromise\nin the optimal number of moments to deproject must be found. Moreover, in this baseline cMILC ap-\nproach, the moments have been projected out in the natural order of the expansion. However, there is\nno a priori reason to filter out lower-order moments first in the context of minimum-variance method-\nologies. It may be more effective to leave some major low-order contributions for blind variance\nminimization, as they are anyway prevailing in the budget of the observed data covariance matrix of\nEquation 3.3. When considering PICO maps with different dust models, such as d7 (right panel), the\ncMILC foreground residuals might even appear brighter compared to NILC in some cases (cMILC-\n01), indicating that the employed moment deprojection may not entirely capture the actual deviations\nof the dust model from the MBB SED.\nThese results suggest that there is room for optimization of the moment deprojection in the\ncMILC method, as anticipated and preliminarily explored in [23]. This optimization could be tackled\nin four ways: (i) allowing the number of deprojected moments to vary across sky regions and multi-\npole ranges based on information from GNILC diagnostic maps (Section 3); (ii) selecting moments\n– 14 –\nfor deprojection independently of the natural order of the expansion; (iii) allowing the pivot values to\nvary across sky regions and multipole ranges to reduce the significance of higher-order moments in\nthe moment expansion; (iv) partially filtering out the contribution of specific moments by modifying\nthe deprojection vector in Equation 4.6 as follows:\ne = (1\nϵ1\nϵ2\nϵ3\n. . .)T ,\n(4.8)\nwith |ϵi| < 1. This last adjustment aims to strike a balance between reducing bias and increasing noise\nvariance, drawing inspiration from [60].\n4.2\nOptimization of moment deprojection\nIn this section, we present the ocMILC (optimized cMILC) method, an improved version of cMILC,\nwhich optimizes moment deprojection and variance minimization by leveraging information from\nGNILC diagnostic maps regarding expected foreground complexity (Section 3). The method is fully\ndata-driven.\nThe first stage in the ocMILC pipeline involves conducting the GNILC diagnosis to determine\nhow many independent modes of the Galactic emission have greater power than noise across the sky\nand angular scales. For each range of angular scales (needlet scale j), this provides a partitioning\nof the sky into clusters of uniform dimension, m j\nfgds, of the expected foreground subspace. Each\ncluster of the partition, as illustrated in Figure 2, offer constraints on the optimal number of mo-\nments to deproject in that region of the sky and range of angular scales without incurring significant\nnoise penalty. In ocMILC, this information is fully leveraged, and only m(j)\nfgds(ˆn) moments are fil-\ntered out at pixel ˆn and needlet scale j. For B-mode diagnosis, the nuisance covariance matrix CN\n(Equation 3.5) in GNILC is derived from instrumental noise simulations but does not include CMB,\nas the tensor-to-scalar ratio (and consequently, the CMB covariance) is unknown a priori. There-\nfore, one of the independent modes identified by GNILC is attributed to CMB (Equation 3.9), and\nm j\nfgds(ˆn) = m j\nfgds+CMB(ˆn) − 1 moments are deprojected by ocMILC in each region.\nOnce the optimal number of nulling constraints to deproject moments is determined in each\nGNILC region and needlet scale, ocMILC selects the optimal configuration of m j\nfgds moments, pivot\nvalues, and deprojection coefficients among the following sets of\n1. moment SEDs:\nh\nfdust, fsync, ∂βd fdust, ∂βs fsync, ∂Td fdust, ∂2\nβd fdust, ∂βd∂Td fdust, ∂2\nβs fsync, ∂2\nTd fdust\ni\n,\n(4.9)\n2. dust pivot parameter values:\n¯βd ∈ [1.2, 1.8] with ∆¯βd = 0.05, ¯Td ∈ [17 K, 22 K] with ∆ ¯Td = 0.25,\n(4.10)\n3. and deprojection values:\nϵk ∈ [−0.05, −0.01, −0.005, −0.001, −0.0005, 0., 0.0005, 0.001, 0.005, 0.01, 0.05].\n(4.11)\nThe optimal combination of moments, pivots, and deprojection coefficients is determined so as to\nminimize the cMILC output variance corrected for residual noise variance in each GNILC cluster:\n⟨c2\ncMILC⟩ − ⟨n2\nres⟩ = wT\ncMILC (C − N) wcMILC ,\n(4.12)\nwhere C represents the data covariance matrix and N denotes the instrumental noise covariance ma-\ntrix. The GNILC partitioning of the sky into clusters of pixels characterized by uniform foreground\n– 15 –\n5\n10\n50\n100\n200\n500\n10\n9\n10\n7\n10\n5\n10\n3\n10\n1\nCBB [ K2]\nd7, fsky=70%\nNILC\nocMILC-v0\nocMILC-v1\nocMILC-v2\nocMILC\nforegrounds\nnoise\nCMB input\nr\n[0.4 10\n3, 4 10\n3]\nFigure 4. Angular power spectra of foreground (solid) and noise (dashed) residuals over fsky = 70% of the sky\nresulting from the application of NILC (blue), ocMILC-v0 (cyan), ocMILC-v1 (red), ocMILC-v2 (green), and\nocMILC (magenta) to the PICO d7 B-mode data set. This illustrates the progressive improvement in residuals\nachieved by combining several layers of optimization in ocMILC.\ncomplexity (Figure 2) is used to recalculate the local covariance matrix of the data and ocMILC\nweights in each cluster independently, drawing inspiration from the multiclustering strategy of [24].\nThe covariance matrices in Equation 4.12 and the optimization procedure are thus computed within\neach independent GNILC region, representing a connected set of pixels sharing the same value of\nmfgds. Therefore, the ocMILC CMB solution is the solution with minimum local foreground variance\nobtained by partially (or fully) deprojecting m j\nfgds moments with varying pivot parameters across the\nsky and angular scales.\nThe improvement induced by combining the various layers of optimization in ocMILC, in-\ncluding the selection of moments and their number, pivot values, and deprojection coefficients, is\ndemonstrated by comparing the power spectrum of ocMILC residuals with those obtained when op-\ntimization is exclusively applied to specific layers. This comparison is performed with the following\nintermediate ocMILC pipelines using the example of the PICO d7 data set (similar results are ob-\ntained for other models):\n• ocMILC-v0, where optimization focuses on the number of moments, based on information\nfrom GNILC diagnostic maps, deprojecting the first mfgds moments in the natural order of the\nTaylor expansion (Equation 4.9);\n• ocMILC-v1, where optimization involves both the number and the set of moments, deproject-\ning the set of mfgds moments that lead to the lowest denoised output variance (Equation 4.12);\n• ocMILC-v2, where optimization extends to the number of moments, set of moments, and pivot\nvalues.\nThe comparison results, shown in Figure 4, reveal that deprojecting the first mfgds moments in the nat-\nural order of the Taylor expansion (ocMILC-v0) does not improve foreground subtraction across most\n– 16 –\n5\n10\n50\n100\n200\n500\n10\n9\n10\n7\n10\n5\n10\n3\n10\n1\nCBB [ K2]\nd1, fsky=70%\nNILC\nocMILC (mfgds\n1)\nocMILC (mfgds)\nocMILC (mfgds + 1)\nocMILC (mfgds + 2)\nforegrounds\nnoise\nCMB input\nr\n[0.4 10\n3, 4 10\n3]\nFigure 5. Angular power spectra of foreground (solid) and noise (dashed) residuals over fsky = 70% of the\nsky obtained from the application of NILC (blue) and ocMILC (others) to the PICO d1 B-mode data set, with\nvariations in the number of moments deprojected compared to the number mfgds diagnosed by GNILC. The\nresults of ocMILC are shown for four different cases, where, respectively, mfgds (magenta), mfgds − 1 (cyan),\nmfgds + 1 (red), and mfgds + 2 (green) foreground moments are deprojected across the sky and needlet scales.\nscales, especially when the dust model, like d7, deviates substantially from a MBB. In such cases,\nnulling constraints result in a notable penalty in residual foreground variance attributed to higher-\norder moments. This suggests that the mitigation of foregrounds could have been better handled\nif some of the low-order moments had been left for variance minimization, while the higher-order\nmoments had been deprojected. Optimizing the choice of moments (ocMILC-v1) indeed brings im-\nprovement, further enhanced by allowing the values of pivot parameters to vary freely (ocMILC-v2),\nenabling a more effective accommodation of the dust model through moment expansion. Enabling\nthe weights to also partially deproject specific moments (ocMILC) provides additional flexibility to\nthe blind variance minimization process, allowing for the mitigation of foreground modes not ade-\nquately captured by the moment expansion. This final refinement, in conjunction with the previous\noptimization steps, enables ocMILC to reconstruct the cleanest CMB solution among all considered\nintermediate pipelines for all data sets, achieving minimum foreground variance with limited noise\npenalty. This increased flexibility proves advantageous in effectively handling various thermal dust\nmodels through moment expansion.\nTo validate the accuracy of the GNILC diagnosis in determining the optimal number mfgds of\nmoments to deproject before incurring significant noise penalties, we apply ocMILC to the PICO\nd1 data set while imposing the deprojection of mfgds − 1, mfgds + 1, and mfgds + 2 moments in each\npoint of the sky and for each needlet scale. The resulting angular power spectra are compared with\nthose of NILC and the proper ocMILC, with mfgds moments deprojected, in Figure 5. The outcomes\nclearly demonstrate that deprojecting one or two additional moments, beyond what is suggested by\nthe GNILC diagnosis, leads to a significant increase in residual noise. Conversely, deprojecting\nmfgds − 1 moments results in larger Galactic contamination on intermediate and small scales. These\n– 17 –\nresults highlight the efficacy of the GNILC diagnosis in providing a data-driven assessment of the\noptimal number of moments for deprojection with ocMILC.\n5\n10\n50\n100\n200\n500\n10\n9\n10\n7\n10\n5\n10\n3\n10\n1\nCBB [ K2]\nd1, fsky=70%\nNILC\nocMILC\nforegrounds\nnoise\nCMB input\nr\n[0.4 10\n3, 4 10\n3]\n10\n5\n10\n4\n10\n3\n10\n2\nr\n0.2\n0.4\n0.6\n0.8\n1.0\n/\nmax\nr=0.0003±0.0001\nr < 0.0004, 95% CL\n5\n10\n50\n100\n200\n500\n10\n9\n10\n7\n10\n5\n10\n3\n10\n1\nCBB [ K2]\nd4, fsky=70%\nNILC\nocMILC\nforegrounds\nnoise\nCMB input\nr\n[0.4 10\n3, 4 10\n3]\n10\n5\n10\n4\n10\n3\n10\n2\nr\n0.2\n0.4\n0.6\n0.8\n1.0\n/\nmax\nr=7e-05±6e-05\nr < 0.0002, 95% CL\n5\n10\n50\n100\n200\n500\n10\n9\n10\n7\n10\n5\n10\n3\n10\n1\nCBB [ K2]\nd7, fsky=70%\nNILC\nocMILC\nforegrounds\nnoise\nCMB input\nr\n[0.4 10\n3, 4 10\n3]\n10\n5\n10\n4\n10\n3\n10\n2\nr\n0.2\n0.4\n0.6\n0.8\n1.0\n/\nmax\nr=6e-05±6e-05\nr < 0.0003, 95% CL\n5\n10\n50\n100\n200\n500\n10\n9\n10\n7\n10\n5\n10\n3\n10\n1\nCBB [ K2]\nd12, fsky=40%\nNILC\nocMILC\nforegrounds\nnoise\nCMB input\nr\n[0.4 10\n3, 4 10\n3]\n10\n5\n10\n4\n10\n3\n10\n2\nr\n0.2\n0.4\n0.6\n0.8\n1.0\n/\nmax\nr=0.0005±0.0003\nr < 0.0015, 95% CL\nFigure 6. Left: Angular power spectra of foreground (solid) and noise (dashed) B-mode residuals obtained\nfrom the application of NILC (blue) and ocMILC (magenta) to PICO d1 (top), d4 (second row), d7 (third\nrow), and d12 (bottom) data sets. Power spectra have been computed over fsky = 70% of the sky for models\nd1, d4, and d7, and over fsky = 40% of the sky for model d12. Right: Posterior distributions of the recovered\ntensor-to-scalar ratio for both pipelines. In all plots, the grey shaded area represents the range of values of the\ntensor-to-scalar ratio: r ∈ [0.0004, 0.004].\n– 18 –\nThe full ocMILC pipeline, integrating all layers of optimization, has been applied to all PICO\nB-mode data sets, encompassing diverse foreground scenarios outlined in Section 2. The angular\npower spectra of ocMILC residuals are compared with those of NILC for all foreground scenarios\nin Figure 6. For the d1, d4, and d7 models, ocMILC yields significantly lower foreground residuals\nacross all angular scales compared to NILC, with only a moderate increase in noise contamination\nrelative to NILC. These improvements in terms of residual foreground contamination, regardless of\nthe foreground model, can be attributed to the several layers of optimization in ocMILC: multiclus-\ntering from GNILC, varying number and set of deprojected moments, varying pivot parameters, and\nvarying deprojection coefficients, across the sky and angular scales. For the most challenging fore-\nground model d12, which includes multi-layer dust components along the line-of-sight and spectral\ndecorrelation [29], the reduction of residual foreground contamination is more modest than in other\nforeground scenarios but still outperforms NILC across angular scales overall. Across all the consid-\nered data sets, the reduced residual foreground contamination of the ocMILC CMB B-mode solution\nis achieved with only a moderate noise penalty relative to NILC, thanks to the information provided\nby the GNILC diagnosis. These results showcase the flexibility of ocMILC in effectively handling\ndeviations of thermal dust emission from a simple MBB through optimized moment deprojection.\nTo further assess the quality of the CMB B-mode reconstruction, we examine the impact of\nNILC and ocMILC residuals on the estimation of the tensor-to-scalar ratio, r. We estimate the tensor-\nto-scalar ratio from the recovered B-mode power spectra using the inverse-Wishart log-likelihood\n[61]:\nlog L(r) = − fsky\n2ℓ + 1\n2\n\"\nˆCℓ\nCℓ(r) + logCℓ(r) − 2ℓ − 1\n2ℓ + 1 log ˆCℓ\n#\n.\n(4.13)\nHere ˆCℓ = AlensClens\nℓ\n+ Cfgds\nℓ\n+ Cnoi\nℓ\nrepresents the angular power spectrum of the output CMB B-\nmode map, averaged over all realizations, with Clens\nℓ\nthe lensing power spectrum, Al its residual\namplitude after some expected level of delensing, Cfgds\nℓ\nand Cnoi\nℓ\nthe foreground and noise residual\npower, while Cℓ(r) = r C r=1\nℓ\n+ AlensClens\nℓ\n+ Cnoi\nℓ\nrepresents our theoretical power spectrum model,\nwhere C r=1\nℓ\nis the primordial CMB B-mode power spectrum for tensor perturbations with r = 1.\nWe adopt Alens = 0.27 to align with the expected 73% delensing capability of PICO [30]. As our\nsimulations do not include primordial tensor perturbations, the best-fit value of r is only driven by\nresidual foreground contamination, while its uncertainty is influenced by residual lensing, noise,\nand foregrounds. While the likelihood function in Equation 4.13 is not exact for a masked sky as\nit neglects correlations between different multipoles induced by masking, we ensure that these off-\ndiagonal terms of the covariance matrix are negligible by binning the angular power spectrum with a\nconstant binning scheme of ∆ℓ = 10.\nThe resulting r-posteriors for NILC and ocMILC across the four distinct foreground scenarios\nare displayed in the right panels of Figure 6. Biased estimates of the tensor-to-scalar ratio (r) are\nreported when the value r = 0 falls outside the 68% confidence level. Notably, ocMILC, in contrast\nto NILC, produces unbiased posteriors for r across all considered foreground scenarios even for such\nlarge fractions of sky. This bias removal is characterized by both a shift in the distribution’s peak\ntowards lower values of r due to reduced foreground contamination and an increase in the distribu-\ntion’s width due to increased noise. The biased r-distribution observed in NILC results from more\npronounced residual Galactic contamination across all multipoles. While previous PICO forecasts in\nthe literature [23, 30] demonstrated that NILC and cMILC can achieve unbiased recovery of r for a\n50% sky fraction with most foreground models, our results highlight that over larger sky fractions\n(70%) these methods, without optimization, exhibit biases in r due to lingering foreground residuals.\nIn contrast, ocMILC remains unbiased over such extended sky fractions for all foreground models.\n– 19 –\n10\n5\n10\n4\n10\n3\n10\n2\nr\n0.2\n0.4\n0.6\n0.8\n1.0\n/\nmax\nd1\nr=0.0003±0.0001\nr < 0.0004, 95% CL\nr=0.0003±0.0001\nr < 0.0004, 95% CL\nr=0.0005±0.0001\nr=0.0002±0.0002\nfsky = 70%\nfsky = 80%\nfsky = 90%\n10\n5\n10\n4\n10\n3\n10\n2\nr\n0.2\n0.4\n0.6\n0.8\n1.0\n/\nmax\nd4\nr=7e-05±6e-05\nr < 0.0002, 95% CL\nr=8e-05±6e-05\nr < 0.0002, 95% CL\nr=0.00012±7e-05\nr < 0.0003, 95% CL\nfsky = 70%\nfsky = 80%\nfsky = 90%\n10\n5\n10\n4\n10\n3\n10\n2\nr\n0.2\n0.4\n0.6\n0.8\n1.0\n/\nmax\nd7\nr=6e-05±6e-05\nr < 0.0003, 95% CL\nr=8e-05±6e-05\nr < 0.0003, 95% CL\nr=0.0001±6e-05\nr < 0.0002, 95% CL\nfsky = 70%\nfsky = 80%\nfsky = 90%\n10\n5\n10\n4\n10\n3\n10\n2\nr\n0.2\n0.4\n0.6\n0.8\n1.0\n/\nmax\nd12\nr=0.0005±0.0003\nr < 0.0015, 95% CL\nr=0.0007±0.0003\nr < 0.0015, 95% CL\nr=0.0014±0.0004\nr=0.0007±0.0006\nfsky = 40%\nfsky = 50%\nfsky = 60%\nFigure 7.\nRecovered posterior distributions of the tensor-to-scalar ratio obtained from NILC (blue) and\nocMILC (magenta) with increasing sky fractions.\nThe grey shaded region corresponds to the range r ∈\n[0.0004, 0.004], where the lower bound (r = 0.0004) aligns with the targeted sensitivity at 95% confidence\nlevel for the adopted PICO baseline instrumental configuration.\nIt is interesting to note that our results, along with those from [30], exhibiting poorer constraints on\nr for d1 and d12 compared to d4 and d7 foreground scenarios, align with the GNILC diagnosis in\nSection 3 which indeed revealed lower foreground complexity in the d4 and d7 data sets. For all\nconsidered Galactic models, except the intricate d12 model, ocMILC achieves upper bounds on the\ntensor-to-scalar ratio that align with the sensitivity targeted by PICO with the adopted baseline in-\nstrumental configuration (r < 0.0004 at 95% CL). In Appendix A, we demonstrate on the d1 data set\nthat ocMILC, when applied with the more sensitive PICO CBE instrumental configuration, meets the\nspecified requirement of r < 0.0002 at 95% CL for this particular configuration.\nThanks to optimized moment deprojection, ocMILC enables the observation of larger regions of\nuncontaminated sky compared to NILC and cMILC, without significant bias introduced by residual\nforegrounds. This is demonstrated in Figure 7, showing the variation of the recovered posterior on r\nwith increasing sky fractions, ranging from fsky = 70% to 90% for d1, d4, and d7, and from fsky =\n40% to 60% for d12. Across all foreground models, ocMILC consistently yields lower unbiased\nupper bounds on the tensor-to-scalar ratio compared to NILC, whose posteriors exhibit consistent bias\nat high significance across all data sets over such large sky fractions. Lastly, it is important to highlight\nthat ocMILC successfully handles the intricate multi-layer dust model d12 [29], avoiding the residual\nbias reported for NILC in previous PICO forecasts [30] concerning this specific foreground model.\nTable 2 presents the optimal moment configurations determined by ocMILC across different sky\nregions and angular scales for each foreground data set. For each needlet band and GNILC cluster\n(sky region with uniform foreground complexity), the table includes information on the optimal num-\nber and combination of moments for deprojection, along with the corresponding optimal values of\ndeprojection coefficients and dust pivot parameters. Examining these optimal configurations allows\n– 20 –\nTable 2. Optimal configuration of moments and dust pivot parameters for deprojection, as determined\nby ocMILC across various sky regions and needlet scales for each foreground data set. The optimal\ndeprojection coefficient for each moment SED is indicated in parentheses. As detailed in Section 4.2,\nthe optimal combination of these parameters is chosen by minimizing the denoised output variance\nof Equation 4.12.\nBand\nmfgds\nd1s1\nd4s1\nd7s1\nd12s1\nj = 1\n5\n¯βd = 1.75, ¯Td = 19.0;\n\u0002∂βd(−0.01),∂βs(0.),∂Td(0.),\n∂2\nβs(0.001),∂2\nβdTd(0.0005)\u0003\n¯βd = 1.4, ¯Td = 17.0;\n\u0002fd(0.01),∂βs(0.),∂Td(0.),\n∂2\nβd(0.05),∂2\nβs(−0.005)\u0003\n6\n¯βd = 1.3, ¯Td = 17.25;\n\u0002fd(0.001),fs(0.),∂βs(0.),\n∂Td(0.),∂2\nβs(0.01),∂2\nTd(0.01)\u0003\n¯βd = 1.25, ¯Td = 18.25\n\u0002fd(0.),fs(0.),∂βd(−0.005),\n∂βs(0.),∂Td(0.),∂2\nβs(0.05)\u0003\nj = 2\n4\n¯βd = 1.2, ¯Td = 17.5;\n\u0002fs(0.),∂βs(−0.0005),\n∂2\nβd(0.05),∂2\nβs(0.05)\u0003\n¯βd = 1.75, ¯Td = 21.5;\n\u0002∂βd(−0.0005),∂βs(0.0005),\n∂Td(−0.001),∂2\nβd(0.01)\u0003\n¯βd = 1.35, ¯Td = 21.75;\n\u0002 fd(0.01),∂βs(−0.001),\n∂2\nβs(0.),∂2\nTd(0.)\u0003\n5\n¯βd = 1.7, ¯Td = 21.75;\n\u0002fd(0.),∂βd(0.001),∂Td(0.),\n∂βs(0.001),∂2\nβd(0.01)\u0003\n¯βd = 1.75, ¯Td = 19.5;\n\u0002∂βd(−0.01),∂βs(0.),∂Td(0.),\n∂2\nβs(0.005),∂2\nβdTd(0.0005)\u0003\n¯βd = 1.35, ¯Td = 21.5;\n\u0002fd(0.01),∂βs(0.),\n∂2\nβd(0.05),∂2\nβs(0.001),\n∂2\nTd(0.)\u0003\n¯βd = 1.7, ¯Td = 17.5\n\u0002fs(−0.0005),∂βs(0.001),\n∂Td(0.), ∂2\nβd(−0.0005),\n∂2\nβs(0.05)\u0003\nj = 3\n3\n¯βd = 1.5, ¯Td = 19.0;\n\u0002fs(−0.001),∂Td(0.),\n∂2\nβs(0.05)\u0003\n¯βd = 1.45, ¯Td = 17.0;\n\u0002∂βd(−0.01),∂βs(−0.001),\n∂Td(0.)\u0003\n¯βd = 1.45, ¯Td = 21.0;\n\u0002fs(0.001),∂Td(0.),\n∂2\nβdTd(0.0005)\u0003\n4\n¯βd = 1.65, ¯Td = 17.25;\n\u0002∂βd(0.001),∂βs(0.005),\n∂2\nβs(0.05), ∂2\nTd(0.)\u0003\n¯βd = 1.45, ¯Td = 21.75;\n\u0002∂βd(−0.01),∂βs(0.005),\n∂2\nβs(0.05),∂2\nTd(0.)\u0003\n¯βd = 1.4, ¯Td = 20.0;\n\u0002∂βs(0.001),∂Td(0.),\n∂2\nβdTd(0.0005),∂2\nTd(0.)\u0003\n¯βd = 1.75, ¯Td = 19.25\n\u0002∂βs(0.005),∂2\nβd(−0.0005),\n∂2\nβs(0.05),∂2\nβdTd(0.0005)\u0003\n5\n¯βd = 1.35, ¯Td = 19.0\n\u0002∂βd(−0.001),∂βs(0.01),\n∂Td(0.), ∂2\nβdTd(0.), ∂2\nTd(0.)\u0003\nj = 4\n2\n¯βd = 1.2, ¯Td = 17.0;\n\u0002fs(−0.005),∂2\nTd(0.)\u0003\n¯βd = 1.3, ¯Td = 18.25;\n\u0002fd(0.01),∂βs(0.005)\u0003\n¯βd = 1.65, ¯Td = 17.25;\n\u0002fd(−0.01), fs(−0.005)\u0003\n¯βd = 1.75, ¯Td = 21.75;\n\u0002∂2\nβd(0.01),∂2\nβdTd(−0.001)\u0003\n3\n¯βd = 1.25, ¯Td = 17.75;\n\u0002∂βd(−0.01),∂βs(0.01),\n∂2\nβdTd(0.0005)\u0003\n¯βd = 1.45, ¯Td = 17.5;\n\u0002∂βd(−0.01),∂βs(0.005),\n∂2\nβdTd(0.)\u0003\n¯βd = 1.6, ¯Td = 20.25;\n\u0002∂βd(−0.01),∂βs(0.005),\n∂2\nβdTd(0.0005)\u0003\n¯βd = 1.5, ¯Td = 21.25\n\u0002fs(−0.001),∂βd(−0.0005),\n∂2\nTd(0.)\u0003\n4\n¯βd = 1.6, ¯Td = 17.75;\n\u0002∂βd(0.0005),∂βs(0.001),\n∂Td(0.), ∂2\nTd(0.)\u0003\n¯βd = 1.75, ¯Td = 20.5;\n\u0002∂βd(−0.001),∂βs(0.01),\n∂2\nβd(0.01),∂2\nβdTd(−0.001)\u0003\n¯βd = 1.4, ¯Td = 19.5;\n\u0002∂βs(0.001),∂Td(0.),\n∂2\nβdTd(0.0005), ∂2\nTd(0.)\u0003\n¯βd = 1.6, ¯Td = 17.0\n\u0002∂βs(0.01), ∂Td(0.),\n∂2\nβd(0.01),∂2\nβdTd(0.)\u0003\nj = 5\n1\n¯βd = 1.2, ¯Td = 17.0;\n\u0002∂2\nβs(0.005)\u0003\n¯βd = 1.2, ¯Td = 17.0;\n\u0002fs(−0.005)\u0003\n¯βd = 1.45, ¯Td = 17.0;\n\u0002∂2\nTd(0.)\u0003\n2\n¯βd = 1.2, ¯Td = 17.0;\n\u0002fs(0.0005), ∂2\nTd(0.)\u0003\n¯βd = 1.75, ¯Td = 17.0;\n\u0002fd(0.001), fs(0.0005)\u0003\n¯βd = 1.4, ¯Td = 17.0;\n\u0002fs(0.), ∂2\nTd(0.)\u0003\n¯βd = 1.75, ¯Td = 21.75;\n\u0002∂βd(0.001), ∂2\nβdTd(−0.001)\u0003\n3\n¯βd = 1.75, ¯Td = 21.75;\n\u0002fs(0.001),∂βd(0.001),\n∂2\nTd(0.)\u0003\n¯βd = 1.4, ¯Td = 21.75;\n\u0002∂βd(−0.01),∂βs(0.01),\n∂2\nTd(0.)\u0003\n¯βd = 1.35, ¯Td = 17.0;\n\u0002fs(0.),∂βs(0.001),\n∂2\nTd(0.)\u0003\n¯βd = 1.3, ¯Td = 21.5\n\u0002fs(0.0005),∂βd(−0.005),\n∂2\nTd(0.)\u0003\n4\n¯βd = 1.55, ¯Td = 21.75;\n\u0002fs(−0.0005),∂βd(−0.001),\n∂βs(0.001),∂2\nTd(0.)\u0003\n¯βd = 1.3, ¯Td = 17.25;\n\u0002fs(0.0005),∂βd(−0.0005),\n∂Td(0.0005), ∂2\nβdTd(0.)\u0003\n¯βd = 1.6, ¯Td = 21.75;\n\u0002fs(−0.0005),∂βd(−0.005),\n∂βs(0.005), ∂2\nTd(0.)\u0003\n¯βd = 1.6, ¯Td = 17.0\n\u0002∂βs(0.01),∂Td(0.),\n∂2\nβd(0.01),∂2\nβdTd(0.)\u0003\n– 21 –\nus to draw conclusions consistent with the discussions in previous sections:\n• The optimal pivot values of the spectral parameters vary for different foreground models, sky\nregions, and ranges of angular scales.\n• Higher-order moments are sometimes preferred for deprojection (e.g. d4s1), while the sub-\ntraction of lower-order components can be effectively handled by minimum variance.\n• Most moments require only partial deprojection.\nThe ranges of mfgds values derived from the GNILC diagnosis for different Galactic models and\nangular scales, as reported in Table 2 and used by ocMILC, are similar to those shown in Table 1.\nHowever, minor differences exist in a few cases, particularly at large and intermediate scales and for\nsmall clusters. This discrepancy arises because ocMILC and Table 2 adopt the more conservative\nestimate mfgds = mGNILC − 1, where mGNILC is computed considering only instrumental noise as\na nuisance component, and one mode is subtracted to account for the expected CMB contribution.\nIn contrast, Table 1 reports mfgds = mGNILC, including CMB in the nuisance term. These minor\nvariations result from the fact that, on large and intermediate angular scales, the CMB lensing B-\nmodes are not consistently detected across the entire sky as an independent component above the\nPICO noise level. This is expected, as lensing modes primarily contribute at small scales. However,\nthese differences are negligible and do not impact the performance of the ocMILC technique.\n5\nDiscussion\nThe results in Section 4 demonstrated the capability of ocMILC to handle diverse dust models ef-\nficiently, thanks to the optimization of moment deprojection. This was achieved by integrating in-\nformation from the GNILC diagnosis and optimizing the selection of moments, pivot values and\ndeprojection coefficients across various sky regions and angular scales. In this section, our focus\nshifts to assessing the pipeline’s robustness against varied models of Galactic synchrotron emission,\nwhile maintaining a fixed thermal dust emission model (d1) to isolate the impact of synchrotron\nmodel variations. Additionally, we investigate the pipeline’s response to potential polarization of the\nanomalous microwave emission (AME).\nSpecifically, in addition to s1, two alternative PySM synchrotron models are considered:\n1. s5: This model features a power-law SED as defined in Equation 2.3, but the spectral index\nmap from s1 has been rescaled to match the larger variability observed in S-PASS data [50].\nIn addition, small-scale non-gaussian anisotropies have been incorporated into the templates\nusing the Logarithm of the Polarization Fraction Tensor (logpoltens) formalism.\n2. s7: This model features a power-law SED with some curvature,\nXs(ˆn, ν) = Xs(ˆn, νs)\n ν\nνs\n!βs(ˆn)+Cs(ˆn) log ν\nνs\n,\n(5.1)\nwhere νs = 23 GHz, and the Xs(ˆn, νs) and βs maps remain consistent with those in s5, while\na spatially varying curvature term Cs is introduced based on the analysis of intensity data ob-\nserved in a patch of the ARCADE experiment [62].\nAs of now, there is no reported detection of AME polarization, and the most stringent upper\nbounds on the AME polarization fraction are at the level of 1% or lower [63–66], so that the actual\n– 22 –\nTable 3. Number mfgds of independent modes characterizing Galactic foreground emission, as de-\ntected by the GNILC in each needlet band for the baseline PICO configuration, as a function of the\nsynchrotron (top panel) and AME (bottom panel) scenarios. In cases where multiple values are ob-\nserved, parentheses indicate the corresponding sky fraction in percentage associated with each value\nof mfgds.\nB modes with different synchrotron models\nModel\nmfgds (fsky(%))\nj = 1\nj = 2\nj = 3\nj = 4\nj = 5\nd1s1\n6\n4 (13), 5 (87)\n3 (4), 4 (95), 5 (1)\n2 (11.5), 3 (28), 4 (60.5)\n1 (0.7), 2 (68), 3 (16.3), 4 (15)\nd1s5\n6\n5\n3 (4), 4 (52), 5 (44)\n2 (1), 3 (38), 4 (50), 5 (11)\n1 (0.7), 2 (58.5), 3 (25.5), 4 (15.3)\nd1s7\n6\n5\n3 (4), 4 (52), 5 (44)\n2 (1), 3 (38), 4 (50), 5 (11)\n1 (0.7), 2 (59), 3 (25), 4 (15.3)\nB modes with AME with different polarization fractions\nModel\nmfgds (fsky(%))\nj = 1\nj = 2\nj = 3\nj = 4\nj = 5\nΠAME = 0.5%\n7\n4 (6.4), 5 (64), 6 (29.6)\n3 (4), 4 (89.5), 5 (6.5)\n2 (11), 3 (28.5), 4 (60.5)\n1 (3), 2 (67),\n3 (25.5), 4 (4.5)\nΠAME = 1%\n7\n5 (27.5), 6 (72.5)\n3 (4), 4 (74),\n5 (10.5), 6 (11.5)\n2 (10), 3 (29.6), 4 (55.2),\n5 (5), 6 (0.2)\n2 (71.5), 3 (27), 4 (1.5)\nΠAME = 2%\n8\n6 (81.5), 7 (18.5)\n3 (4), 4 (45), 5 (24), 6 (27)\n1 (0.8), 2 (62.8), 3 (19.6)\n4 (14.8), 5 (2)\n1 (2), 2 (51),\n3 (20.4), 4 (26.6)\ncontribution of AME to polarized emission still remains uncertain. Therefore, we explore three AME\nscenarios with different constant degrees of polarization across the sky: ΠAME = 0.5, 1, and 2%.\nThe AME model from PySM corresponds to the sum of two spinning dust components based on\nthe Commander fit of Planck temperature data [38]. The SED of the first component features a\nspatially anisotropic peak frequency, while the SED of the other component maintains a constant\npeak frequency across the sky. The polarization angles of AME are set to match those of thermal dust\nemission.\nWe begin by examining the outcomes of the GNILC diagnosis for the various synchrotron and\nAME models in Table 3, contrasting them with those of the d1s1 data set, where the synchrotron was\nrepresented by the s1 model and AME was assumed to be unpolarized. Clearly, the number of inde-\npendent foreground B-modes detected by GNILC at each needlet scale and the associated sky areas\ntend to increase with more complex synchrotron models and higher degrees of AME polarization.\nThe larger variability of the synchrotron spectral index in the s5 model compared to s1 is noticeable\nto GNILC, particularly at intermediate and small scales ( j = 2, 3 and 4), where larger regions of the\nsky exhibit higher values of mfgds. In contrast, GNILC is not particularly sensitive to the spatially\nvarying curvature of the s7 model (equation 5.1) for the frequency range and sensitivity of PICO, as\nthe number of independent foreground modes detected remains similar for s5 and s7. Comparing\nthe first lines of the top and bottom tables highlights that even a modest AME polarization fraction of\nΠAME = 0.5% is detected by GNILC in all needlet bands for the frequency range and sensitivity of\nPICO. This trend persists with increasing polarization fractions (ΠAME = 1 and 2%), suggesting that\nhigher degrees of AME polarization further enhance the effective foreground complexity across the\nsky and angular scales.\nAfter evaluating the effects of more complex synchrotron and AME models in the GNILC\n– 23 –\n5\n10\n50\n100\n200\n500\n10\n9\n10\n7\n10\n5\n10\n3\n10\n1\nCBB [ K2]\nNILC residuals, different synchrotron models\ns1\ns5\ns7\nforegrounds\nnoise\nCMB input\nr\n[0.4 10\n3, 4 10\n3]\n5\n10\n50\n100\n200\n500\n10\n1\n100\n101\nCBB\n, ocMILC/CBB\n, NILC\ns1\ns5\ns7\nforegrounds\nnoise\n5\n10\n50\n100\n200\n500\n10\n9\n10\n7\n10\n5\n10\n3\n10\n1\nCBB [ K2]\nNILC residuals, different AME models\nAME \n= 0%\nAME \n= 0.5%\nAME \n= 1%\nAME \n= 2%\nforegrounds\nnoise\nCMB input\nr\n[0.4 10\n3, 4 10\n3]\n5\n10\n50\n100\n200\n500\n10\n1\n100\n101\nCBB\n, ocMILC/CBB\n, NILC\nAME \n= 0%\nAME \n= 0.5%\nAME \n= 1%\nAME \n= 2%\nforegrounds\nnoise\nFigure 8. Left: Angular power spectra of foreground (solid) and noise (dashed) B-mode residuals over 70%\nof the sky resulting from NILC applied to the PICO d1 data set with varying synchrotron models (top) or\nvarying AME polarization models (bottom). Right: Ratio of the power spectra between ocMILC and NILC\nfor foreground (solid) and noise (dashed) B-mode residuals across different synchrotron and AME scenarios\nconsidered.\ndiagnosis, we proceed to assess their impact on NILC and ocMILC CMB B-mode reconstruction in\nFigure 8. This is to determine whether there is a need to extend the optimization procedure of ocMILC\nto accommodate the higher complexity of synchrotron and AME polarized emissions. Indeed, despite\nocMILC’s optimization including synchrotron moments, the current pipeline maintains a fixed pivot\nvalue of ¯βs = −3 for the synchrotron spectral index (Section 4.2). However, a higher variability of\nthis parameter across the sky may necessitate optimizing the corresponding pivot values, similar to\nwhat was done for dust spectral parameters. Furthermore, the framework of moment expansion has\nnot yet been extended to AME [26], so the current ocMILC pipeline does not attempt to deproject\nany AME moments, leaving them for blind variance minimization.\nThe angular power spectra of foreground and noise residuals in the NILC CMB B-mode recon-\nstruction under various synchrotron and AME scenarios are displayed in the left panels of Figure 8.\nHaving a more complex synchrotron emission (s5 and s7) results in a slight increase in foreground\nresiduals across all angular scales up to ℓ ∼ 300. However, the impact of varying synchrotron com-\nplexity on NILC residuals is notably less pronounced compared to the impact of varying dust models,\nas discussed in previous sections. Consequently, further optimization of ocMILC on the pivot values\nof the synchrotron spectral index is not expected to significantly enhance ocMILC results. Across\nall extensions of synchrotron emission considered, the ocMILC’s CMB solution with a fixed pivot of\n¯βs = −3 indeed exhibits lower foreground contamination compared to NILC (top right panel), with\npercentage improvements similar to those obtained with the least complex model s1. In the case\nof the d1s5 data set, we even observe a 10% greater improvement of ocMILC over NILC at large\n– 24 –\nangular scales compared to d1s1. Additionally, the increase in noise residuals in ocMILC remains\nconsistent across all synchrotron scenarios. The negligible impact of synchrotron curvature is antic-\nipated since, as demonstrated in [23, 26], curvature is accounted for by the second-order term in the\nmoment expansion (Equation 4.1), which is included in our optimized deprojection. These results\nshow that, currently, with the available and foreseeable more complex synchrotron models, employ-\ning a fixed pivot for the synchrotron spectral index (¯βs = −3) still yields highly effective moment\ndeprojection with ocMILC.\nConcerning AME scenarios, we observe a slight increase in NILC residuals for ℓ ≲ 250 as the\nAME polarization fraction increases (bottom left panel of Figure 8). This indicates that the presence\nof a polarized AME component affects the variance minimization, given the sensitivity and frequency\ncoverage of PICO. Examining the ratio between ocMILC and NILC residuals (bottom right panel),\nwe find that, while the improvement achieved by ocMILC at intermediate and small angular scales\n(ℓ ≳ 70) slightly degrades with increasing AME polarization compared to the case without polarized\nAME, it remains highly significant. However, for very low multipoles (ℓ ≲ 15), ocMILC foreground\nresiduals become comparable to or larger than NILC foreground residuals depending on the degree\nof AME polarization. This highlights the necessity, in such scenarios and considering the frequency\ncoverage of PICO, of incorporating AME moments into the ocMILC pipeline in the first needlet band.\nWe leave this extension for future investigation, noting that there is currently no clear observational\nevidence for such levels of polarized AME emission across the sky.\n6\nConclusions\nThe success of upcoming CMB experiments hinges on the ability to measure the primordial CMB B-\nmode polarization down to r ≲ 10−3 without bias to validate the inflationary scenario. This requires\nexquisite control of instrumental systematics and Galactic foreground subtraction. While the blind\nNILC method enables the reconstruction of the CMB B-mode polarization field without encountering\nbiases from foreground mismodelling that parametric methods may face, fully blind overall-variance\nminimization might not always be sufficient to reduce large-scale Galactic contamination below the\nprimordial signal, especially for the most challenging foreground scenarios, depending on the avail-\nable sensitivity, frequency channels, and the targeted r value.\nDeprojecting moments of Galactic emission with the semi-blind cMILC method theoretically\nallows for minimizing foreground variance rather than overall variance. However, the associated\nnoise penalty, including the increased variance of unconstrained foreground moments, does not al-\nways guarantee optimal outcomes for the most complex foreground scenarios. Specifically, deproject-\ning foreground moments in the natural order of the Taylor expansion may not be optimal, particularly\nfor the moments that dominate the overall variance, which may be better suited for blind variance min-\nimization. To address this trade-off, we introduced an optimized variant of cMILC, named ocMILC\n(Section 4), which refines the deprojection process through a data-driven approach by optimizing the\nnumber and selection of moments to deproject, as well as pivot values and deprojection coefficients.\nIn ocMILC, the optimization of the number of moments to deproject, depending on sky areas\nand angular scales, relies on the GNILC diagnosis of data complexity (Section 3), which maps out\nthe number of independent observable modes of Galactic emission, mfgds, in the given data set across\nthe sky and at different angular scales (Figure 2 and Table 1). This diagnosis informs ocMILC on the\noptimal number of moments to deproject locally before paying significant noise penalties. This strat-\negy is corroborated by the results obtained in Figure 5. The specific subset of moments to deproject\nlocally is also optimized to retain some dominant moments for blind variance minimization, while\nselectively deprojecting higher-order moments that are not predominantly captured by covariance es-\n– 25 –\ntimation. The optimization of local pivot values of the dust spectral parameters across different sky\nregions and ranges of angular scales allows for accommodating local moment expansions associated\nwith local averaging processes. Finally, allowing the deprojection coefficients ϵk to be non-zero for\npartial deprojection of certain moments offers additional flexibility for limiting noise penalties. In\naddition, it allows to better handle with foreground modes not properly described by the moment\nexpansion of a single MBB SED. The optimal pivot values, subset of moments, and deprojection\ncoefficients are determined to minimize the denoised output variance (Equation 4.12), and hence the\nresidual foreground variance, in each GNILC cluster.\nTesting on simulated PICO data demonstrated ocMILC’s superiority over NILC in reducing\nGalactic contamination across all angular scales and all the considered thermal dust models over\nlarge sky fractions, while maintaining noise levels within the target sensitivity for the tensor-to-scalar\nratio (Figures 6-7). Furthermore, ocMILC outperformed the standard cMILC, showcasing its efficacy\nin handling diverse dust emission models, including the multi-layer dust model d12 with decorrela-\ntion, while controlling noise penalties. While current synchrotron emission models do not necessitate\npivot value optimization, the inclusion of mildly polarized AME emissions may require the incor-\nporation of AME moments into ocMILC, a potential avenue for future exploration given the lack of\nobservational evidence. Overall, ocMILC stands as a robust optimization for semi-blind CMB po-\nlarization reconstruction, offering promise for application to other satellite missions like LiteBIRD\n[5], with potential extensions to ground-based experiments [3, 4] through appropriate E-to-B leakage\ncorrections [67–69].\nAcknowledgments\nWe thank Marina Migliaccio and Domenico Marinucci for useful discussions. This research used\nresources of the National Energy Research Scientific Computing Center (NERSC), a U.S. Depart-\nment of Energy Office of Science User Facility located at Lawrence Berkeley National Laboratory.\nAC acknowledges funding support by AASS PhD Program, ASI/LiteBIRD grant n. 2020-9-HH.0\nand ASI/LiteBIRD grant CUP: F84I20000230005. AC was also supported by the InDark and Lite-\nBIRD INFN projects. MR thanks the Spanish Agencia Estatal de Investigaci´on (AEI, MICIU) for the\nfinancial support provided under the projects with references PID2019-110610RB-C21 and PID2022-\n139223OB-C2, and acknowledges support from the CSIC programme ‘Ayuda a la Incorporaci´on de\nCient´ıficos Titulares’ provided under the project 202250I159.\nA\nResults for PICO CBE sensitivities\nThroughout this paper, we adopted the baseline instrumental configuration of PICO, consistent with\nrequired specifications detailed in the PICO report [6], which provides an overall sensitivity of 0.87\nµK ·arcmin. In this appendix, we present NILC and ocMILC outcomes for the PICO d1 data set, em-\nploying the alternative PICO configuration known as CBE (Current Best Estimate) [6, 30], featuring\nan enhanced overall sensitivity of 0.61 µK · arcmin. The results are shown in Figure 9, showcasing\nthe angular power spectra of residuals averaged over all realizations and corresponding posteriors of\nthe estimated tensor-to-scalar ratio. Even with the increased sensitivity of the PICO CBE configura-\ntion, ocMILC still outperforms NILC, exhibiting lower foreground residuals across all angular scales\nwith only a moderate rise in noise contamination. As anticipated, the noise residuals in both NILC\nand ocMILC CMB B-mode reconstructions are lower compared to those obtained with the baseline\nPICO configuration (displayed in the top panel of Figure 6). Consequently, this leads to lower upper\nbounds on the estimated tensor-to-scalar ratio (r < 0.00025 at 95% CL), as shown in the right panel\n– 26 –\nof Figure 9. Furthermore, ocMILC improves upon the biased upper bound obtained with NILC for\nsuch a large sky fraction (70%). The ocMILC constraint aligns with the quoted forecast in [30] for\nPICO CBE sensitivities, albeit for a significantly larger sky fraction compared to [30].\n5\n10\n50\n100\n200\n500\n10\n9\n10\n7\n10\n5\n10\n3\n10\n1\nCBB [ K2]\nd1, fsky=70%, PICO CBE configuration\nNILC\nocMILC\nforegrounds\nnoise\nCMB input\nr\n[0.2 10\n3, 4 10\n3]\n10\n5\n10\n4\n10\n3\n10\n2\nr\n0.2\n0.4\n0.6\n0.8\n1.0\n/\nmax\nr=0.0002±0.0001\nr < 0.00025, 95% CL\nFigure 9. Same as the top panels of Figure 6, but for PICO CBE sensitivities. In both panels, the grey\nshaded area represents the range of values of the tensor-to-scalar ratio: r ∈ [0.0002, 0.004]. The lower bound\n(r = 0.0002) corresponds to the targeted sensitivity at 95% CL for PICO CBE configuration, while the upper\nbound (r = 0.004) roughly corresponds to the energy scale of Starobinski’s inflation model.\nReferences\n[1] Planck Collaboration, N. Aghanim, Y. Akrami, M. Ashdown, J. Aumont, C. Baccigalupi et al., Planck\n2018 results. VI. Cosmological parameters, A&A 641 (2020) A6 [1807.06209].\n[2] A. La Posta, U. Natale, E. Calabrese, X. Garrido and T. Louis, Assessing the consistency between cmb\ntemperature and polarization measurements with application to planck, act, and spt data, Phys.Rev.D\n107 (2023) 023510.\n[3] P. Ade, J. Aguirre, Z. Ahmed, S. Aiola, A. Ali, D. Alonso et al., The Simons Observatory: science goals\nand forecasts, JCAP 2019 (2019) 056 [1808.07445].\n[4] K. Abazajian, G. Addison, P. Adshead, Z. Ahmed, S.W. Allen, D. Alonso et al., CMB-S4 Science Case,\nReference Design, and Project Plan, arXiv e-prints (2019) arXiv:1907.04473 [1907.04473].\n[5] LiteBIRD Collaboration, E. Allys, K. Arnold, J. Aumont, R. Aurlien, S. Azzoni et al., Probing cosmic\ninflation with the LiteBIRD cosmic microwave background polarization survey, Progress of Theoretical\nand Experimental Physics 2023 (2023) 042F01 [2202.02773].\n[6] S. Hanany, M. Alvarez, E. Artis, P. Ashton, J. Aumont, R. Aurlien et al., PICO: Probe of Inflation and\nCosmic Origins, arXiv e-prints (2019) arXiv:1902.10541 [1902.10541].\n[7] Y. Qin, V. Poulin, A. Mesinger, B. Greig, S. Murray and J. Park, Reionization inference from the CMB\noptical depth and E-mode polarization power spectra, MNRAS 499 (2020) 550 [2006.16828].\n[8] Planck Collaboration, R. Adam, N. Aghanim, M. Ashdown, J. Aumont, C. Baccigalupi et al., Planck\nintermediate results. XLVII. Planck constraints on reionization history, A&A 596 (2016) A108\n[1605.03507].\n[9] R. Allison, P. Caucal, E. Calabrese, J. Dunkley and T. Louis, Towards a cosmological neutrino mass\ndetection, Phys.Rev.D 92 (2015) 123535 [1509.07471].\n[10] E. Giusarma, M. Gerbino, O. Mena, S. Vagnozzi, S. Ho and K. Freese, Improvement of cosmological\nneutrino mass bounds, Phys.Rev.D 94 (2016) 083522 [1605.04320].\n– 27 –\n[11] M. Kamionkowski, A. Kosowsky and A. Stebbins, A Probe of Primordial Gravity Waves and Vorticity,\nPhys.Rev.Lett 78 (1997) 2058 [astro-ph/9609132].\n[12] H.K. Eriksen, J.B. Jewell, C. Dickinson, A.J. Banday, K.M. G´orski and C.R. Lawrence, Joint Bayesian\nComponent Separation and CMB Power Spectrum Estimation, ApJ 676 (2008) 10 [0709.1058].\n[13] R. Stompor, S. Leach, F. Stivoli and C. Baccigalupi, Maximum likelihood algorithm for parametric\ncomponent separation in cosmic microwave background experiments, MNRAS 392 (2009) 216\n[0804.2645].\n[14] E. de la Hoz, P. Vielva, R.B. Barreiro and E. Mart´ınez-Gonz´alez, On the detection of CMB B-modes\nfrom ground at low frequency, JCAP 2020 (2020) 006 [2002.12206].\n[15] S. Azzoni, M.H. Abitbol, D. Alonso, A. Gough, N. Katayama and T. Matsumura, A minimal\npower-spectrum-based moment expansion for CMB B-mode searches, JCAP 2021 (2021) 047\n[2011.11575].\n[16] L. Vacher, J. Aumont, L. Montier, S. Azzoni, F. Boulanger and M. Remazeilles, Moment expansion of\npolarized dust SED: A new path towards capturing the CMB B-modes with LiteBIRD, A&A 660 (2022)\nA111 [2111.07742].\n[17] M. Galloway, K.J. Andersen, R. Aurlien, R. Banerji, M. Bersanelli, S. Bertocco et al.,\nBEYONDPLANCK. III. Commander3, A&A 675 (2023) A3 [2201.03509].\n[18] C.L. Bennett, R.S. Hill, G. Hinshaw, M.R. Nolta, N. Odegard, L. Page et al., First-Year Wilkinson\nMicrowave Anisotropy Probe (WMAP) Observations: Foreground Emission, ApJS 148 (2003) 97\n[astro-ph/0302208].\n[19] J. Delabrouille, J.F. Cardoso and G. Patanchon, Multidetector multicomponent spectral matching and\napplications for cosmic microwave background data analysis, MNRAS 346 (2003) 1089\n[astro-ph/0211504].\n[20] R. Fern´andez-Cobos, P. Vielva, R.B. Barreiro and E. Mart´ınez-Gonz´alez, Multiresolution internal\ntemplate cleaning: an application to the Wilkinson Microwave Anisotropy Probe 7-yr polarization data,\nMNRAS 420 (2012) 2162 [1106.2016].\n[21] J. Delabrouille, J.-F. Cardoso, M. Le Jeune, M. Betoule, G. Fay and F. Guilloux, A full sky, low\nforeground, high resolution CMB map from WMAP, A&A 493 (2009) 835 [0807.0773].\n[22] K. Ichiki, H. Kanai, N. Katayama and E. Komatsu, Delta-map method of removing CMB foregrounds\nwith spatially varying spectra, Progress of Theoretical and Experimental Physics 2019 (2019) 033E01\n[1811.03886].\n[23] M. Remazeilles, A. Rotti and J. Chluba, Peeling off foregrounds with the constrained moment ILC\nmethod to unveil primordial CMB B modes, MNRAS 503 (2021) 2478 [2006.08628].\n[24] A. Carones, M. Migliaccio, G. Puglisi, C. Baccigalupi, D. Marinucci, N. Vittorio et al., Multiclustering\nneedlet ILC for CMB B-mode component separation, MNRAS 525 (2023) 3117 [2212.04456].\n[25] K. Tassis and V. Pavlidou, Searching for inflationary B modes: can dust emission properties be\nextrapolated from 350 GHz to 150 GHz?, MNRAS 451 (2015) L90 [1410.8136].\n[26] J. Chluba, J.C. Hill and M.H. Abitbol, Rethinking CMB foregrounds: systematic extension of foreground\nparametrizations, MNRAS 472 (2017) 1195 [1701.00274].\n[27] V. Pelgrims, S.E. Clark, B.S. Hensley, G.V. Panopoulou, V. Pavlidou, K. Tassis et al., Evidence for\nline-of-sight frequency decorrelation of polarized dust emission in Planck data, A&A 647 (2021) A16\n[2101.09291].\n[28] M. Remazeilles, C. Dickinson, H.K.K. Eriksen and I.K. Wehus, Sensitivity and foreground modelling\nfor large-scale cosmic microwave background B-mode polarization satellite missions, MNRAS 458\n(2016) 2032 [1509.04714].\n– 28 –\n[29] G. Mart´ınez-Solaeche, A. Karakci and J. Delabrouille, A 3D model of polarized dust emission in the\nMilky Way, MNRAS 476 (2018) 1310 [1706.04162].\n[30] R. Aurlien, M. Remazeilles, S. Belkner, J. Carron, J. Delabrouille, H.K. Eriksen et al., Foreground\nseparation and constraints on primordial gravitational waves with the PICO space mission, JCAP 2023\n(2023) 034 [2211.14342].\n[31] U. Fuskeland, J. Aumont, R. Aurlien, C. Baccigalupi, A.J. Banday, H.K. Eriksen et al., Tensor-to-scalar\nratio forecasts for extended LiteBIRD frequency configurations, A&A 676 (2023) A42 [2302.05228].\n[32] Planck Collaboration, N. Aghanim, M. Ashdown, J. Aumont, C. Baccigalupi, M. Ballardini et al.,\nPlanck intermediate results. XLVIII. Disentangling Galactic dust emission and cosmic infrared\nbackground anisotropies, A&A 596 (2016) A109 [1605.09387].\n[33] K.M. G´orski, E. Hivon, A.J. Banday, B.D. Wandelt, F.K. Hansen, M. Reinecke et al., HEALPix: A\nFramework for High-Resolution Discretization and Fast Analysis of Data Distributed on the Sphere,\nApJ 622 (2005) 759 [astro-ph/0409513].\n[34] A. Zonca, L. Singer, D. Lenz, M. Reinecke, C. Rosset, E. Hivon et al., healpy: equal area pixelization\nand spherical harmonics transforms for data on the sphere in Python, The Journal of Open Source\nSoftware 4 (2019) 1298.\n[35] Planck Collaboration, N. Aghanim, Y. Akrami, M. Ashdown, J. Aumont, C. Baccigalupi et al., Planck\n2018 results. VI. Cosmological parameters, A&A 641 (2020) A6 [1807.06209].\n[36] B. Thorne, J. Dunkley, D. Alonso and S. Næss, The Python Sky Model: software for simulating the\nGalactic microwave sky, MNRAS 469 (2017) 2821 [1608.02841].\n[37] A. Zonca, B. Thorne, N. Krachmalnicoff and J. Borrill, The Python Sky Model 3 software, The Journal\nof Open Source Software 6 (2021) 3783 [2108.01444].\n[38] Planck Collaboration, R. Adam, P.A.R. Ade, N. Aghanim, M.I.R. Alves, M. Arnaud et al., Planck 2015\nresults. X. Diffuse component separation: Foreground maps, A&A 594 (2016) A10 [1502.01588].\n[39] A.M. Meisner and D.P. Finkbeiner, Modeling Thermal Dust Emission with Two Components:\nApplication to the Planck High Frequency Instrument Maps, ApJ 798 (2015) 88 [1410.7523].\n[40] B.T. Draine and B. Hensley, Magnetic Nanoparticles in the Interstellar Medium: Emission Spectrum\nand Polarization, ApJ 765 (2013) 159 [1205.7021].\n[41] Planck Collaboration, Y. Akrami, M. Ashdown, J. Aumont, C. Baccigalupi, M. Ballardini et al., Planck\n2018 results. IV. Diffuse component separation, A&A 641 (2020) A4 [1807.06208].\n[42] D.B. Rybicki and A.P. Lightman, Radiative Processes in Astrophysics (1979).\n[43] C.L. Bennett, D. Larson, J.L. Weiland, N. Jarosik, G. Hinshaw, N. Odegard et al., Nine-year Wilkinson\nMicrowave Anisotropy Probe (WMAP) Observations: Final Maps and Results, ApJS 208 (2013) 20\n[1212.5225].\n[44] M.A. Miville-Deschˆenes, N. Ysard, A. Lavabre, N. Ponthieu, J.F. Mac´ıas-P´erez, J. Aumont et al.,\nSeparation of anomalous and synchrotron emissions using WMAP polarization data, A&A 490 (2008)\n1093 [0802.3345].\n[45] V. Stolyarov, M.P. Hobson, A.N. Lasenby and R.B. Barreiro, All-sky component separation in the\npresence of anisotropic noise and dust temperature variations, MNRAS 357 (2005) 145\n[astro-ph/0405494].\n[46] M. Remazeilles, J. Delabrouille and J.-F. Cardoso, Foreground component separation with generalized\nInternal Linear Combination, MNRAS 418 (2011) 467 [1103.1166].\n[47] F.J. Narcowich, P. Petrushev and J.D. Ward, Localized tight frames on spheres, SIAM Journal on\nMathematical Analysis 38 (2006) 574 [https://doi.org/10.1137/040614359].\n[48] D. Marinucci, D. Pietrobon, A. Balbi, P. Baldi, P. Cabella, G. Kerkyacharian et al., Spherical needlets\nfor cosmic microwave background data analysis, MNRAS 383 (2008) 539 [0707.0844].\n– 29 –\n[49] L. Page, G. Hinshaw, E. Komatsu, M.R. Nolta, D.N. Spergel, C.L. Bennett et al., Three-Year Wilkinson\nMicrowave Anisotropy Probe (WMAP) Observations: Polarization Analysis, ApJS 170 (2007) 335\n[astro-ph/0603450].\n[50] N. Krachmalnicoff, E. Carretti, C. Baccigalupi, G. Bernardi, S. Brown, B.M. Gaensler et al., S-PASS\nview of polarized Galactic synchrotron at 2.3 GHz as a contaminant to CMB observations, A&A 618\n(2018) A166 [1802.01145].\n[51] L. Vacher, J. Chluba, J. Aumont, A. Rotti and L. Montier, High precision modeling of polarized signals:\nMoment expansion method generalized to spin-2 fields, A&A 669 (2023) A5 [2205.01049].\n[52] A. Rotti and J. Chluba, Combining ILC and moment expansion techniques for extracting average-sky\nsignals and CMB anisotropies, MNRAS 500 (2021) 976 [2006.02458].\n[53] D. Adak, A new approach of estimating the galactic thermal dust and synchrotron polarized emission\ntemplate in the microwave bands, MNRAS 507 (2021) 4618 [2104.13778].\n[54] S. Ghosh, Y. Liu, L. Zhang, S. Li, J. Zhang, J. Wang et al., Performance forecasts for the primordial\ngravitational wave detection pipelines for AliCPT-1, JCAP 2022 (2022) 063 [2205.14804].\n[55] Z. Zhang, Y. Liu, S.-Y. Li, H. Li and H. Li, A Constrained NILC method for CMB B mode observations,\narXiv e-prints (2023) arXiv:2309.08170 [2309.08170].\n[56] J. Dou, S. Ghosh, L. Santos and W. Zhao, Foreground removal with ILC methods for AliCPT-1, arXiv\ne-prints (2023) arXiv:2310.19627 [2310.19627].\n[57] E. Hivon, K.M. G´orski, C.B. Netterfield, B.P. Crill, S. Prunet and F. Hansen, MASTER of the Cosmic\nMicrowave Background Anisotropy Power Spectrum: A Fast Method for Statistical Analysis of Large\nand Complex Cosmic Microwave Background Data Sets, ApJ 567 (2002) 2 [astro-ph/0105302].\n[58] G. Polenta, D. Marinucci, A. Balbi, P. de Bernardis, E. Hivon, S. Masi et al., Unbiased estimation of an\nangular power spectrum, JCAP 2005 (2005) 001 [astro-ph/0402428].\n[59] D. Alonso, J. Sanchez, A. Slosar and LSST Dark Energy Science Collaboration, A unified pseudo-Cℓ\nframework, MNRAS 484 (2019) 4127 [1809.09603].\n[60] Y.S. Abylkairov, O. Darwish, J.C. Hill and B.D. Sherwin, Partially constrained internal linear\ncombination: A method for low-noise CMB foreground mitigation, Phys.Rev.D 103 (2021) 103510\n[2012.04032].\n[61] S. Hamimeche and A. Lewis, Likelihood analysis of CMB temperature and polarization power spectra,\nPhys.Rev.D 77 (2008) 103013 [0801.0554].\n[62] A. Kogut, Synchrotron Spectral Curvature from 22 MHz to 23 GHz, ApJ 753 (2012) 110 [1205.4041].\n[63] C. Dickinson, M. Peel and M. Vidal, New constraints on the polarization of anomalous microwave\nemission in nearby molecular clouds, MNRAS 418 (2011) L35 [1108.0308].\n[64] R. G´enova-Santos, J.A. Rubi˜no-Mart´ın, R. Rebolo, A. Pel´aez-Santos, C.H. L´opez-Caraballo, S. Harper\net al., QUIJOTE scientific results - I. Measurements of the intensity and polarisation of the anomalous\nmicrowave emission in the Perseus molecular complex, MNRAS 452 (2015) 4169 [1501.04491].\n[65] D. Herman, B. Hensley, K.J. Andersen, R. Aurlien, R. Banerji, M. Bersanelli et al., BEYONDPLANCK.\nXV. Limits on large-scale polarized anomalous microwave emission from Planck LFI and WMAP, A&A\n675 (2023) A15 [2201.03530].\n[66] R. G´enova-Santos, J.A. Rubi˜no-Mart´ın, A. Pel´aez-Santos, F. Poidevin, R. Rebolo, R. Vignaga et al.,\nQUIJOTE scientific results - II. Polarisation measurements of the microwave emission in the Galactic\nmolecular complexes W43 and W47 and supernova remnant W44, MNRAS 464 (2017) 4107\n[1605.04741].\n[67] S. Ghosh, J. Delabrouille, W. Zhao and L. Santos, Towards ending the partial sky E-B ambiguity in\nCMB observations, JCAP 2021 (2021) 036 [2007.09928].\n– 30 –\n[68] Z. Zhang, Y. Liu, S.-Y. Li, D.-L. Wu, H. Li and H. Li, Efficient ILC analysis on polarization maps after\nEB leakage correction, JCAP 2022 (2022) 044 [2109.12619].\n[69] A. Carones, M. Migliaccio, D. Marinucci and N. Vittorio, Analysis of Needlet Internal Linear\nCombination performance on B-mode data from sub-orbital experiments, A&A 677 (2023) A147\n[2208.12059].\n– 31 –\n"
}