{
    "optim": "1\nHBF MU-MIMO with Interference-Aware Beam\nPair Link Allocation for Beyond-5G mm-Wave\nNetworks\nAleksandar Ichkov∗, Alexander Wietfeld†, Marina Petrova‡ and Ljiljana Simi´c∗\n✦\nAbstract—Hybrid\nbeamforming\n(HBF)\nmulti-user\nmultiple-input\nmultiple-output (MU-MIMO) is a key technology for unlocking the\ndirectional millimeter-wave (mm-wave) nature for spatial multiplexing\nbeyond current codebook-based 5G-NR networks. In order to suppress\nco-scheduled users’ interference, HBF MU-MIMO is predicated on\nhaving sufficient radio frequency chains and accurate channel state\ninformation (CSI), which can otherwise lead to performance losses\ndue to imperfect interference cancellation. In this work, we propose\nIABA, a 5G-NR standard-compliant beam pair link (BPL) allocation\nscheme for mitigating spatial interference in practical HBF MU-MIMO\nnetworks. IABA solves the network sum throughput optimization via\neither a distributed or a centralized BPL allocation using dedicated\nCSI reference signals for candidate BPL monitoring. We present\na comprehensive study of practical multi-cell mm-wave networks\nand demonstrate that HBF MU-MIMO without interference-aware\nBPL allocation experiences strong residual interference which limits\nthe achievable network performance. Our results show that IABA\noffers significant performance gains over the default interference-\nagnostic 5G-NR BPL allocation, and even allows HBF MU-MIMO to\noutperform the fully digital MU-MIMO baseline, by facilitating allocation\nof secondary BPLs other than the strongest BPL found during initial\naccess. We further demonstrate the scalability of IABA with increased\ngNB antennas and densification for beyond-5G mm-wave networks.\nIndex Terms—Beyond-5G, millimeter-wave, HBF MU-MIMO, BPL allo-\ncation, interference mitigation.\n1\nINTRODUCTION\nThe spectrum-rich millimeter-wave (mm-wave) bands are\na key enabler for the capacity enhancement of 5G and\nBeyond-5G cellular networks [1], with 3GPP designating\nnumerous bands in the frequency range 2 (FR2) between\n24.5–71 GHz for commercial deployments [2]. Overcom-\ning the challenging propagation and blockage-prone nature\nof the mm-wave channel necessitates large antennas and\nbeamforming at the next generation node B (gNB) and the\n∗Aleksandar Ichkov and Ljiljana Simi´c are with the Institute for Networked\nSystems at RWTH Aachen University, Aachen 52072, Germany\n(e-mail: aic@inets.rwth-aachen.de, lsi@inets.rwth-aachen.de).\n†Alexander Wietfeld was with the Institute for Networked Systems at RWTH\nAachen University, Aachen, Germany. Now he is with the Chair of Communi-\ncation Networks at Technical University of Munich, Munich 80333, Germany\n(e-mail: alexander.wietfeld@tum.de).\n‡Marina Petrova is with the Institute for Networked Systems and the Mobile\nCommunications and Computing Teaching and Research Area at RWTH\nAachen University, Aachen 52072, Germany\n(e-mail: petrova@mcc.rwth-aachen.de).\nusers (UEs), and a new type of beam management, in which\nthe gNB and UE need to sweep their beam candidates se-\nquentially in order to establish connectivity via a directional\nbeam pair link (BPL) [3], [4].\nThe existing limited deployments of 5G-NR FR2 net-\nworks [5], [6] rely on codebook-based analog beamforming\n(CBF), as a low complexity and cost-effective solution, given\nthat digital beamforming (DBF) is prohibitively complex\nand costly for large antenna arrays requiring a dedicated\nradio frequency (RF) chain per antenna element [7]. How-\never, CBF limits the transmission/reception to a single beam\nper time slot and RF chain over the entire instantaneous\nbandwidth, i. e. constituting a time division multiple access\n(TDMA) system [8], which limits the per-UE throughput in\nmulti-UE networks. To better utilize the large bandwidth\nand directional nature of mm-wave links for beyond-5G\ndeployments, 5G-NR also specifies the use of hybrid beam-\nforming (HBF) with multiple RF chains to simultaneously\nserve multiple UEs via individual BPLs, i. e. spatial layers\nin a multi-user multiple input multiple output (MU-MIMO)\nconfiguration [8]. This improves the spectral efficiency as\nmultiple UEs are served with spatial division multiple ac-\ncess (SDMA) using the same time-frequency resources, and\nreduces latency as more UEs can be served simultaneously\ninstead of waiting for their TDMA time slot.\nUnlocking the full potential of mm-wave networks by\nefficiently sharing the network capacity via SDMA comes\nwith many challenges in real network deployments [9]. HBF\nMU-MIMO offers an attractive solution for mitigating the\nco-scheduled UE beam interference via digital precoding\nfor interference cancellation. However, the efficiency of HBF\nMU-MIMO is predicated on: (i) the antenna configuration\nhaving sufficient RF chains, (ii) the beam codebook having\nsufficient steering resolution and (iii) resource scheduling\nbeing dynamic and able to adapt to up-to-date channel\nstate information (CSI). In practice, the predefined gNB/UE\ncodebooks play a key role in acquiring accurate CSI. The\nmm-wave channel can only be observed through the code-\nbook entries which project the received RF signal to the\nbaseband [10], and should therefore be properly designed\nto provide sufficient gain and angular steering resolution\nto estimate the full channel matrix. Prior mm-wave net-\nworking studies on HBF MU-MIMO [11]–[18] have typically\nfocused on designing the digital precoder for interference\narXiv:2402.17573v1  [cs.NI]  27 Feb 2024\n2\nReference\nInterference\nChannel\nBeamforming\nMulti-cell\nIntra-cell\nInter-cell\nstudies\nmanagement\nmodel\nmodel\nnetwork\ninterference\ninterference\n[11]–[14]\nInterference cancellation\nGeometric\nHBF\n✗\n✗\nAdded-noise constant\n[15], [16]\nInterference cancellation\n3GPP, NYUSIM\nHBF\n✓\n✗\nEstimate\n[17], [18]\nInterference cancellation\nGeometric\nHBF\n✓\n✗\nAdded noise-constant\n[20], [21]\nSpatial BPL allocation\n3GPP, NYUSIM\nIdealized\n✓\n✗\nEstimate\n[22], [23]\nSpatial BPL allocation\nLog-distance (LOS only)\nIdealized\n✓\n✗\nEstimate\n[24], [25]\nSpatial BPL allocation\n3GPP, NYUSIM\nCBF\n✓\nEstimate\nEstimate\n[26]\nSpatial BPL allocation\n3D ray-tracing\nCBF\n✓\n✓\n✓\nThis paper\nBoth\n3D ray-tracing\nHBF\n✓\n✓\n✓\nTABLE 1: Related work on interference management approaches for mm-wave SDMA networks.\ncancellation assuming availability of perfect CSI at the gNB.\nIn practice, CSI reporting is time consuming and subject\nto the gNB/UE codebooks, network control signaling and\nlatency constraints [11], [12], which can lead to system\nperformance degradation of HBF MU-MIMO due to imper-\nfect interference cancellation, e. g. [13], [16]. Moreover, [19]\ndemonstrates that even under ideal digital precoding, there\nis still a considerable amount of strong residual inter-cell\ninterference, which is highly dependent on the multi-UE\nBPL allocation for the network. A number of mm-wave\nSDMA studies [20]–[26] have instead focused on clustering\nco-scheduled UEs that can be served via spatially sepa-\nrated BPLs for SDMA gains, using CBF with a sufficient\nnumber of individual antenna arrays to serve all UEs.\nHowever, [25], [26] have shown that under realistic antenna\nand channel models, CBF entails strong residual interference\nwhich limits the extent of achievable BPL separation and\nSDMA gains. Interference management in practical mm-\nwave SDMA networks should therefore jointly consider the\nMU-MIMO interference cancellation and spatial BPL allocation.\n1.1\nRelated Work\nThe prior literature of these two main approaches for inter-\nference management in mm-wave SDMA networks is sum-\nmarized in Table 1. The first approach relies on designing\na co-scheduled UE precoder for interference cancellation\nbased on CSI at the gNB using HBF MU-MIMO [11]–[18].\nThe second approach focuses on interference-aware and\nload-balancing multi-UE BPL allocation using CBF serving\nUEs via individual antenna arrays [20]–[26].\nInterference management for HBF MU-MIMO [11]–[18]\ntypically treats the UE co-scheduling problem within a\nsingle cell [11]–[14], or limited multi-cell scenarios [15]–[18],\ndesigning the digital baseband precoder, e. g. zero-forcing,\nunder the assumption of a sufficient number of RF chains\nand availability of perfect CSI at the gNB. This is not\nalways guaranteed in practice, which can lead to perfor-\nmance degradation due to imperfect CSI and in turn only\npartial interference cancellation [13]. Authors in [14] show\nthe SDMA performance gains of HBF MU-MIMO over CBF\nand study the end-to-end network implications. However,\nthey only consider a single gNB serving seven UEs, and\nstill show that the network suffers from significant control\noverhead and delay of acquiring full per-UE CSI. Authors\nin [15]–[18] consider HBF MU-MIMO in limited multi-cell\nnetwork scenarios. [15] proposes a HBF MU-MIMO frame-\nwork based on full CSI and multi-cell cooperation, showing\nthat non-coordinated can outperform fully-coordinated HBF\nMU-MIMO under availability of only quantized CSI [16].\nAuthors in [17] propose a near interference-free UE schedul-\ning (NIF), with [18] further generalizing the NIF frame-\nwork for different SDMA optimization objectives, assuming\nperfect intra-cell interference cancellation and very limited\ninter-cell interference. However, [17], [18] only assume in-\nterference as an added noise constant, and UEs with only\nline-of-sight (LOS) links to their serving gNB and non-\nLOS (NLOS) links to the other interfering gNBs. Impor-\ntantly, [15]–[18] assume perfect coordination and synchro-\nnization between the gNBs, and neglect the practical over-\nhead and delay constraints of obtaining full per-UE channel\nestimates, and thus only demonstrate HBF MU-MIMO per-\nformance under idealized network conditions.\nInterference management in CBF mm-wave SDMA net-\nworks focuses on spatial BPL allocation for clustering co-\nscheduled UEs that can be sufficiently spatially separated,\ne. g. [20]–[26]. Authors in [20]–[22] demonstrate SDMA\ngains when sufficient BPL separation can be maintained\nto effectively eliminate intra-cell interference, whereas [23]\nmodels the interference in the angular domain but considers\nLOS links only. However, the studies in [20]–[23] rely on\nstatistical channel models and idealized sector antennas,\nthat neglect the spatial distribution of feasible BPLs and the\nresulting interference implications. Authors in [24] propose\na CBF approach using codebooks with low inter-beam over-\nlap, and show that it can outperform HBF MU-MIMO as-\nsuming quantized CSI feedback. However, [24] only consid-\ners a single gNB serving UEs based on sum-rate clustering\nand only estimates the interference as added noise. The au-\nthors in [25] propose a load-balancing UE association which\nswaps the worst gNB-UE connection (WCS) at each itera-\ntion considering the per-slot interference estimate. In [26]\nwe show that under realistic channel considerations, the\nnon-negligible sidelobes of realistic arrays result in signif-\nicant intra-cell interference which strongly limits the SDMA\ngains. Additionally, [26] proposes an interference-aware BPL\nallocation for CBF SDMA networks which outperforms the\nWCS benchmark [25]. In particular, [26] demonstrates the\nbenefits of spatial BPL allocation by using secondary BPLs\nfor interference mitigation, going beyond the default 5G-NR\nassociation to the strongest BPL found during initial access\ntypically considered in the literature, e.g. [13]–[18], [24], [25].\n1.2\nContributions\nIn this paper, we extend beyond the prior literature\n(cf. Table. 1) and propose an interference-aware BPL allo-\ncation (IABA) for practical mm-wave HBF MU-MIMO net-\nworks that goes beyond the default 5G-NR association to the\nstrongest BPL found during initial access. We are thus the\n3\nfirst to jointly consider MU-MIMO interference cancellation\nand spatial BPL allocation for interference management in\npractical mm-wave HBF MU-MIMO networks. The main\ncontributions of this work are as follows:\n• We present an extensive study of multi-cell mm-wave\nHBF MU-MIMO networks based on site-specific chan-\nnel data obtained via 3D ray-tracing with realistic\nbuilding and antenna models, the accuracy of which\nwe have validated against real-world phased antenna\narrays measurements [27], [28], and network config-\nuration following 3GPP specifications for multi-sector\nantennas, initial access and channel estimation [29].\n• We therefore characterize the residual intra- and inter-\ncell interference in practical mm-wave HBF MU-MIMO\nnetworks, given the spatial distribution of feasible BPLs\nand 5G-NR CSI signaling, showing that interference\nbecomes the main limiting factor of HBF MU-MIMO\nperformance, which is in contrast to prior studies as-\nsuming limited to no-interference operation [15]–[18].\n• We propose IABA, a 5G-NR-compliant BPL allocation,\nas a solution for mitigating the spatial interference\nin practical mm-wave HBF MU-MIMO networks. We\nsolve the network sum throughput optimization objec-\ntive via either a distributed or a centralized BPL allocation\nusing dedicated channel state information-reference\nsignal (CSI-RS) resources for candidate BPL monitoring.\n• Our results show that IABA offers significant net-\nwork performance gains over default 5G-NR, by fa-\ncilitating allocation of secondary BPLs other than the\nstrongest BPL found during initial access. We further\ndemonstrate that under realistic CSI signaling con-\nstraints, IABA allows HBF MU-MIMO to outperform\nthe interference-agnostic DBF MU-MIMO baseline.\n1.3\nOrganization of the paper\nThe rest of this paper is organized as follows. Sec. 2 details\nthe system model considerations, including channel and\nmulti-panel antenna models, beamforming, channel estima-\ntion and multi-UE interference cancellation, and presents\nkey performance evaluation metrics. Sec. 3 presents the BPL\nallocation problem and our IABA algorithm and 5G-NR-\ncompliant operation. Sec. 4.1 presents the simulation model,\nand Sec. 4.2 presents the results. Sec. 5 concludes the paper.\n2\nSYSTEM MODEL\n2.1\nmm-Wave Channel Model\nWe model the 3D directional mm-wave channel between the\ngNB and the UE as a set of K LOS and NLOS propagation\npaths using the geometric channel model [30]. Assuming\na gNB as the transmitter with Nt antenna elements and a\nUE as the receiver with Nr antenna elements, we define the\ngeometric Nr × Nt channel matrix H as\nH =\nr\nNrNt\nK\nK\nX\nk=1\nαkar (ϕr\nk, θr\nk) aH\nt\n\u0000ϕt\nk, θt\nk\n\u0001 ,\n(1)\nwhere αk denotes the complex channel gain of the kth path,\nand {ϕt\nk, θt\nk} and {ϕr\nk, θr\nk} denote the angle of departure\n(AoD) and angle of arrival (AoA) in azimuth and eleva-\ntion, respectively. The transmit and receive antennas are\n−90\n−60\n−30\n0\n30\n60\n90\n−20\n0\n20\nϕ (◦)\nG (dBi)\nFig. 1: Example codebook with 16 beams for a sector\nantenna covering the steering range of ϕ ∈ (−45◦, 45◦).\ndescribed by their steering vectors at and ar, which are\nidentical to the phase-shifting weights applied to steer the\nantenna arrays towards the AoD and AoA, respectively [10].\nFor the special case of an N element uniform linear\narray (ULA) positioned along the y-axis and steered towards\nangle ϕ in azimuth, the array steering vector is given as\naULA(ϕ) =\n1\n√\nN\nh\n1 ej2π d\nλ sin(ϕ) · · · ej(N−1)2π d\nλ sin(ϕ)iT\n. (2)\nWe generalize it to a uniform rectangular array (URA) in the\ny-z plane, with the array steering response given as\naURA(θ, ϕ) = ah, ULA(ϕ) ⊗ av, ULA(θ),\n(3)\nwhere ⊗ denotes the Kronecker product of the horizontal\nsteering vector determining the azimuth response ah, ULA(ϕ)\nand the vertical steering vector for the elevation response\nav, ULA(θ) of a same sized ULA (2).\nFinally, we express the downlink received signal y as\ny = wH\nc HWps + wH\nc n,\n(4)\nwhere wH\nc denotes the Hermitian of the combining vector,\nWp denotes the precoding matrix, s denotes the data stream\nvector, and n denotes the noise vector.\nWe use an open-source mm-wave ray-tracing tool to\nobtain site-specific directional channel data based on real\n3D building and antenna models [27], [28]. We perform ded-\nicated ray-tracing runs for each gNB position in our multi-\ncell network (cf. Sec. 4.1), considering free-space propaga-\ntion and strong reflections (up to two-bounces) as dominant\npropagation mechanisms; diffraction is neglected due to its\nlimited role at mm-wave [31]. The ray-tracing output is used\nto reconstruct the channel matrix as per (1).\n2.2\nMulti-Panel Antenna & Beamforming Model\nFor the transmit/receive antennas, we employ the multi-\npanel antenna model [29], where the gNB/UE is equipped\nwith Nsec = 4 sector antenna panels, each covering one\nsector/quadrant of the angular space. We assume that the\ngNB/UE has unified control over all its multi-panel anten-\nnas, which have a fixed initial orientation. To steer the in-\ndividual beams, we assume predefined codebooks for each\nsector antenna panel, Cg\nsec at the gNB and Cu\nsec at the UE of\nsize nq bits, which consist of 2nq beams covering the angular\nsteering range of ±45◦, following 3GPP’s specifications in\nTable. 7.3-1 in [29]. An example of such a sector antenna\ncodebook consisting of 16 beams is shown in Fig. 1.\nFor the beamforming, we assume a fully-connected HBF\narchitecture at the gNB, mapping all RF chain outputs per\n4\nDigital \nBeamformer\nAnalog \nBeamformer\nRF chain\nRF chain\nRF chain\nMultiple\nUE streams\nNt\nNu\nRF chain\nRF chain\nAnalog \nBeamformer\nNg\nRF,sec  \nNg\nRF = Nsec Ng\nRF,sec \nNg\nRF,sec  \nNt\nUE 4\nl4,1\nl3,1\nl2,1\nUE 3\nUE 2\nUE 1\nii CBF architecture at the UE with Nsec= 4 sector panels,\neach consisting of Nr antenna elements, and Nu\nRF = 1 RF chain.\nPower\namplifiers\nl1,1\ni. Fully-connected HBF archicture at the gNB with Nsec= 4  sector panels, \neach consisting of Nt antenna elements and NRF,sec RF chains.\nsector #1\nsector #4\nsector #3\nsector #3\nLow noise\namplifiers\nAntenna\nweights\nVariable gain \namplifiers\nNr\nNr\nReceiver\nprocessing\nSumming \nfunction\nsector #4\nsector #1\nsector #2\nUE 6\nl6,1\nsector #1\nUE 5\nl5,1\nsector #1\ngNB sector #1\ngNB sector #2\nBPL\nFig. 2: Illustration of a mm-wave network, with an example scenario of a gNB simultaneously serving Nu = 6 UEs. The\ngNB is using a fully-connected HBF architecture with Nsec = 4 sector panels each equipped with Nt antenna elements\nand N g\nRF,sec = 4 RF chains, i. e. the gNB can simultaneously serve up to N g\nRF = 16 UEs . For clarity, we only illustrate\ntwo out of the four gNB sector panels, with four UEs being served by sector #1 and two UEs served by sector #2. The UEs\nuse a CBF architecture with Nsec = 4 sector panels, each equipped with Nr antenna elements, and N u\nRF = 1 RF chain.\nsector panel onto a common analog beamformer, which\napplies a sum of all phase-shifting outputs to each of the\nNt elements of the sector antenna panel, as shown in Fig. 2.\nEach RF chain controls a part of the overall sector antenna\npanel, with a total of N g\nRF,sec RF chains per panel. Thus, the\nmaximum number of UEs that can be served simultaneously\nat the gNB is constrained by the total number of RF chains ,\ni. e. Nu ≤ N g\nRF , where N g\nRF = NsecN g\nRF,sec. At the UE, we\nassume a CBF architecture following 5G-NR specifications\nin [29], such that each UE is equipped with N u\nRF = 1\nRF chain controlling Nsec = 4 sector antenna panels, each\nconsisting of Nr antenna elements, as shown in Fig. 2.\n2.3\nInitial Access: Initial Serving BPL Selection\nSteering the antenna beams to the correct orientation for\nestablishing a mm-wave BPL necessitates beam training [3].\nA mm-wave BPL li,j is defined by the UE i, the serving\ngNB j, and the respective steering orientations at the gNB\n{ϕj\nli,j, θj\nli,j} and the UE {ϕi\nli,j, θi\nli,j}. We follow the 5G-NR\ninitial access as our beam training procedure [3], and assume\ndownlink control operation based on an exhaustive beam\nsweep over the codebook entries of Cj at gNB j and Ci\nat UE i, where Cj =\nNsec\nS\nsec=1\nCj\nsec and Ci =\nNsec\nS\nsec=1\nCi\nsec denote\nthe complete gNB and UE codebooks consisting of all the\nentries for each sector antenna codebook. The initial serving\nBPL li,j for UE i is then selected out of the finite set of\nfeasible BPLs found during initial access over all gNBs,\nNl,i = S\nj∈G\n|Cj|\nS\nn=1\n|Ci|\nS\nm=1\nli,j,n,m as the one which maximizes the\nsynchronization signal block (SSB) reference signal received\npower (RSRP), and is determined as\nli,j ←\nargmax\nli,j∈Nl,i\n∀wp,li,j ∈Cj\n∀wc,li,j ∈Ci\nPSSB\n\r\r\rwH\nc,li,jHi,jwp,li,j\n\r\r\r\n2\n, ∀j ∈ G (5)\nwhere PSSB denotes the SSB transmit power, G denotes the\nset of gNBs in the network, and wp,li,j and wc,li,j denote the\nprecoding and combining vectors applied to steer the arrays\ntowards the AoD and AoA of the BPL li,j, respectively.\n2.4\nChannel Estimation\nThe exhaustive beam sweep of the finite gNB/UE code-\nbooks determines the steering orientations of the candidate\nBPLs that best correspond to the real AoD/AoA of the K\nLOS/NLOS channel propagation paths in (1), within the\nmargins of the codebook steering resolution. To accommo-\ndate for the inaccurate angular information during channel\nestimation, we use the wide-angle steering codebook which\ngenerates variable beamwidth patterns to fit a desired steer-\ning resolution for a given antenna array [32], i. e. resulting in\nquantized channel estimates due to use of codebooks with\nfinite steering resolution. Specifically, for both the gNB and\nthe UE, we may define an azimuth steering codebook Cϕ of\nsize nq bits, which is able to distinguish between 2nq angles\nover the range of 90◦ for each of the Nsec = 4 antennas.\nSimilarly, we may define an elevation steering codebook Cθ\nof size nq − 1 bits over the range of 180◦ for each of the\nNsec = 4 antennas. The finite channel estimation resolution\nover the azimuth/elevation steering ranges is thus given as\nϕres =\n360◦\nNsec · 2nq ,\nθres =\n180◦\nNsec · 2nq−1 .\n(6)\nThe quantized angle estimates of the real AoD for the\nchannel propagation paths in (1) are defined as\nˆϕi,k = argmin\nϕ∈Ci\nϕ\n\r\rϕ − ϕt\nk\n\r\r , ˆθi,k = argmin\nθ∈Ci\nθ\n\r\rθ − θt\nk\n\r\r ,\n(7)\nwhere the same principle holds equivalently for the\nAoD/AoA and each channel propagation path k in (1). We\nnote that the use of finite resolution codebooks results in\nan inability to distinguish individual channel paths with the\nsame quantized angles. In such cases, the channel estimation\nalgorithm reports a single path with quantized parameters,\ni. e. the individual paths are merged into one known path\n5\nand their complex gains are combined. Finally, the estimated\nchannel matrix ˆHi for UE i is given as\nˆHi =\n\n\n\nˆH1,1\n· · ·\nˆH1,4\n...\n...\n...\nˆH4,1\n· · ·\nˆH4,4\n\n\n,\n(8)\nwhere e. g. ˆH1,4 ∈ CNr×Nt denotes the estimated channel\nmatrix between the first sector antenna panel of UE i and\nthe fourth sector antenna panel at the serving gNB j.\nFollowing 3GPP’s specifications, we distinguish between\ngNB/UE codebooks used for channel estimation and initial\naccess, as well as reference signals used for each proce-\ndure [33]. Assuming downlink operation using the same\ncodebook for channel estimation and initial access, the\nnumber of reference signals for CSI reporting is limited\nto 64, in line with 3GPP specifications for the number of\nSSBs at FR2 [3]. In 5G-NR HBF MU-MIMO terms [33], this\ncorresponds to CSI reporting for Type-II codebooks with no\noversampling and a sector antenna codebook size of nq = 4\nbits, i. e. 16 beams per each of the four sector antennas and\n64 beams in total. Type-II codebooks also support a more\ndetailed CSI-RS-based reporting [34], with an oversampling\nfactor of up to four for both azimuth and elevation, making\na codebook size of nq = 6 bits also feasible, i. e. 64 beams\nper each of the four sector antennas and a total of 256 beams.\nIn Sec. 4.2 we vary the size of the gNB/UE codebooks\nused for channel estimation, and study the corresponding\naccuracy of the estimated channel matrix which is then\nused for designing the digital baseband precoder for multi-\nUE interference cancellation (cf. Sec. 2.5). We additionally\nconsider as a reference the ideal case, where the channel\nestimates are acquired using an infinite resolution codebook\nnq = ∞, such that the channel path angles and complex\ngains are assumed to be perfectly known, i. e. ˆH = H.\n2.5\nMulti-User Interference Cancellation\nThe computation of the precoding weights for serving the\nmultiple UEs at the gNB is split into two stages, as per [13].\nIn the first stage, following the initial exhaustive beam\nsweep, the codebook entries which maximize the RSRP are\nselected to steer the arrays at the gNB wp, RF,i, and the UE\nwc,i, towards the AoD/AoA of the serving BPL li,j (5).\nIn the second stage, we need to compute the effective\nchannel for each UE i based on the estimated channel ˆHi (8).\nFor this, we use the precoding wp, RF,i and combining wc,i\nvectors from the first stage, as\nˆHeff,i = wH\nc,i ˆHiWp,RF,\n(9)\nwhere Wp,RF ←\n\u0002wp,RF,1 · · · wp,RF,Nu\n\u0003\ndenotes the aggregate\nRF precoding matrix for the Nu UEs served by the gNB.\nEach UE feeds this channel information back to the gNB,\nwith the effective channel vector reflecting a drastically\nreduced dimensionality, i. e. Nu ≪ NsecNt. We note that\nthe accuracy of the effective channel depends on the esti-\nmated channel matrix ˆHi, which is dictated by the gNB/UE\ncodebooks used for channel estimation (cf. Sec. 2.4).\nThe gNB then designs the digital baseband precoder\nbased on the UE channel feedback using zero-forcing for\nmulti-UE interference cancellation as\nWp,BB = ¯H\n\u0000 ¯HH ¯H\n\u0001−1 ,\n(10)\nwhere ¯H =\nh\nˆHH\neff,1 · · · ˆHH\neff,Nu\ni\nrepresents the aggregated\neffective channels for the Nu UEs. The resulting baseband\nprecoding vectors for each UE i are then normalized to fulfill\nthe power constraint, wp,BB,i =\nwp,BB,i\n∥Wp,RFwp,BB,i∥F , where ∥ ∥F\ndenotes the Frobenius norm.\nFinally, the individual precoding vector wp,i for UE i in (4)\nis generated by multiplying the RF and baseband precoding,\nwp,i = Wp,RFwp,BB,i,\n(11)\nwith Wp,RF ∈ CNsecNt×Nu and wp,BB,i ∈ CNu×Nu.\nEffectively, the gNB precoder in the case of HBF maps\nthe Nu UE streams to the N g\nRF RF chains, thus significantly\nreducing the complexity compared to DBF.\n2.6\nPerformance Evaluation Metrics\nThe signal-to-interference-plus-noise-ratio (SINR) for UE i\nserved by gNB j via the serving BPL li,j is given as\nSINRi =\nRSSi\nIintra,i + Iinter,i + N ,\n(12)\nwhere N denotes the noise power, consisting of thermal\nnoise over the system bandwidth plus a noise figure, and\nthe received signal strength (RSS) is given by\nRSSi = Pi∥wH\nc,iHi,jwp,i∥2,\n(13)\nwhere Pi denotes the gNB transmit power allocated to UE i\nwith the total transmit power Pmax equally shared among\nall allocated UEs at the gNB, and the precoding wp,i and\ncombining wc,i vectors determined as in Sec. 2.5.\nWe define the intra-cell interference Iintra,i and inter-cell\ninterference Iinter,i for UE i served by gNB j as\nIintra,i = PU∥wH\nc,iHi,jWj\np∥2,\n(14)\nIinter,i = PU∥wc,i\nX\ng̸=j\nHi,gWg\np∥2,\n(15)\nwhere PU denotes the gNB transmit power allocated to each\nUE and Wj\np =\n\u0002wp,1, · · · , wp,Nu\n\u0003\ndenotes the precoding\nmatrix for the Nu UEs served by the gNB.\nLastly, to map the SINRi to the achievable throughput\nRi, we adopt the wideband 5G-NR model [5] using an\nattenuated, truncated Shannon bound as\nRi =\n\n\n\n0\nSINRi < SINRmin,\nRmax\nSINRi ≥ SINRmax,\nαB log2(1 + SINRi)\notherwise,\n(16)\nwhere α = 0.75 represents the implementation losses,\nB = 400 MHz denotes the bandwidth, SINRmin = −5 dB\ndenotes the coverage threshold and SINRmax = 20.05 dB\nis the SINR required to get the maximum achievable\nthroughput of Rmax = 2 Gbps.\n3\nMULTI-USER\nBPL\nALLOCATION\nIN\nHBF\nMU-MIMO MM-WAVE NETWORKS\n3.1\nBPL Allocation Problem\nAssuming that a UE is only served by a single gNB via\none BPL, we formulate the multi-UE BPL allocation that\nmaximizes the network sum throughput as\nL = argmax\nL⊂Nl\nX\ni∈U\nRi,\n(17)\n6\ns.t. SINRi ≥ SINRmin, ∀i ∈ L\n(18a)\n|Lj| ≤ N j\nRF , ∀j ∈ G\n(18b)\nX\ni∈Lj\nPi ≤ Pmax, ∀j ∈ G\n(18c)\nwhere\nL\ndenotes\nthe\nset\nof\nallocated\nBPLs\nand\nNl =\nNUE\nS\ni=1\nNl,i denotes the set of candidate BPLs for all UEs.\nThe constraint in (18a) denotes the coverage threshold for\nBPL allocation. The constraint in (18b) denotes the maxi-\nmum number of UEs that can be served simultaneously on\neach gNB. The constraint in (18c) denotes the gNB transmit\npower allocation, with the total power equally split among\nthe served UEs. We note that the combinatorial allocation\nproblem (17) can be solved by exhaustive search, but this is\ncomputationally infeasible for all but very small networks.\n3.2\nIABA: Interference-Aware BPL Allocation\nWe propose IABA, an interference-aware BPL allocation\nscheme which aims to mitigate spatial interference in HBF\nMU-MIMO mm-wave networks and maximize the net-\nwork sum throughput (17). IABA is fully 5G-NR-compliant,\nand relies on monitoring candidate BPLs via a centralized\nCSI-RS allocation, i. e. cIABA, or a distributed, per-gNB\nCSI-RS allocation, i. e. dIABA. The detailed step-by-step\noperation of IABA is as follows (cf. Alg. 1).\nIn the first step, the set of candidate BPLs Nl,i for each\nUE i is established following the exhaustive beam sweep\nof the gNB/UE codebooks during initial access. The UE is\ninitially associated to the gNB which provides the strongest\nBPL as per (5). In the second step, the network sets up\nthe monitoring of candidate BPLs by allocating dedicated\nCSI-RS resources. Each UE can monitor up to NCSI−RS\nBPLs, either solely on the serving gNB using dIABA or over\nthe complete network using cIABA. In the third step, the\nmulti-UE BPL allocation is executed by selecting among\nthe NCSI−RS monitored BPLs using CSI-RS measurement\nreporting. The precoding/combining weights are computed\nfor each new candidate BPL using (9)–(11), taking into\naccount all previously allocated BPLs on the serving gNB.\nFollowing this, the network updates the SINR of the co-\nallocated BPLs, i. e. solely on the serving gNB for dIABA\nor across all gNBs for cIABA. The decision on whether the\ncandidate BPL is allocated is then made in an interference-\naware manner, as follows. If none of the previously allocated\nBPLs are degraded below the coverage threshold (18a), and\nthe gNB has enough physical resources to serve all allocated\nUEs (18b), the candidate BPL is provisionally allocated\nto CSINRi. Otherwise, the candidate BPL is discarded. Once\nthe NCSI−RS candidate BPLs for the UE have been checked,\nthe candidate BPL in CSINRi providing the highest SINR\nis allocated to the final BPL allocation set L. If none of the\ncandidate BPLs are eligible for allocation, the UE is dropped.\nIn Sec. 4.2, we evaluate the proposed IABA against the\ndefault interference-agnostic 5G-NR baseline, where each\nUE is allocated its strongest BPL as found during initial\naccess (Step 1 of Alg. 1), such that new allocations can\nlead to previously allocated BPLs being dropped from the\nnetwork due to excessive interference.\nAlgorithm 1 Interference-Aware BPL Allocation (IABA)\nInitialize: U, G, L, Cg, Cu, N g\nRF , N u\nRF , NCSI−RS.\n1: Step 1. Initial user association\n2: for each UE i in U do\n3:\nNl,i = S\nj∈G\n|Cj|\nS\nn=1\n|Ci|\nS\nm=1\nli,j,n,m, set of all candidate BPLs.\n4:\nli,c ← argmax\nli,c∈Nl,i\nRSSi, initial serving BPL on gNB c (5).\n5: Step 2. CSI-RS candidate BPL monitoring\n6: for each UE i in U do\n7:\nif (distributed IABA) then\n8:\nCl,i ← sort\nRSS (Nl,i,c), sorted set of candidate BPLs on\nthe initial serving gNB c.\n9:\n|Cl,i| = NCSI−RS, limit number of monitored BPLs.\n10:\nelse (centralized IABA)\n11:\nCl,i ← sort\nRSS (Nl,i), sorted set of all candidate BPLs.\n12:\n|Cl,i| = NCSI−RS, limit number of monitored BPLs.\n13: Step 3. Multi-UE BPL allocation\n14: for each UE i in U do\n15:\nCSINRi = {}, provisional BPL allocation set for UE i.\n16:\nfor each li,j in Cl,i do\n17:\nCompute precoding/combining weights (9)–(11):\n18:\n{wp,k}\n|Lj|+1\nk=1\n, {wc,k}\n|Lj|+1\nk=1\n, ∀k ∈ {L, li,j}.\n19:\nUpdate metrics of allocated BPLs (12):\n20:\nif (distributed IABA) then\n21:\nSINRk, ∀k ∈ {Lj, li,j}.\n22:\nelse (centralized IABA)\n23:\nSINRk, ∀k ∈ {L, li,j}.\n24:\nProvisional BPL allocation:\n25:\nif (SINRk ≥ SINRmin & |Lj| ≤ N j\nRF ), ∀k ∈ L then\n26:\nCSINRi = {CSINRi, li,j}.\n27:\nelse\n28:\ncontinue\n29:\nif empty(CSINRi) then\n30:\ndrop UE i from network.\n31:\nelse\n32:\nli,j ←\nargmax\nli,j∈CSINRi\nSINRi,\nL ← li,j.\nOutput: L, final BPL allocation set.\nComplexity Analysis: Considering closely the multi-UE\nBPL allocation in Step 3 in Alg. 1, line 21/23 have the\nhighest cost due to the computation of the updated SINR\nfor all co-allocated BPLs. This involves the multiplication\nof the updated combining, channel, and precoding matrices\nas per (12), which is of complexity order O(N 2\nt ) [11]. We\nnote that the selection of the serving BPL for each UE i is\nthen done in line 32 in Alg. 1 by finding the maximum SINR\nBPL in the provisional allocation set CSINRi, which requires\n|CSINRi|log(|CSINRi|) computations.\ndIABA\nruns\nindependently\non\neach\ngNB,\nhaving\n|Cl,i|NUE/NgNB iterations on average, where NUE = |U|\nand NgNB = |G|. In each iteration, the candidate BPLs\nfor each associated UE are checked, in total |Cl,i| ≤ K,\nwhere K denotes the number of channel propagation paths\nbetween UE i and its serving gNB j in (1). We note that\nthe exact number of candidate BPLs between a UE and its\nserving BS depends on their relative positions, site-specific\nchannel and codebook considerations. The computational\ncomplexity of dIABA is thus given as O\n\u0010\nK N 2\nUE\nNgNB N 2\nt\n\u0011\n.\ncIABA runs a single loop with NUE iterations, con-\nsidering potentially all candidate BPLs over the complete\n7\nnetwork, which constitutes |Cl,i|NgNB ≤ KNgNB repeti-\ntions of SINR calculations. The computational complexity\nof cIABA is thus given as O\n\u0000KNgNBN 2\nUEN 2\nt\n\u0001 .\nThis shows that with network densification, the com-\nputational complexity of the centralized allocation cIABA\nscales with O(N 2\nUENgNB), whereas for dIABA it scales with\nO(N 2\nUE/NgNB).\nFor the default 5G-NR BPL allocation, the calculation for\neach UE involves NUE/NgNB calculations on the serving\ngNB, as we need to calculate the SINR for all allocated BPLs\nincluding the new one, but only for the per-UE best RSS BPL\nfound during initial access; this is done for every gNB so in\ntotal NgNB iterations. Thus, the computational complexity\nof default 5G-NR is given as O\n\u0010\nN 2\nUE\nNgNB N 2\nt\n\u0011\n.\n3.3\n5G-NR-Compliant IABA Operation\nThe proposed IABA is fully compliant with the 5G-NR\nstandard, and relies solely on standardized reference signals\nfor dedicated channel measurements (CM) and interference\nmeasurements (IM) [35]. The detailed step-by-step 5G-NR\nstandard-compliant operation of IABA is illustrated in Fig. 3.\nFor initial access, we follow the downlink control oper-\nation where the gNBs transmit SSB reference signals, such\nthat each SSB corresponds to a different beam index (ID) in\nthe gNB codebook (cf. Step 1 in Fig. 3). Following 3GPP’s\nspecifications, the SSBs are allocated in the first 5 ms of\nan SS burst, which is transmitted with a periodicity of\nTSS = 20 ms. We note that 3GPP limits the maximum\nnumber of SSBs NSSB up to 64 for FR2 [3]. During the\ntransmission of an SS burst, the UE keeps its beam fixed,\nand continues to sweep all of its beams over consecutive SS\nbursts, as illustrated in Fig. 3. A complete beam sweep of the\ngNB/UE codebooks thus takes MTSS, where M = |Cu| de-\nnotes the number of beam entries in the UE codebook. The\nUE sends back a measurement report of the beam sweep,\nincluding the SSB-RSRP, SSB-ID and UE beam ID of the best\nNCSI−RS candidate BPLs, as shown in Fig. 3. The UE is\nconsequently initially associated to the gNB which provides\nthe strongest BPL in terms of SSB-RSRP (cf. Sec. 2.3).\nFollowing the initial access, the network sets up the\nmonitoring of candidate BPLs (cf. Step. 2 in Fig. 3). For\nthis, IABA uses dedicated non-zero power (NZP) CSI-RS re-\nsources to monitor the best NCSI−RS candidate BPLs found\nduring initial access for each UE, with NCSI−RS ≤ 4 for\nFR2 [3]. After selecting the per-UE NCSI−RS BPLs for active\nmonitoring, the network schedules the NZP CSI-RS CM/IM\nresources following the 5G-NR standardized methodol-\nogy [36]. During the multi-UE BPL allocation, the network\nutilizes NZP CSI-RS CM resources for measuring the pre-\ncoded RSRP/SINR, i. e. using the same precoding as for\npotential data transmission on the candidate BPL. Dedicated\nNZP CSI-RS IM resources are used to estimate the interfer-\nence from other concurrent transmissions via interference-\naware CSI-RS scheduling. NZP CSI-RSs can be transmitted\nin any orthogonal frequency-division multiplex (OFDM)\nsymbols as configured by the radio resource control, and\ntake fewer radio resources, e. g. one OFDM symbol, and are\ntransmitted with lower periodicity compared to SSBs [3].\nStep. 3 in Fig. 3 shows an example MU-MIMO scenario with\nthree UEs, where one UE receives its NZP CSI-RS for CM\nTime\nFrequency\nStep 1. gNB/UE beam codebook sweep for initial beam pair link (BPL) selection \nUE reports back \nSSB-ID/RSRP of \nbest NCSI-RS BPLs \nStep 2. NZP CSI-RS for monitoring of the best NCSI-RS candidate BPLs\nStep 3. NZP CSI-RS scheduling for MU-MIMO channel/interference measurements\nNZP CSI-RS IM\nOther (e. g. DATA, DM-RS)\nNZP CSI-RS CM\nUE 1\nUE 3\nUE 2\nBPL #1\nBPL #NCSI-RS\nBPL #1\nBPL #NCSI-RS\nBPL #1\nBPL #NCSI-RS\nSSB #1\nSSB #2\nSSB #NSSB\nUE Beam #1\nSSB-RSRP\nUE Beam #2\nSSB #1\nSSB #2\nSSB #NSSB\nUE Beam #M\nTSS\nTSS\nSSB #1\nSSB #2\nSSB #NSSB\nTSS\nBPL #1:   \n  SSB ID: #1\n  RSPR: -44 dBm \n  UE Beam: #2\nBPL #NCSI-RS:   \n  SSB ID: #2\n  RSPR: -57 dBm \n  UE Beam: #M\nTime\nFrequency\nBPL #1\nCSI-RS #1\nCSI-RS #NCSI-RS\nBPL #NCSI-RS\nTime\nFrequency\nFig. 3: 5G-NR-compliant operation for IABA: (i) SSB-based\ninitial beam sweep for BPL selection, (ii) scheduling of NZP\nCSI-RS for BPL monitoring, (iii) NZP CSI-RS scheduling for\nMU-MIMO channel/interference measurements.\nwhile the other two conduct IM at the same time. IABA\nuses the dedicated NZP CSI-RS CM/IM to compute the\nprecoding/combining before each BPL allocation (Step 3 of\nAlg. 1). At the UE, this corresponds to the beam entry used\nto steer the array towards the candidate BPL. At the gNB,\nthis is reflected as using a different precoding matrix index\nfor Type II codebooks, which provide multi-beam support\nsuitable for interference cancellation in HBF MU-MIMO\nconfigurations with up to four spatial layers, as defined in\nSec. 5.2.2.2.1–5 in TS 38.214 [33] and detailed in Sec. 2.4–2.5.\n4\nPERFORMANCE EVALUATION\n4.1\nSimulation Model\nWe consider a realistic urban area in Seoul, with the\nmm-wave network consisting of gNBs and UEs deployed\nwithin a central 500 m × 500 m network area, as shown\nin Fig. 4. The gNB deployment follows a regular distri-\nbution on a uniform grid, where the gNB locations are\nmapped to the closest building corner near the actual\ngrid position. We consider gNB deployment densities of\nλgNB = {64, 196} gNBs/km2. The sparse deployments are\na representative of early mm-wave networks deployed as\na hot-spot capacity extension, whereas the dense deploy-\nments correspond to future mm-wave networks. The UEs\nare randomly deployed following a Poisson point process\n(PPP) with a density of λUE = 1000 UEs/km2.\nWe\nassume\nan\noperating\ncarrier\nfrequency\nof\nfc = 28 GHz and a system bandwidth of B = 400 MHz,\n8\nFig. 4: Illustration of the urban site in Seoul, showing the\nbuilding layout and an example gNB (•) and UE (×)\ndeployment over the network study area (green box);\nλgNB = 64 gNBs/km2 and λUE = 1000 UEs/km2.\nParameter\nValue\nNetwork area size\n500 m × 500 m\ngNB distribution\nuniform grid\ngNB density λgNB\n{64, 196} gNBs/km2\ngNB height\n6 m\nUE distribution\nPPP\nUE density λUE\n1000 UEs/km2\nUE height\n1.5 m\n# sector antenna panels Nsec\n4\n# RF chains per gNB sector N g\nRF,sec\n4\n# RF chains per gNB N g\nRF\n16\n# RF chains per UE N u\nRF\n1\ngNB sector antenna size Nt\n{256, 1024} elements\nUE sector antenna size Nr\n16 elements\n# bits for steering codebook nq\n{2, 4, 6, 8, 10, ∞}\n# SSBs NSSB\n64\n# monitored CSI-RS NCSI−RS\n{2, 4, ∞}\nCarrier frequency fc\n28 GHz\nSystem bandwidth B\n400 MHz\nMax. gNB transmit power Pmax\n30 dBm\nNoise power N\n−78 dBm\nCoverage threshold SINRmin\n−5 dB\nMax. achievable throughput Rmax\n2 Gbps\nTABLE 2: Studied cellular network parameters.\ncorresponding to 5G-NR FR2 network deployments [2].\nWe consider saturated downlink traffic, and assume a\nmaximum gNB transmit power of Pmax = 30 dBm and\na noise power of N = −78 dBm, consisting of thermal\nnoise over the system bandwidth plus a noise figure\nof 10 dB. We model the gNB antenna as per 3GPP’s\nspecifications with a size of up to Nt = 1024 elements and\nN g\nRF = 4 RF chains per sector panel [29], deployed at a\nheight of 6 m. Each gNB is thus equipped with a total of\nN g\nRF = NsecN g\nRF,sec = 16 RF chains. We assume a CBF\narchitecture at the UE and a multi-sector antenna with\nNr = 16 elements per sector panel, deployed at a height of\n1.5 m. The UEs are equipped with N u\nRF = 1 RF chain, as per\n5G-NR specifications [29]. Throughout, the results represent\nMonte Carlo simulations with 20 network realizations of\nrandom UE deployments. Table 2 summarizes the studied\ncellular network parameters.\n4.2\nResults\nIn the following, we present the results of our extensive\nstudy of mm-wave HBF MU-MIMO performance and the\nevaluation of IABA under practical network constraints. In\nSec. 4.2.1, we study the baseline performance of IABA and\ncompare it against default 5G-NR1 for the ideal case of\nnq = ∞ and NCSI−RS = ∞. In Sec. 4.2.2 we study the\neffect of candidate BPL monitoring in IABA, and show that\nIABA significantly outperforms default 5G-NR under realis-\ntic CSI-RS signaling, i. e. NCSI−RS ≤ 4. In Sec. 4.2.3 we an-\nalyze the effect of quantized CSI feedback, i. e. nq < ∞, on\nthe HBF MU-MIMO performance, showing the benefits of\nIABA and performance gains over the default interference-\nagnostic 5G-NR. Finally, in Sec. 4.2.4 we study the practical\nperformance trade-offs in terms of CSI-RS BPL monitoring\nNCSI−RS and quantized CSI feedback nq, and show that\nIABA allows HBF MU-MIMO to even outperform the DBF\nMU-MIMO baseline, with further benefits of increased gNB\nantennas and densification in beyond-5G networks.\n4.2.1\nBeyond 5G-NR Baseline Performance\nLet us being by studying the performance of IABA,\nand\ncompare\nit\nagainst\nthe\ninterference-agnostic,\nde-\nfault 5G-NR BPL allocation (referred to as 5G-NR) for\nour baseline network deployment of λgNB = 64 BSs/km2,\nλUE = 1000 UEs/km2, and Nt = 256/Nr = 16 elements.\nWe additionally assume ideal channel estimation and\nCSI-RS BPL monitoring, i. e. nq = ∞ and NCSI−RS = ∞.\nFig. 5 presents the resulting SINR, interference-to-noise-\nratio (INR) and signal-to-noise-ratio (SNR) distributions and\nFig. 6 illustrates the network BPL allocation, i.e. index/type\nof allocated BPLs, for the different BPL allocation schemes.\nFig. 5a shows that the proposed IABA significantly\nimproves both the coverage and achieved SINR over the\n5G-NR baseline. The centralized approach cIABA improves\nthe coverage by 20 percentage points (pp), and the median\nSINR by 10 dB over 5G-NR. The distributed approach dIABA\nalso outperforms 5G-NR by 4 pp in terms of coverage and\nover 4 dB in the median SINR. Interestingly, while Fig. 5b\nconfirms that zero-forcing in HBF MU-MIMO fully cancels\nthe intra-cell interference, there is a significant portion of al-\nlocated UEs that are still affected by strong residual inter-cell\ninterference, i. e. 60% of the UEs for cIABA and over 45% for\ndIABA/5G-NR experience inter-cell interference above the\nnoise floor (INR > 0). We emphasize that this result is in\ncontrast to assumptions made in prior mm-wave studies,\nwhich typically assume limited to no-interference due to\nsimplified antenna/channel models, e.g. [17]–[19], [24], [25].\nLet us further analyze the nature of the residual spatial\ninterference in HBF MU-MIMO mm-wave networks to gain\ninsight into how IABA achieves its performance gains over\n1. In [26], we show that IABA outperforms WCS, as a literature\nbenchmark [25] for spatial BPL allocation in CBF mm-wave SDMA\nnetworks. We expect the same performance trends to hold, and do\nnot include an explicit comparison against WCS for HBF MU-MIMO\nin this work. We note that, as far as we are aware of, there are no other\nmm-wave networking studies on HBF MU-MIMO (cf. Table. 1) that\nconsider multi-UE interference cancellation and spatial BPL allocation\njointly. We therefore select HBF MU-MIMO with default 5G-NR UE\nassociation to the strongest gNB and BPL found during initial access\n(cf. Sec. 2.3) as our main performance evaluation benchmark.\n9\n−5\n5\n15\n25\n35\n45\n55\n65\n0\n0.2\n0.4\n0.6\n0.8\n1\nSINR (dB)\nCCDF\n5G-NR\ndIABA\ncIABA\n(a) SINR\n−300 −240 −180 −120 −60\n0\n60\n0\n0.2\n0.4\n0.6\n0.8\n1\nINR (dB)\nCCDF\n5G-NR\ndIABA\ncIABA\nIinter\nIintra\n(b) INR\n−5\n5\n15\n25\n35\n45\n55\n65\n0\n0.2\n0.4\n0.6\n0.8\n1\nSNR (dB)\nCCDF\n5G-NR\ndIABA\ncIABA\n(c) SNR\nFig. 5: SINR, INR and SNR distribution for the different BPL allocation approaches, assuming nq = ∞, NCSI−RS = ∞,\ni. e. ideal channel estimation and CSI-RS BPL monitoring, and our baseline network of λgNB = 64 BSs/km2,\nλUE = 1000 UEs/km2, Nt = 256/Nr = 16 elements.\n5G-NR\ndIABA\ncIABA\n0\n0.2\n0.4\n0.6\n0.8\n1\nCCDF\n# 1\n# 2\n# 3\n# 4\nOther\n(a) Allocated BPL index\n5G-NR\ndIABA\ncIABA\n0\n0.2\n0.4\n0.6\n0.8\n1\nCCDF\nLOS\nNLOS\nDROP\nHO\n(b) Allocated BPL type\nFig. 6: Index and type of the allocated BPLs, assuming\nnq = ∞, NCSI−RS = ∞, λgNB = 64 BSs/km2,\nλUE = 1000 UEs/km2, and Nt = 256/Nr = 16 elements.\nthe 5G-NR baseline in Fig. 5a. Zero-forcing cancels intra-\ncell interference by projecting the UE’s channel vector on a\nprecoding vector that is orthogonal to other UEs’ channel\nvectors (10). The penalty for this depends on the mutual\nchannel correlation, and is reflected as a loss in the RSS if the\nchannels are highly correlated, known as the zero-forcing\npenalty [12]. The mm-wave channel is sparse, and the\neffective UE channel depends on the choice of the beam\ncodebook entries which maximize the RSS of the candidate\nBPLs found during initial access. In practice, the chosen\nbeams amplify certain channel paths and attenuate others,\nso that the allocated BPLs in the 5G-NR baseline typically\nshare common strong paths, e. g. for nearby co-located UEs,\nwhich results in high channel correlation. In such cases,\nthe zero-forcing penalty incurs significant losses in order\nto fully cancel intra-cell interference, due to its inability to\ncompensate for the low angular separation of the allocated\nBPLs. Namely, always selecting the best RSS BPLs at initial\naccess for serving all UEs as in 5G-NR results in a high\nzero-forcing penalty and thus poor SNR after zero-forcing\nprecoding, as shown in Fig. 5c. By contrast, the proposed\nIABA is able to significantly improve the SNR in Fig. 5c by\neffectively increasing the angular separation of the allocated\nBPLs after zero-forcing via selection of the nth-strongest\nBPLs at initial access, as shown in Fig. 6a. By allocating\nsecondary BPLs to increase the angular BPL separation,\ni. e. n > 1, IABA reduces the zero-forcing penalty and mit-\nigates strong interference that would otherwise result by\nonly allocating the best RSS BPL, i. e. n = 1. For example,\n20% of the UEs for dIABA and 57% for cIABA are allocated\nBPLs other than the best RSS BPL, as shown in Fig. 6a.\nMoreover, Fig. 6b shows that 45% of the UEs are allocated\nNLOS BPLs for cIABA, compared to 27% for dIABA and\nonly 19% for 5G-NR. cIABA further improves the overall\nnetwork performance by allowing handovers for 21% of the\nUEs in Fig. 6b, thus having the benefit of load-balancing and\noutperforming the other BPL allocation approaches.\nIn summary, the results in Figs. 5-6 demonstrate the\nsignificant benefit of interference-aware BPL allocation to\nmanage the residual spatial interference in HBF MU-MIMO\nmm-wave networks that cannot be mitigated by zero-\nforcing alone even under ideal channel estimation (nq = ∞).\n4.2.2\nCSI-RS BPL Monitoring for IABA\nLet us next focus on how IABA achieves network-wide\nperformance gains in practice for our baseline network\ndeployment. Fig. 7 shows the SINR distribution and the\nallocated BPL index/type for varying NCSI−RS = {2, 4, ∞}\nunder ideal channel estimation (nq = ∞). Fig. 7a shows\nthat constraining NCSI−RS has only a limited impact on\nthe achieved SINR for dIABA. This is because the ideal\nallocation (NCSI−RS = ∞) of the per-UE BPLs for dIABA\npicks at most the second best BPL for 88% of UEs, and 98%\nup to the fourth best BPL, as shown in Fig. 7b. Limiting\nNCSI−RS to four thus results in no significant impact of the\nachievable network performance for dIABA in Fig. 7a.\nIn contrast, Fig. 7b shows that cIABA allocates the fifth or\nhigher BPL index for 19% of the UEs for NCSI−RS = ∞. Im-\nportantly, only 45% of the UEs are allocated the best RSS BPL\nfor NCSI−RS = ∞, compared to 50% for NCSI−RS = 4 and\n68% for NCSI−RS = 2. Thus, limiting NCSI−RS for cIABA\nhas a more significant impact in terms of SINR degradation\nin Fig. 7a than for dIABA. Reducing NCSI−RS also limits\nthe use of secondary NLOS BPLs for interference mitigation\nin cIABA, and increases the primary use of LOS BPLs, e. g.\nfrom 37% for NCSI−RS = ∞ up to 46% for NCSI−RS = 2\nin Fig. 7c. In addition, the load-balancing rate via han-\ndovers drops from 21% down to 5% for NCSI−RS = 2\nin Fig. 7c. Consequently, Fig. 7a shows that cIABA with\nNCSI−RS = 2 achieves 15 pp lower coverage than cIABA\nwith NCSI−RS = ∞, with its overall SINR performance\nbeing comparable to dIABA with NCSI−RS = ∞.\nOur results in Fig. 7 thus highlight that CSI-RS BPL\nmonitoring improves both coverage and achievable SINR,\n10\n−5\n5\n15\n25\n35\n45\n55\n65\n0\n0.2\n0.4\n0.6\n0.8\n1\nSINR (dB)\nCCDF\n5G-NR\nNCSI−RS = 2\ndIABA\nNCSI−RS = 4\ncIABA\nNCSI−RS = ∞\n(a) SINR\n2\n4 ∞\n2\n4 ∞\n2\n4 ∞\n0\n0.2\n0.4\n0.6\n0.8\n1\n5G-NR\ndIABA\ncIABA\nNCSI−RS\nCCDF\n# 1\n# 2\n# 3\n# 4\nOther\n(b) Allocated BPL index\n2\n4 ∞\n2\n4 ∞\n2\n4 ∞\n0\n0.2\n0.4\n0.6\n0.8\n1\n5G-NR\ndIABA\ncIABA\nNCSI−RS\nCCDF\nLOS\nNLOS\nDROP\nHO\n(c) Allocated BPL type\nFig. 7: SINR distribution and allocated BPL index/type for varying NCSI−RS, assuming ideal channel estimation nq = ∞,\nλgNB = 64 BSs/km2, λUE = 1000 UEs/km2, and Nt = 256/Nr = 16 elements.\n−5\n5\n15\n25\n35\n45\n55\n65\n0\n0.2\n0.4\n0.6\n0.8\n1\nSINR (dB)\nCCDF\n5G-NR\nnq = 4\ndIABA\nnq = 6\ncIABA\nnq = ∞\n(a) SINR\n−300 −240 −180 −120 −60\n0\n60\n0\n0.2\n0.4\n0.6\n0.8\n1\nIintraNR (dB)\nCCDF\n5G-NR\nnq = 4\ndIABA\nnq = 6\ncIABA\nnq = ∞\n(b) IintraNR\n−60\n−30\n0\n30\n60\n0\n0.2\n0.4\n0.6\n0.8\n1\nIinterNR (dB)\nCCDF\n5G-NR\nnq = 4\ndIABA\nnq = 6\ncIABA\nnq = ∞\n(c) IinterNR\nFig. 8: SINR and INR distribution using quantized channel feedback from varying codebook sizes nq = {4, 6, ∞},\nassuming NCSI−RS = 4, λgNB = 64 BSs/km2, λUE = 1000 UEs/km2, and Nt = 256/Nr = 16 elements.\nand is particularly important for cIABA. Limiting the num-\nber of monitored candidate BPLs inherently limits the load-\nbalancing opportunities for cIABA, considering that the best\ncandidate BPLs found during initial access are provided by\nthe initial serving gNB. Nonetheless, cIABA monitoring up\nto the NCSI−RS = 4 best candidate BPLs – in line with\n3GPP’s specifications for FR2 [3] – is able to reap the benefits\nof IABA’s CSI-RS BPL monitoring and significantly outper-\nform 5G-NR in Fig. 7a, by allocating secondary BPLs to over\n50% of the UEs (cf. Fig. 7b). This result demonstrates the\npractical feasibility of IABA for network-wide, interference-\naware BPL allocation in HBF MU-MIMO networks.\n4.2.3\nCSI Reporting & Channel Feedback Quantization\nNext, we analyze the performance of IABA assuming quan-\ntized channel feedback for our baseline HBF MU-MIMO\nnetwork deployment. We set NCSI−RS = 4 as per Sec. 4.2.2,\nand vary the size of the codebooks used for channel estima-\ntion, nq = {4, 6, ∞}, as discussed in detail in Sec. 2.4.\nFig. 8 shows the resulting SINR and INR distributions\nusing quantized channel feedback from varying codebook\nsizes. Fig. 8a shows that finite codebooks can achieve good\ncoverage, but lead to significant performance degradation,\ni. e. over 10 dB loss in the median SINR for the smallest\nnq = 4 codebook compared to the ideal nq = ∞ codebook.\nFig. 8a shows that a codebook of size nq = 6 bits still suffers\nfrom significant SINR loss compared to the ideal nq = ∞\ncodebook, due to the inability to perform ideal zero-forcing\ngiven the quantized channel estimates. We emphasize that\nthis is despite the fact that a codebook of size nq = {4, 6}\n4\n6\n∞\n0\n10\n20\nHPBW\nnq\n∆ϕ (◦)\n(a) Angular misalignment ∆ϕ\n4\n6\n∞\n0\n3\n6\n10\n20\nnq\n∆G (dB)\n(b) Gain loss ∆G\nFig. 9: Distribution of angular misalignment between the\nsteering orientation of the codebook main lobe and the\nideal BPL orientation ∆ϕ, and the incurred gain loss due to\nmisalignment ∆G, assuming codebook sizes of\nnq = {4, 6, ∞} for our baseline network deployment.\nbits does not incur significant angular misalignment be-\ntween the steering orientation of the main lobe for the used\ncodebook entry and the ideal BPL orientation corresponding\nto the true channel propagation path, i. e. the misalignment\nis within the half-power beamwidth (HPBW) in Fig. 9a. In\nparticular, Fig. 9b shows that a codebook of size nq = 6 bits\nalready performs very close to the ideal in terms of incurred\ngain loss due to misalignment. Instead the detrimental effect\nof the quantized codebook comes from poor intra-cell inter-\nference suppression due to inaccurate channel estimates.\nFig. 8b confirms that, unlike the ideal case of nq = ∞, the\nHBF MU-MIMO network is unable to fully cancel the intra-\ncell interference using a finite resolution codebook, and\nthere is strong residual intra-cell interference affecting over\n11\n−5\n5\n15\n25\n35\n45\n55\n65\n0\n0.2\n0.4\n0.6\n0.8\n1\nSINR (dB)\nCCDF\n(a) SINR (nq = ∞, NCSI−RS = ∞)\n−5\n5\n15\n25\n35\n45\n55\n65\n0\n0.2\n0.4\n0.6\n0.8\n1\nSINR (dB)\nCCDF\n(b) SINR (nq = 6, NCSI−RS = 4)\n0\n0.5\n1\n1.5\n2\n0\n0.2\n0.4\n0.6\n0.8\n1\nR (Gbps)\nCCDF\n(c) Throughput (nq = 6, NCSI−RS = 4)\nFig. 10: SINR and throughput distribution for different beyond-5G network configurations and practical channel\nestimation and CSI-RS reporting (λgNB = 64 BSs/km2, λUE = 1000 UEs/km2, and Nt = 256/Nr = 16 elements).\n60% of UEs for nq = {4, 6}, regardless of the BPL allocation\napproach. On the other hand, Fig. 8c shows that the extent\nof inter-cell interference is not strongly affected as long as\nthe codebook steering resolution covers the HPBW, as is the\ncase for both codebooks of nq = {4, 6}. Fig. 8b thus high-\nlights that practical limitations on the channel estimation\ncodebook size and resulting accuracy of channel estimates\nstrongly limit the extent to which spatial interference in HBF\nMU-MIMO networks can be mitigated by interference can-\ncellation techniques such as zero-forcing. This emphasizes\nthe even greater importance in practical networks of addi-\ntional interference mitigation via spatial separation of BPL\nallocation for beyond-5G deployments. Fig. 8 shows these\nbenefits of interference-aware BPL allocation for practical\ndeployments: IABA significantly improves coverage and\nSINR over 5G-NR under quantized CSI feedback nq = {4, 6}\nand realistic CSI-RS BPL monitoring NCSI−RS = 4.\n4.2.4\nTowards Practical Interference-aware BPL Allocation\nfor Beyond-5G\nFinally, let us analyze the practical performance trade-offs in\nterms of channel estimation, CSI availability, and BPL mon-\nitoring, towards the feasibility of interference-aware BPL\nallocation as the proposed IABA for beyond-5G mm-wave\nnetworks. We consider codebook sizes of nq = {4, 6} bits\nas per Sec. 4.2.3, and set the number of monitored CSI-RS\nBPLs NCSI−RS = 4 as per Sec. 4.2.2. We then compare\nHBF MU-MIMO with different BPL allocation approaches\nagainst two reference mm-wave candidate architectures,\nboth with default 5G-NR BPL allocation:\n(i) DBF MU-MIMO: UEs are served via SDMA using DBF\nand zero-forcing for multi-UE interference cancellation,\nfollowing the same system model considerations as for\nHBF MU-MIMO in Sec. 2.2–2.4,\n(ii) CBF SU-MIMO: UEs are served via TDMA using CBF,\ncorresponding to current 5G-NR FR2 networks.\nWe start with the reference network performance under\nideal conditions (nq = ∞, NCSI−RS = ∞) for our baseline\nnetwork with λBS = 64 BSs/km2, λUE = 1000 UEs/km2,\nand Nt = 256/Nr = 16 elements. Fig. 10a presents the SINR\ndistribution, confirming that DBF MU-MIMO performs the\nbest, whereas CBF SU-MIMO is able to provide high SINR at\nthe cost of reduced coverage. Fig. 10a also shows that HBF\nMU-MIMO with default 5G-NR BPL allocation performs the\nworst, with the proposed IABA enabling HBF MU-MIMO to\nclose the gap to the DBF MU-MIMO baseline. In particular,\nFig. 10a shows that HBF MU-MIMO with cIABA performs\nwithin 3.5 dB of the DBF MU-MIMO baseline for the median\nSINR, and significantly outperforms the default 5G-NR HBF\nMU-MIMO, e. g. 8.5 dB gain for the median SINR case.\nLet us now move to the more practical network deploy-\nments, with Fig. 10b showing the SINR distribution for the\ncase of nq = 6 bits and NCSI−RS = 4. Comparing Figs. 10a\nand 10b confirms that both HBF and DBF MU-MIMO suffer\nfrom significant performance degradation due to imperfect\ninterference cancellation using quantized channel estimates,\nwhereas CBF SU-MIMO performance is robust since the\nmisalignment loss of the steering codebook is negligible\n(cf. Fig. 9). Importantly, Fig. 10b shows that HBF MU-MIMO\nbenefits strongly from the proposed IABA, and is able to\noutperform DBF over the complete SINR range. This is also\nbecause DBF is particularly affected under quantized CSI\nfeedback, since the accuracy of the estimated channel matrix\nis significantly degraded due to the higher dimensionality\nrequirements, degrading the multi-UE interference cancel-\nlation performance. Namely, HBF MU-MIMO is affected by\na quantized codebook to a lesser extent than DBF, due its\nlower requirements on the effective UE channel estimates.\nTo better understand the network performance, Fig. 10c\nmaps using (16) the SINR in Fig. 10b to the achievable\nper-UE throughput for the different configurations. Fig. 10c\nshows that HBF MU-MIMO with cIABA outperforms all\nother configurations, and achieves a median throughput\nof 1.35 Gbps, which is 35% higher than that of the DBF\nMU-MIMO baseline. Fig. 10c also shows that current 5G-NR\ndeployments relying on CBF SU-MIMO are only able to\nachieve limited per-UE throughput when a large number\nof UEs are served on each gNB, due to the time resource\nsharing of TDMA. Furthermore, Fig. 10c shows that HBF\nMU-MIMO utilizing dIABA achieves better performance for\nover half of the UEs compared to the DBF MU-MIMO\nbaseline, though at a cost of somewhat reduced coverage;\nthis makes the less computationally demanding dIABA par-\nticularly suitable for dense mm-wave SDMA deployments.\nOur results in Fig. 10 thus highlight that the move\ntowards fully-scaled SDMA necessitates interference-aware\nBPL allocation in order to unlock the full potential of\nmm-wave for beyond-5G networks. With the envisioned\nantenna size increase and network densification, we lastly\nlook at the scalability of IABA in practical mm-wave HBF\nMU-MIMO networks. In Fig. 11 we consider the case when\nUEs are equipped Nr = 16 elements per sector antenna, and\n12\n0\n0.5\n1\n1.5\n2\n0\n0.2\n0.4\n0.6\n0.8\n1\nR (Gbps)\nCCDF\nNt = 256\nNt = 1024 elements\n(a) Varying Nt (λgNB = 64 gNBs/km2).\n0\n0.5\n1\n1.5\n2\n0\n0.2\n0.4\n0.6\n0.8\n1\nR (Gbps)\nCCDF\nλgNB = 64\nλgNB = 196 gNBs/km2\n(b) Varying λgNB (Nt = 256 elements).\nFig. 11: Throughput distribution for the different BPL\nallocation approaches, assuming HBF MU-MIMO with\nvarying gNB antenna Nt and deployment density λgNB\n(λUE = 1000 BS/km2, Nr = 16 elements).\npresent the throughput distribution for a larger gNB sector\nantenna of Nt = 1024 elements and a higher gNB density\nof λgNB = 196 gNBs/km2, alongside our baseline network\ndeployment of Nt = 256/λgNB = 64 as shown in Fig. 10c.\nFig. 11a highlights a strong benefit from increased gNB\nsector antenna for all BPL allocation approaches. The pro-\nposed IABA yields significant performance gains when\nmoving from a 256- to 1024-element sector antenna: a two-\nfold increase in the median throughput for dIABA from\n950 Mbps to 1.88 Gbps, and a similar increase for cIABA\nfrom 1.3 Gbps to 2 Gbps, as show in Fig. 11a. The increased\ngNB antenna directionality makes more candidate BPLs\nfeasible for allocation, thus increasing the gNB’s ability\nto spatially distinguish nearby UEs and thus increase the\nco-scheduled UE BPL separation. For example, more than\nhalf of the UEs get the maximum achievable throughput\nof 2 Gbps with HBF MU-MIMO using cIABA, amounting\nto a 10 pp increase over the interference-agnostic 5G-NR\nbaseline. Fig. 11a thus shows that large antenna arrays in\nfact benefit more from interference-aware BPL allocation, fur-\nther highlighting the limiting factor of spatial interference in\nrealistic mm-wave SDMA deployments.\nFig. 11b presents the effect of network densification as\nanother crucial aspect towards improving the wide-area\nmm-wave coverage and achievable performance, assuming\nNt = 256 elements per gNB sector. The denser deployment\nincreases the ability of dIABA and cIABA to mitigate inter-\nference, and in particular, improves the load-balancing effect\nof cIABA. Fig. 11b shows that the three-fold increase in gNB\ndeployment density results in a significant increase in the\nper-UE achievable throughput – over 60% of UEs get the\nmaximum achievable throughput using cIABA, compared\nto the 35% for the sparse deployment. Similar trends are\nobserved for both dIABA and 5G-NR. Importantly, Fig. 11b\nalso shows that cIABA achieves full network-wide coverage\nfor the dense deployment, and a 10 pp improvement in\ncoverage compared to the 5G-NR baseline. This highlights\nthe primary importance of interference-aware BPL alloca-\ntion for mm-wave SDMA in dense network deployments,\nthus validating the design strategy of the proposed IABA\nfor practical beyond-5G HBF MU-MIMO networks.\n5\nCONCLUSIONS\nWe proposed IABA, a 5G-NR standard-compliant BPL allo-\ncation scheme, for mitigating residual spatial interference\nin practical mm-wave HBF MU-MIMO networks. IABA\nsolves the network sum throughput optimization via either\na distributed or a centralized BPL allocation using dedi-\ncated CSI-RS resources for candidate BPL monitoring. We\npresented a comprehensive study of practical multi-cell\nmm-wave HBF MU-MIMO networks, and showed that\nspatial interference becomes the main limiting factor of\nHBF MU-MIMO performance, which is in contrast to prior\nmm-wave networking studies assuming simplified channel\nand antenna models and perfect CSI at the gNB. Our re-\nsults showed that IABA offers significant performance gains\nover default 5G-NR, by facilitating allocation of secondary\nBPLs other than the strongest BPL found during initial\naccess. Importantly, we demonstrated that IABA allows\nHBF MU-MIMO to outperform the interference-agnostic\nDBF MU-MIMO baseline, with further benefits of increased\ngNB antennas and densification for beyond-5G mm-wave\nnetworks. Our ongoing work is focused on low-complexity\nBPL allocation schemes using site-specific codebooks for\nadaptive CSI acquisition and further spatial multiplexing\ngains in diverse network configuration deployments.\nREFERENCES\n[1]\nM. Xiao et al., “Millimeter wave communications for future mobile\nnetworks,” IEEE J. Sel. Areas Commun., vol. 35, no. 9, 2017.\n[2]\n“5G; NR; User Equipment (UE) radio transmission and reception;\nPart 2: Range 2 Standalone,” 3GPP TS 38.101-2 V15.5.0, 2019.\n[3]\nM. Giordani et al., “A tutorial on beam management for 3GPP\nNR at mmWave frequencies,” IEEE Commun. Surveys Tuts., vol. 21,\nno. 1, 2019.\n[4]\nY. Heng et al., “Six key challenges for beam management in 5.5G\nand 6G systems,” IEEE Commun. Mag., vol. 59, no. 7, 2021.\n[5]\nS.\nSegan.\n(2019)\nHere’s\nthe\nreal\ntruth\nabout\nVerizon’s\n5G\nnetwork.\nPC\nMag\nDigital\nGroup.\n[Online].\nAvailable:\nhttps://www.pcmag.com/news/367659/\nheres-the-real-truth-about-verizons-5g-network\n[6]\nGSMA,\n“5G\nmmWave\ndeployment\nbest\npractices\nwhitepaper,”\nWhite\nPaper,\nNov.\n2022.\n[Online].\nAvailable:\nhttps://www.gsma.com/futurenetworks/resources/\n5g-mmwave-deployment-best-practices-whitepaper/\n[7]\nS. Kutty and D. Sen, “Beamforming for millimeter wave communi-\ncations: An inclusive survey,” IEEE Commun. Surveys Tuts., vol. 18,\nno. 2, 2016.\n[8]\n“5G; Study on new radio access technology,” 3GPP, Tech. Rep.,\nOct. 2017.\n[9]\nEricsson, “Massive MIMO handbook, Technology primer,” Tech.\nRep., 2023. [Online]. Available: https://www.ericsson.com/en/\nran/massive-mimo\n[10] K. Hassan, M. Masarra, M. Zwingelstein, and I. Dayoub, “Channel\nestimation techniques for millimeter-wave communication sys-\ntems: Achievements and challenges,” IEEE Open J. Commun. Soc.,\nvol. 1, 2020.\n[11] R. W. Heath et al., “An overview of signal processing techniques\nfor millimeter wave MIMO systems,” IEEE J. Sel. Topics Signal\nProcess., vol. 10, no. 3, 2016.\n13\n[12] M. N. Kulkarni, A. Ghosh, and J. G. Andrews, “A comparison of\nMIMO techniques in downlink millimeter wave cellular networks\nwith hybrid beamforming,” IEEE Trans. Commun, vol. 64, no. 5,\n2016.\n[13] A. Alkhateeb, G. Leus, and R. W. Heath, “Limited feedback hybrid\nprecoding for multi-user millimeter wave systems,” IEEE Trans.\nWireless Commun, vol. 14, no. 11, 2015.\n[14] F. G´omez-Cuba et al., “Hybrid beamforming in 5G mmWave\nnetworks: A full-stack perspective,” IEEE Trans. Wireless Commun,\nvol. 21, no. 2, 2022.\n[15] S. Sun, T. S. Rappaport, and M. Shaft, “Hybrid beamforming for\n5G millimeter-wave multi-cell networks,” in Proc. IEEE INFOCOM\nWorkshops, Honolulu, USA, Apr. 2018.\n[16] S. Sun, T. S. Rappaport, M. Shafi, and H. Tataria, “Analytical\nframework of hybrid beamforming in multi-cell millimeter-wave\nsystems,” IEEE Trans. Wireless Commun, vol. 17, no. 11, 2018.\n[17] Z. Sha, S. Chen, and Z. Wang, “Near interference-free space-\ntime user scheduling for mmwave cellular network,” IEEE Trans.\nWireless Commun., vol. 21, no. 8, 2022.\n[18] Z. Sha, Y. Ming, C. Sun, and Z. Wang, “Versatile resource manage-\nment for millimeter-wave cellular network: Near interference-free\nscheduling methodology,” IEEE Trans. Veh. Technol., vol. 72, no. 6,\n2023.\n[19] A. Alizadeh, M. Vu, and T. S. Rappaport, “A study of interference\ndistributions in millimeter wave cellular networks,” in Proc. IEEE\nCOMCAS, Tel Aviv, Israel, 2019.\n[20] Z. Marzi and U. Madhow, “Interference management and capacity\nanalysis for mm-wave picocells in urban canyons,” IEEE J. Sel.\nAreas Commun., vol. 37, no. 12, 2019.\n[21] P. Paul, H. Wu, and C. Xin, “BOOST: A user association and\nscheduling framework for beamforming mmwave networks,”\nIEEE Trans. Mobile Comput., vol. 20, no. 10, 2021.\n[22] Y. Li et al., “Radio resource management considerations for 5G\nmillimeter wave backhaul and access networks,” IEEE Commun.\nMag., vol. 55, no. 6, 2017.\n[23] Q. Xue, X. Fang, M. Xiao, and L. Yan, “Multiuser millimeter wave\ncommunications with nonorthogonal beams,” IEEE Trans. Veh.\nTechnol., vol. 66, no. 7, 2017.\n[24] G. Kwon, N. Kim, and H. Park, “Millimeter wave SDMA with\nlimited feedback: RF-only beamforming can outperform hybrid\nbeamforming,” IEEE Trans. Veh. Technol., vol. 68, no. 2, 2019.\n[25] A. Alizadeh and M. Vu, “Load balancing user association in\nmillimeter wave MIMO networks,” IEEE Trans. Wireless Commun,\nvol. 18, no. 6, 2019.\n[26] A. Ichkov, P. M¨ah¨onen, and L. Simi´c, “Interference-aware user\nassociation and beam pair link allocation in mm-wave cellular\nnetworks,” in Proc. IEEE WCNC, Glasgow, Mar. 2023.\n[27] A. Ichkov, P. M¨ah¨onen, and L. Simi´c, “Is ray-tracing viable for\nmillimeter-wave networking studies?” in Proc. IEEE PIMRC, Lon-\ndon, UK, Sep. 2020.\n[28] A. Schott, A. Ichkov, P. M¨ah¨onen, and L. Simi´c, “Measurement\nvalidation of ray-tracing propagation modeling for mm-wave\nnetworking studies: How detailed is detailed enough?” in Proc.\nEuCAP, Florence, Italy, Mar. 2023.\n[29] “Study on channel model for frequencies from 0.5 to 100 GHz\n(3GPP),” 3GPP, TR 38.901 V14.3.0, 2017.\n[30] O. E. Ayach et al., “Spatially sparse precoding in millimeter wave\nMIMO systems,” IEEE Trans. Wireless Commun., vol. 13, no. 3, 2014.\n[31] H. Zhao et al., “28 GHz millimeter wave cellular communication\nmeasurements for reflection and penetration loss in and around\nbuildings in New York city,” in Proc. IEEE ICC, Budapest, Hun-\ngary, Jun. 2013.\n[32] R. Peng and Y. Tian, “Robust wide-beam analog beamforming\nwith inaccurate channel angular information,” IEEE Commun.\nLett., vol. 22, 2018.\n[33] “5G; NR; Physical layer procedures for data,” 3GPP, TR 38.214\nversion 16.0.2 Release 16, Jul. 2020.\n[34] Q. Ziao and Y. Haifan, “A review of codebooks for CSI feedback\nin 5G new radio and beyond,” Preprint, arXiv, 2023. [Online].\nAvailable: https://arxiv.org/pdf/2302.09222.pdf\n[35] E. Onggosanusi et al., “Modular and high-resolution channel state\ninformation and beam management for 5G new radio,” IEEE\nCommun. Mag., vol. 56, no. 3, 2018.\n[36] H. Elgendi et al., “Interference measurement methods in 5G NR:\nPrinciples and performance,” in Proc. IEEE ISWCS, Oulu, Finland,\nAug. 2019.\n"
}