{
    "optim": "arXiv:2402.17724v1  [math.NA]  27 Feb 2024 ELLIPTIC RECONSTRUCTION AND A POSTERIORI ERROR ESTIMATES FOR PARABOLIC VARIATIONAL INEQUALITIES HARBIR ANTIL AND ROHIT KHANDELWAL Abstract. Elliptic reconstruction property, originally introduced by Makridakis and No- chetto for linear parabolic problems, is a well-known tool to derive optimal a posteriori error estimates. No such results are known for nonlinear and nonsmooth problems such as parabolic variational inequalities (VIs). This article establishes the elliptic reconstruc- tion property for parabolic VIs and derives a posteriori error estimates in L∞(0, T ; L2(Ω)) and L∞(0, T ; L∞(Ω)), respectively. As an application, the residual-type error estimates are presented. 1. Introduction Parabolic variational inequalities (VIs) arise in many applications. Examples include, Stefan problem for phase transition [17] and American options in ﬁnance [31]. Designing numerical schemes to approximate such problems is challenging due to the problems being nonlinear and nonsmooth nature of the continuous solution. In addition, these numerical schemes must be constraint preserving, for instance bound constraints, or the constraint violation error must remain under control. The focus of this paper is on such challenges. Notice that solving these problems in itself is a challenge, which we do not address here, see for instance [17, 19]. During last two decades, signiﬁcant research focus has been on adaptive ﬁnite element methods (AFEM) for elliptic partial diﬀerential equations (PDEs) [3, 29]. Starting from [14, 15], there have been advances in AFEM for parabolic problems as well, but not to the extent of elliptic problems. See also [8] for instance for AFEM for Allen-Cahn and [7] for AFEM using convex duality. AFEM popularity can been attributed to its ability to capture singularities and minimize computational costs. A key mathematical tool in the development of eﬃcient adaptive versions of numerous numerical schemes is the use of a posteriori estimates. These estimates provide a fresh perspective on the theoretical exploration of a scheme’s behavior. This becomes particularly valuable in situations where “reasonable discretizations” may not consistently yield expected results. The situation is more delicate when it comes to VIs. Several contributions exists on a posteriori estimation of elliptic VIs: Ainsworth, Oden, and Lee [4], Hoppe and Kornhuber [20], Chen and Nochetto [11], Veeser [28], Bartels and Carstensen [6] and Nochetto, Petersdorﬀ and Zhang [27]. The 2020 Mathematics Subject Classiﬁcation. 65N30, 65M60, 35R35 . Key words and phrases. Elliptic reconstruction, Parabolic variational inequality, Adaptive Finite Element Method. This work is partially supported by NSF grant DMS-2110263, Air Force Oﬃce of Scientiﬁc Research (AFOSR) under Award NO: FA9550-22-1-0248, and Oﬃce of Naval Research (ONR) under Award NO: N00014-24-1-2147. 1 2 HARBIR ANTIL AND ROHIT KHANDELWAL works related to a posteriori error estimation of the parabolic VIs are signiﬁcantly limited. To the best of authors’ knowledge, the articles [23, 1] are only available works which are related to the adaptive FEM of parabolic VIs in the energy norm. Notice that currently there are no abstract maximum-norm estimates for parabolic VIs. The goal of this work is to introduce a continuous elliptic reconstruction for parabolic VIs and use it to derive abstract a posteriori error estimates in L∞(0, T; L2(Ω)) and L∞(0, T; L∞(Ω)) norms for the semidiscrete ﬁnite element approximations, of any degree k ≥ 1, to parabolic VIs. This construction is motivated by Makridakis and Nochetto [22] where the authors de- veloped this reconstruction property for linear parabolic problems. See also [8] for instance for AFEM for Allen-Cahn and [7] for AFEM using convex duality. In the setting of the current paper, the introduced reconstruction, W(t) : Vh → V of the discrete solution wh(t), where t ∈ [0, T], also accounts for the Lagrange multipliers corresponding to the parabolic VIs. Notice that here V and Vh are the continuous and discrete spaces, respectively. The key observation in our analysis is the following inequality (Lemma 5.1) for the diﬀer- ence between elliptic reconstruction W and continuous solution w: (W − w)t − ∆(W − w) ≤ σh + (W − wh)t (1.1) where σh ∈ Vh is the discrete Lagrange multiplier [16, 26]. Notice that, similarly to the continuous setting, σh converts a discrete parabolic VI into an equality. For every t when you think of the discrete VI as an elliptic (equality) problem, then the elliptic reconstruction W is precisely the continuous representation of solution to this discrete problem for every t. The right-hand-side of the continuous elliptic reconstruction problem depends on computable quantities wh, the data f, Ω and σh. Thus, any known residual type a posteriori error estimates which are valid for elliptic problems on Ω can now be used to estimate W − wh. Literature Survey: Let us now discuss the origins of elliptic reconstruction. Recall the linear parabolic problem Problem 1.1. Find u : [0, T] → Ω such that ut − ∆u = f in Ω × (0, T], u(·, 0) = u0(·) in Ω, u = 0 on ∂Ω × (0, T]. Wheeler initially carried out the a priori error analysis for Problem 1.1 in the energy norm in [30]. The main idea behind this analysis is the elliptic projection operator U which for any t satisﬁes ˆ Ω ∇(U − u) · ∇vhdx = 0 ∀vh ∈ Vh . (1.2) It was further established that U is the Galerkin approximation in Vh to the weak solution of the corresponding linear elliptic problem −∆u = f − ut in Ω, u = 0 on ∂Ω. Thus any a priori error estimates which are valid for elliptic problems on Ω can now be used to estimate U − uh. The overall error u − uh for Problem 1.1 can then be derived by ﬁrst ELLIPTIC RECONSTRUCTION FOR PARABOLIC VARIATIONAL INEQUALITIES 3 estimating u−U using standard PDE techniques and then estimating U −uh using elliptic a priori error analysis. The subsequent L2-error estimates derived in [30] are of optimal order. Later on, Makridakis and Nochetto [22] introduced the elliptic reconstruction map which can be regarded as an “a posteriori” analogue to the Ritz-Wheeler projection deﬁned in (1.2). The authors in [22] consider semidiscrete ﬁnite element approximations of any degree k ≥ 1 and proved the optimal order a posteriori error estimates in L∞(0, T; H1 0(Ω)). They derived the pointwise equation which is satisﬁed by u − U, that is further used to compute estimates in terms of uh,t−Ut. The key observation in their analysis is that uh is the discrete solution of the elliptic problem whose continuous solution is the elliptic reconstruction. In the context of elliptic reconstruction, we refer to [21] and [13] for the a posteriori error analysis of the fully discrete ﬁnite element approximations to Problem 1.1 in L∞(0, T; H1 0(Ω)) and L∞(0, T; L∞(Ω)), respectively. Outline: The article is organized as follows: section 2 focuses on the problem formulation, i.e., parabolic VI. In section 3, we introduce the discretization and provide the semidiscrete version of parabolic VI. The elliptic reconstruction operator W is deﬁned in section 4 and therein, we prove the key orthogonality relation between W and discrete solution wh. In section 5, we begin with the proof of inequality (1.1) and we derive the abstract a posteriori error estimates for the displacements in the energy and maximum norms, respectively. Lastly, we employ the standard residual-type error estimates and compute the explicit form of the error estimator in section 6. 2. Problem Formulation Let V := H1 0(Ω) and Q := Ω × (0, T] where Ω ⊂ Rd ; d ∈ {2, 3} is an open and bounded domain with boundary ∂Ω and T > 0 is any ﬁxed time. Let f ∈ L2(0, T; L2(Ω)) and w0 ∈ L2(Ω) be the given data and χ ∈ H1(Q) be a given obstacle such that χ ≤ 0 on [0, T] × ∂Ω. We denote Kχ(t) := \b v ∈ V | v ≥ χ(t) a.e. in Ω \t a.e. t ∈ [0, T] to be a non-empty, closed and convex subset of V. Then the continuous parabolic VI reads as follows: we seek a map w : [0, T] −→ V such that w ∈ L2(0, T; H1(Ω)) ∩ C0([0, T]; L2(Ω)) and wt ∈ L2(0, T; V∗) (V∗ is the dual of V) (cf, [10, 17]) where K := \b v ∈ L2(0, T; V) | v(t) ∈ Kχ(t) for a.e. t ∈ [0, T] \t and the following holds a.e. on [0, T]  wt(t), v − w(t) \u000b −1,1 + a \u0000w(t), v − w(t) \u0001 ≥ (f(t), v − w(t)) ∀ v ∈ Kχ(t), (2.1) w(0) = w0(x) on Ω and w(t) ∈ Kχ(t) a.e. t ∈ [0, T], (2.2) where a(p, q) := ´ Ω ∇p · ∇q dx ∀ p, q ∈ V, ⟨·, ·⟩−1,1 denotes the duality pairing between V and V∗ and (·, ·) is the L2(Ω) inner-product. For our analysis, it is important to note that there exists a continuous Lagrange multiplier σ ∈ L2(0, T; V∗) such that σ(t) satisﬁes the following equation:  σ(t), v \u000b −1,1 =  wt(t), v \u000b −1,1 + a \u0000w(t), v \u0001 − (f(t), v) ∀ v ∈ V , a.e. t ∈ (0, T]. (2.3) Remark 2.1. Let φ ∈ V be such that φ ≥ 0, and let v = w(t) + φ ∈ Kχ(t) in (2.1), then from (2.3) it holds that σ ≥ 0, i.e.,  σ(t), φ \u000b −1,1 ≥ 0 ∀ 0 ≤ φ ∈ V and for a.e. t ∈ (0, T]. In 4 HARBIR ANTIL AND ROHIT KHANDELWAL the sense of distributions, we observe that σ = wt − f − ∆w ≥ 0 in C := {w = χ} and σ = 0 in N := {w > χ}. Using [10, pp. 96 and 100] and [18], and if Ω is bounded and open subset with suﬃciently smooth boundary, f ∈ L2(0, T; L2(Ω)), w0 ∈ H1 0(Ω), χ suﬃciently smooth, then w solving (2.1) additionally fulﬁlls w ∈ C0([0, T]; V) ∩ L2(0, T; H2(Ω)) and wt ∈ L2(0, T; L2(Ω)). Be- cause of this, from (2.3), we have that σ ∈ L2(0, T; L2(Ω)). Thus σ ≥ 0, a.e. in Q, we will use this to prove our key Lemma 5.1. 3. Notations and Discretization Let Ωh be shape regular d-simplicial triangulations of Ω ⊂ Rd. Denote by K ∈ Ωh a d-simplex that is a triangle in R2 or a tetrahedron in R3 and |K| indicates the d-dimensional Lebesgue measure of K. The discrete space Vh is deﬁned by Vh := {vh ∈ V : vh|K ∈ Pk(K) ∀ K ∈ Ωh}, (3.1) where Pk(K) denote polynomials of degree less than or equal to k and k ≥ 1 be an integer. Let us introduce the non-empty, closed and convex subset of Vh: Kh,χ(t) := {vh ∈ Vh, vh|K ≥ χh|K(t) ∀K ∈ Ωh} a.e. t ∈ [0, T], (3.2) where χh is the approximation (for instance, Lagrange [9]) of χ and satisfying χh(t) ≤ 0 on [0, T] × ∂Ω. The set of all vertices of triangle K is denoted by VK. Let ωe be the union of all d-simplices sharing the edge e. The set of all egdes of K is denoted by Eh,K. Denote the set of all vertices of a triangle of Ωh that are in Ω (resp. on ∂Ω) by N i h (resp. N b h). Set Nh := N i h ∪ N b h. Deﬁne Eh := Ei h ∪ Eb h is the set of all edges in Ωh, where Ei h denotes the set of all interior edges and Eb h denotes the set of all boundary edges of Ωh. We set Γh := ∪e∈Ei he to be union of all the inter-element boundaries of Ωh. The set of the Lagrange nodal basis functions of Vh is {φp, p ∈ N i h}. For p ∈ Nh, let ωp = supp(φp) be the ﬁnite element star, i.e., the union of all the triangles in Ωh having p as a common node. We denote by Γp := Γh ∩ ωp to be the union of all interior edges in ωp. Let e = ∂K1 ∩ ∂K2 be a common edge of two triangles K1 and K2, n be the unit normal vector to e pointing from K1 to K2, then we have Jh := [[∂hwh]] := (∇wh|K1 − ∇wh|K2) · n. (3.3) Let he be the length of an edge e and hK be the diameter of K. Further, throughout the article, the notation X ≲ Y means that there exists generic positive constants C such that X ≤ CY. Next, we state the discrete trace inequality [9, Section 10.3] which will be frequently used in later analysis. Lemma 3.1. (Discrete trace inequality) Let v ∈ H1(K), K ∈ Ωh and e be an edge of K. Then, it holds that ∥v∥2 L2(e) ≲ h−1 e ∥v∥2 L2(K) + he∥∇v∥2 L2(K). (3.4) We deﬁne wh : [0, T] → Vh to be the ﬁnite element approximation of w which satisfy the following (wh,t(t), vh − wh(t)) + a \u0000wh(t), vh − wh(t) \u0001 ≥ (f(t), vh − wh(t)) ∀ vh ∈ Kh,χ(t), (3.5) wh(0) = wh,0 ∈ Vh. ELLIPTIC RECONSTRUCTION FOR PARABOLIC VARIATIONAL INEQUALITIES 5 For a.e. t ∈ (0, T], we deﬁne the discrete version of σ which will be used in the next subsection as (σh(t), vh) = (wh,t(t), vh) + a \u0000wh(t), vh \u0001 − (f(t), vh) ∀ vh ∈ Vh. (3.6) See articles [28, 16, 26] for various choices of σh. 4. The Elliptic Reconstruction Map for Parabolic VIs Let t ∈ [0, T], and for any given ﬁnite element approximation wh ∈ Vh and zh(t) := (f +σh −wh,t)(t) ∈ L2(Ω), we introduce the elliptic reconstruction W(t) := Rwh(t) : Vh → V of wh(t) which satisﬁes the following elliptic problem: (∇W(t), ∇v) = (zh(t), v) for all v ∈ V. (4.1) From the standard theory of elliptic problems [12, 9], it is well known that the problem (4.1) has a unique solution. Moreover, the continuous elliptic reconstruction W and discrete solution wh satisfy the following orthogonality relation: Lemma 4.1. It holds that \u0000∇(W − wh)(t), ∇vh \u0001 = 0 for all vh ∈ Vh. (4.2) Proof. Let t ∈ [0, T] and vh ∈ Vh, then from equation (3.6), it holds that \u0000∇W(t), ∇vh \u0001 − \u0000∇wh(t), ∇vh \u0001 = \u0000f + σh − wh,t, vh \u0001 + \u0000wh,t − f − σh, vh \u0001 = 0. Hence, we have the proof of (4.2). □ 5. A Posteriori Error Analysis This section provides the a posteriori error analysis in an abstract setting. As a starting point, we introduce a lemma which provides an inequality for the diﬀerence between elliptic reconstruction W in (4.1) and w solving (2.1). Lemma 5.1. Let A = −∆ be the self adjoint operator, then for 0 < t ≤ T and ∀ v ∈ V, the following error equation holds in the the sense of distributions (W − w)t + A(W − w) ≤ σh + (W − wh)t. (5.1) Here W, w and wh respectively solve (4.1), (2.1) and (3.5). Proof. For any v ∈ V, we consider ⟨(W − w)t, v⟩−1,1 + \u0000∇(W − w), ∇v \u0001 = ⟨Wt, v⟩−1,1 − ⟨wt, v⟩−1,1 − \u0000∇w, ∇v \u0001 + \u0000∇W, ∇v \u0001 = ⟨Wt, v⟩−1,1 −  σ(t), v \u000b −1,1 − (f, v) + \u0000∇W, ∇v \u0001 , (5.2) 6 HARBIR ANTIL AND ROHIT KHANDELWAL where in the last equality have used w(t) from (2.3). Subsequently, using the deﬁnition of W from (4.1) in (5.2), we obtain that ⟨(W − w)t, v⟩−1,1 + \u0000∇(W − w), ∇v \u0001 = ⟨Wt, v⟩−1,1 −  σ(t), v \u000b −1,1 − (f, v) + (f + σh − wh,t, v) = −⟨σ, v⟩−1,1 + ⟨σh, v⟩−1,1 + ⟨(W − wh)t, v⟩−1,1. Hence, we have the following estimate for any v ∈ V: ⟨(W − w)t, v⟩−1,1 + \u0000∇(W − w), ∇v \u0001 +⟨σ, v⟩−1,1 (5.3) = ⟨σh, v⟩−1,1 + ⟨(W − wh)t, v⟩−1,1. In particular, in the sense of distributions, we have (W − w)t + A(W − w) + σ = σh + (W − wh)t. (5.4) Using the key sign property σ ≥ 0 (cf. Remark 2.1), we conclude (5.1). □ 5.1. Energy norm error estimates. The next result follows immediately from Lemma 5.1. Lemma 5.2. Let W and wh be the continuous elliptic reconstruction and discrete solution which satisfy (4.1) and (3.5), respectively. Then, the following bound holds for t ∈ (0, T] 1 2∥(W − w)(t)∥2 L2(Ω) + 1 2 ˆ t 0 ∥(W − w)(s)∥2 Vds ≤ ˆ t 0 ∥σh(s)∥2 V∗ds + ˆ t 0 ∥(wh − W)t(s)∥2 V∗ds + 1 2∥W(0) − w(0)∥2 L2(Ω). (5.5) Proof. We multiply (5.1) by a test function v := W − w ∈ V to arrive at ⟨(W − w)t, v⟩−1,1 + (∇(W − w), ∇v) ≤ ⟨σh, v⟩−1,1 + ⟨(W − wh)t, v⟩−1,1 =⇒ ⟨(W − w)t, W − w⟩−1,1 + a(W − w, W − w) ≤ ⟨σh, W − w⟩−1,1 + ⟨(W − wh)t, W − w⟩−1,1 =⇒ 1 2 d dt∥W − w∥2 L2(Ω) + a(W − w, W − w) ≤ ⟨σh, W − w⟩−1,1 + ⟨(W − wh)t, W − w⟩−1,1 . (5.6) Using the properties of −∆ operator, it holds that a(v, v) 1 2 := ∥v∥V ∀ v ∈ V ELLIPTIC RECONSTRUCTION FOR PARABOLIC VARIATIONAL INEQUALITIES 7 and for t ∈ (0, T], we integrate (5.6) on both sides from 0 to t 1 2 \u0002 ∥W(t) − w(t)∥2 L2(Ω) − ∥W(0) − w(0)∥2 L2(Ω) \u0003 + ˆ t 0 ∥W − w∥2 V ≤ ˆ t 0 ⟨σh, W − w⟩−1,1 + ˆ t 0 ⟨(W − wh)t, W − w⟩−1,1 =⇒ 1 2∥W(t) − w(t)∥2 L2(Ω) + ˆ t 0 ∥W − w∥2 V ≤ ˆ t 0 ⟨σh, W − w⟩−1,1 | {z } Term 1 + 1 2∥W(0) − w(0)∥2 L2(Ω) + ˆ t 0 ⟨(W − wh)t, W − w⟩−1,1 | {z } Term 2 . (5.7) Using the generalized Young’s inequality ab ≤ a2 2ǫ + ǫ 2b2 ∀a, b ∈ R, (5.8) we derive the following bounds Term 1 ≤ ˆ t 0 ∥σh∥V∗∥W − w∥V ≤ ˆ t 0 ∥σh∥2 V∗ + 1 4 ˆ t 0 ∥W − w∥2 V (ǫ = 2 in (5.8)). (5.9) Term 2 ≤ ˆ t 0 ∥(W − wh)t∥V∗∥W − w∥V ≤ ˆ t 0 ∥(W − wh)t∥2 V∗ + 1 4 ˆ t 0 ∥W − w∥2 V (ǫ = 2 in (5.8)). (5.10) We use (5.9) and (5.10) in (5.7) to have the desired estimate (5.5). □ Next, we introduce Ph : V → Vh to be the elliptic projection operator, i.e., a(Phw, vh) = a(w, vh) for all vh ∈ Vh. (5.11) For a given g ∈ L2(Ω), let us suppose u ∈ V and uh ∈ Vh satisfy the following elliptic equations, respectively a(u, v) = (g, v) for all v ∈ V, (5.12) a(uh, vh) = (g, vh) for all vh ∈ Vh. (5.13) From (5.12) and (5.13), we note that a(u − uh, vh) = 0 ∀vh ∈ Vh =⇒ uh = Phu. In addition, for a given positive constant C, the following known a posteriori error estimate holds [29, 24] ∥u − uh∥X ≤ Cη(uh, g : X ) (5.14) ∥u − uh∥L∞(Ω) ≤ C(Ω)(ln ¯h)2η∞(uh, g : L∞(Ω)) (5.15) 8 HARBIR ANTIL AND ROHIT KHANDELWAL where ¯h := minK∈Ωh hK, η∞ is the global error estimator in the L∞-norm, C and C(Ω) are constants which depend only on the properties of an elliptic a posteriori error estimator and η := η(uh, g : X ) is the computable a posteriori error estimator which depends only on the space X := L2(Ω), V or V∗ and the given data uh and g. Next, we note that PhW = wh using Lemma 4.1. Therefore, using similar ideas, we have the following a posteriori error estimate ∥(wh − W)(t)∥L2(Ω) ≤ Cη(wh, zh : L2(Ω)) (5.16) ∥(wh − W)(t)∥L∞(Ω) ≤ C(Ω)(ln ¯h)2η∞(wh, zh : L∞(Ω)) . (5.17) We diﬀerentiate (4.1) with respect to t to get the following a(Wt, v) = (zh,t, v) for all v ∈ V. (5.18) Using (4.2), (5.11), (5.16) and (5.17), there holds PhWt = wh,t , ∥(wh − W)t∥V∗ ≤ Cη(wh,t, zh,t : V∗) and (5.19) ∥(wh − W)t∥L∞(Ω) ≤ C(Ω)(ln ¯h)2η∞(wh,t, zh,t : L∞(Ω)). (5.20) We are now ready to state the main a posteriori result of this section. Theorem 5.3. (Abstract a posteriori error estimate in energy norm) Let w and wh be the continuous and discrete solutions which satisfy (2.1) and (3.5), respectively. Then, for a positive constant C, the following a posteriori error estimate hold for 0 < t ≤ T: 1 2∥(w − wh)(t)∥L2(Ω) ≤ \u0012 ˆ t 0 ∥σh(s)∥2 V∗ds \u0013 1 2 + \u0012 ˆ t 0 η(wh,t, zh,t : V∗)2ds \u0013 1 2 + 1 2η(wh, zh : L2(Ω)) + 1 2∥wh(0) − w0∥L2(Ω) + 1 2η(wh(0), zh(0) : L2(Ω)). (5.21) Proof. Let us consider 1 2∥(wh − w)(t)∥L2(Ω) ≤ 1 2∥(wh − W)(t)∥L2(Ω) + 1 2∥(W − w)(t)∥L2(Ω) ≤ 1 2∥(wh − W)(t)∥L2(Ω) + \u0012 ˆ t 0 ∥σh(s)∥2 V∗ds \u0013 1 2 + \u0012 ˆ t 0 ∥(wh − W)t(s)∥2 V∗ds \u0013 1 2 + 1 2∥W(0) − w(0)∥L2(Ω), (5.22) ELLIPTIC RECONSTRUCTION FOR PARABOLIC VARIATIONAL INEQUALITIES 9 where we used Lemma 5.2 in the second step. In addition, using bounds (5.16) and (5.19), we have 1 2∥(wh − w)(t)∥L2(Ω) ≤ 1 2∥(wh − W)(t)∥L2(Ω) + \u0012 ˆ t 0 ∥σh(s)∥2 V∗ds \u0013 1 2 + \u0012 ˆ t 0 ∥(wh − W)t(s)∥2 V∗ds \u0013 1 2 + 1 2∥W(0) − wh(0)∥L2(Ω) + 1 2∥wh(0) − w(0)∥L2(Ω) ≤ 1 2η(wh, zh : L2(Ω)) + \u0012 ˆ t 0 ∥σh(s)∥2 V∗ds \u0013 1 2 + \u0012 ˆ t 0 η(wh,t, zh,t : V∗)2ds \u0013 1 2 + 1 2∥wh(0) − w0∥L2(Ω) + 1 2η(wh(0), zh(0) : L2(Ω)). □ 5.2. L∞−norm error estimates. In this subsection, we derive the a posteriori error bound in the maximum norm for approximation of solutions to (2.1)–(2.2). The boundary ∂Ω is assumed to be suﬃciently smooth. We collect the regularity result of solution of the parabolic VI (2.1)–(2.2) in the next proposition and refer to [10, Chapter 2] for a proof. Proposition 5.4. Let w solves (2.1)–(2.2), then the following holds (a) Let Ω ⊂ Rd, where d ∈ {2, 3}, be an open bounded domain with suﬃciently smooth boundary. If f ∈ C([0, T]; L∞(Ω)), ∂f ∂t ∈ L1(0, T; L∞(Ω)) and w0 ∈ W 2,∞(Ω)∩V then wt ∈ L∞(0, T; L∞(Ω)) and ∆w ∈ L∞(0, T; L∞(Ω)). (b) Using deﬁnition (2.3) and (a), we get σ = wt − ∆w − f ∈ L∞(0, T; L∞(Ω)). The analysis in maximum norm hinges mainly on the Green’s function for the operator L := ∂t − ∆ (cf, Problem 1.1). The next lemma is useful to our analysis. We refer to [13, Lemma 2.1] and [5, Theorem 6, p. 657] for the proof. Lemma 5.5. Let the assumptions of Proposition 5.4 hold. Then, there exists a Green’s function G(x, t; ξ, τ) for Problem 1.1 which satisﬁes the following: u(x, t) = ˆ Ω G(x, t; ξ, 0)u0(ξ)dξ + ˆ t 0 ˆ Ω G(x, t; ξ, τ)f(ξ, τ)dξdτ, (5.23) where (x, t) ∈ Ω × (0, T] and ∥G(x, t; ·, τ)∥L1(Ω) ≤ 1. (5.24) Using Lemmas 5.5 and 5.1, we derive the next result. Lemma 5.6. For any (x0, t0) ∈ Ω × (0, T], the following error bounds holds: (W − w)(x0, t0) ≤ ∥(W − w)(0)∥L∞(Ω) + ∥σh∥L1(0,t0;L∞(Ω)) + ∥(W − wh)t∥L1(0,t0;L∞(Ω)) (5.25) and ∥(w − wh)(t0)∥L∞(Ω) ≤ ∥(W − w)(0)∥L∞(Ω) + ∥σh∥L1(0,t0;L∞(Ω)) + ∥(W − wh)t∥L1(0,t0;L∞(Ω)) + ∥(W − wh)(t0)∥L∞(Ω). (5.26) 10 HARBIR ANTIL AND ROHIT KHANDELWAL Proof. In view of (5.4), W − w satisﬁes the following ‘parabolic equation’: (W − w)t + A(W − w) = σh − σ + (W − wh)t. Using (5.23) and for (x0, t0) ∈ Ω × (0, T], it holds that (W − w)(x0, t0) = ˆ Ω G(x0, t0; ξ, 0)(W − w)(ξ, 0)dξ | {z } Term A + ˆ t0 0 ˆ Ω G(x0, t0; ξ, τ)(σh − σ)(ξ, τ)dξdτ | {z } Term B + ˆ t0 0 ˆ Ω G(x0, t0; ξ, τ)(W − wh)t(ξ, τ)dξdτ | {z } Term C . (5.27) Next, we note the following using Remark 2.1 and G(x0, t0; ξ, τ) ≥ 0 (cf. [13, Lemma 2.1]), Term B ≤ ˆ t0 0 ˆ Ω G(x0, t0; ξ, τ)σh(ξ, τ)dξdτ. (5.28) We employ the H¨older’s inequality together with estimate (5.24) to conclude the below estimates Term A ≤ ∥(W − w)(0)∥L∞(Ω)∥G(x0, t0; ξ, 0)∥L1(Ω) ≤ ∥(W − w)(0)∥L∞(Ω) (5.29) and Term C ≤ ˆ t0 0 ∥(W − wh)t∥L∞(Ω)∥G(x0, t0; ·, τ)∥L1(Ω)dτ ≤ max τ∈(0,t0) ∥G(x0, t0; ·, τ)∥L1(Ω)∥(W − wh)t∥L1(0,t0;L∞(Ω)) ≤ ∥(W − wh)t∥L1(0,t0;L∞(Ω)). (5.30) The proof of (5.25) follows by inserting estimates (5.28), (5.29) and (5.30) in (5.27). We conclude the proof of (5.26) using the following bound and (5.25) |(w − wh)(x0, t0)| ≤ |(W − w)(x0, t0)| + |(W − wh)(x0, t0)|. □ We state and prove the abstract a posteriori estimate in the maximum norm next. Theorem 5.7. (Abstract a posteriori error estimate in L∞-norm) Let (w, wh) be a pair of continuous and discrete solutions satisfying (2.1) and (3.5). Then, ∥(w − wh)(t0)∥L∞(Ω) ≤ ∥σh∥L1(0,t0;L∞(Ω)) + C(Ω)(ln ¯h)2\u0010 η∞(wh(0), zh(0) : L∞(Ω)) + η∞(wh(t0), zh(t0) : L∞(Ω)) + ∥η∞(wh,t, zh,t : L∞(Ω))∥L1(0,t0) \u0011 , (5.31) where t0 ∈ (0, T]. ELLIPTIC RECONSTRUCTION FOR PARABOLIC VARIATIONAL INEQUALITIES 11 Proof. The proof is analogous to that of Theorem 5.3 as we use the estimates (5.15) and (5.20) to bound the terms in (5.26) using Lemma 5.6. □ Remark 5.8. It is easy to see that for v ∈ V, we have ⟨σh, v⟩−1,1 = (σh, v). Once this is used in the proof of Lemma 5.2, the estimate in (5.5) still remains true with ∥σh∥V∗ replaced by ∥σh∥L2(Ω). Diﬀerent choices for σh (eg., the “broken” nodal multipliers [16, 25] or using the partition of unity [26]) could give rise to diﬀerent bounds for ∥σh∥V∗ in estimates (5.21) and (5.31). 6. Applications In this section, we will provide an explicit form of η(wh,t, zh,t : V∗) mentioned in estimate (5.21). In other words, we will bound ∥(wh − W)t∥V∗ using (5.19). Let t ∈ (0, T) and p := (wh − W)t, we ﬁrst recall the deﬁnition of dual norm ∥p∥V∗ := sup ∥v∥V≤1 ⟨p, v⟩−1,1. (6.1) Let Ω be suﬃciently smooth and using the duality arguments, we state the next remark which will be useful to derive the residual-type error estimate. Remark 6.1. For any given ψ ∈ V and using the standard duality arguments, let us deﬁne φ ∈ V by a(φ, v) = ⟨v, ψ⟩−1,1 ∀v ∈ V . (6.2) Also there exists a constant C1 > 0 which depends on Ω such that ∥φ∥H3(Ω) ≤ C1∥ψ∥H1(Ω). (6.3) Using deﬁnition (3.3), we denote Jh,t := [[∂hwh,t]]. In the next lemma, we provide the bound on the term ∥(wh − W)t∥V∗. Lemma 6.2. Let Ω be suﬃciently smooth and k ≥ 2 be the polynomial degree, then it holds that ∥p∥V∗ := ∥(wh − W)t∥V∗ ≤ Cη1 h(wh,t), (6.4) where η1 h(wh,t)2 := P K∈Ωh h6 K∥(f + σh + ∆wh,t − wh)t∥2 L2(K) + P e∈Γh h5 K∥Jh,t∥2 L2(e). Proof. Using the deﬁnitions of p, φ (Remark 6.1) and suitable construction of interpolation operator Πh : V → Vh (for instance Clement’s interpolant [9]), we consider the following ⟨p, ψ⟩−1,1 = a(φ, p) = a(φ − Πhφ, p) (using (5.19) i.e., Galerkin Orthogonality) ≤ X K∈Ωh ˆ K \f\f(φ − Πhφ)∆p \f\fdx + X e∈Γh ˆ e \f\f(φ − Πhφ)[[∂hp]] \f\f = X K∈Ωh ˆ K \f\f(φ − Πhφ)∆p \f\fdx + X e∈Γh ˆ e \f\f(φ − Πhφ) \f\f\f\f[[∂hwh,t]] \f\f 12 HARBIR ANTIL AND ROHIT KHANDELWAL where we used that [[∂hWt]] = 0 (in the last step) using the elliptic regularity. Then, we have ⟨p, ψ⟩−1,1 = X K∈Ωh ˆ K h−3 K \f\f(φ − Πhφ) \f\fh3 K \f\f∆p \f\fdx + X e∈Γh ˆ e h − 5 e 2 \f\f(φ − Πhφ) \f\fh 5 2e \f\f[[∂hwh,t]] \f\fds ≤ X K∈Ωh h−3 K ∥φ − Πhφ∥L2(K)h3 K∥∆p∥L2(K) + X e∈Γh h − 5 2 e ∥φ − Πhφ∥L2(e)h 5 2e ∥[[∂hwh,t]]∥L2(e). (6.5) Using the following relation ∆p = ∆(wh − W)t = ∆wh,t − ∆Wt = ∆wh,t + (f + σh − wh,t)t (using (4.1)) = (f + σh + ∆wh,t − wh)t and the standard interpolation estimates [9, Section 4.4], discrete trace inequality (Lemma 3.1) and estimate (6.3), we conclude from (6.5) ⟨p, ψ⟩−1,1 ≤ C2η1 h(wh,t)∥φ∥H3(Ω) =⇒ ∥p∥V∗ ≤ Cη1 h(wh,t), where C2 > 0 is an interpolation estimate constant and C = C1C2. □ Using similar arguments, we have the following lemma for k ≥ 2. Lemma 6.3. Let C > 0 be a positive constant, then the following holds η(wh, zh : L2(Ω)) ≤ Cη0 h(wh), (6.6) where η0 h(wh)2 := P K∈Ωh h4 K∥f + σh + ∆wh,t − wh∥2 L2(K) + P e∈Γh h3 K∥Jh∥2 L2(e). Finally, we use Lemmas 6.2 and 6.3 in Theorem 5.3 to state the residual type a posteriori error estimate for the displacements. Theorem 6.4. Let t ∈ (0, T] and Ω be suﬃciently smooth. If k ≥ 2, then, the following a posteriori error estimate hold for 0 < t ≤ T: 1 2∥w(t) − wh(t)∥L2(Ω) ≲ 1 2η0 h(wh) + \u0012 ˆ t 0 ∥σh(s)∥2 V∗ds \u0013 1 2 + \u0012 ˆ t 0 (η1 h(wh,t(s)))2ds \u0013 1 2 + 1 2∥wh(0) − w0∥L2(Ω) + 1 2η0 h(wh(0)). (6.7) Let k = 1 be the polynomial degree as discussed in [22], due to the lack of superconvergence in V∗, the use of negative norm does not give better results. Hence, we use the following estimate using (6.6) L2(Ω) ֒→ V∗ and η(wh,t, zh,t : V∗) ≤ η(wh,t, zh,t : L2(Ω)) ≤ Cη0 h(wh,t), (6.8) ELLIPTIC RECONSTRUCTION FOR PARABOLIC VARIATIONAL INEQUALITIES 13 where the last inequality holds due to the classical duality argument, see [2, Sec. 3.3]. In view of Theorem 5.3, we obtain the following a posteriori error estimate for k = 1 1 2∥w(t) − wh(t)∥L2(Ω) ≲ 1 2η0 h(wh) + \u0012 ˆ t 0 ∥σh(s)∥2 V∗ds \u0013 1 2 + \u0012 ˆ t 0 (η0 h(wh,t(s)))2ds \u0013 1 2 + 1 2∥wh(0) − w0∥L2(Ω) + 1 2η0 h(wh(0)). (6.9) Acknowledgement We are thankful to Mahamadi Warma for suggestions on Remark 2.1 and several discus- sions. References [1] Yves Achdou, Fr´ed´eric Hecht, and David Pommier. A posteriori error estimates for parabolic variational inequalities. Journal of Scientiﬁc Computing, 37:336–366, 2008. [2] Mark Ainsworth and J. Tinsley Oden. A posteriori error estimation in ﬁnite element analysis. Comput. Methods Appl. Mech. Engrg., 142(1-2):1–88, 1997. [3] Mark Ainsworth and J Tinsley Oden. A posteriori error estimation in ﬁnite element analysis, volume 37. John Wiley & Sons, 2011. [4] Mark Ainsworth, J Tinsley Oden, and CY Lee. Local a posteriori error estimators for variational in- equalities. Numerical methods for partial diﬀerential equations, 9(1):23–33, 1993. [5] D. G. Aronson. Non-negative solutions of linear parabolic equations. Ann. Scuola Norm. Sup. Pisa Cl. Sci. (3), 22:607–694, 1968. [6] S¨oren Bartels and Carsten Carstensen. Averaging techniques yield reliable a posteriori ﬁnite element error control for obstacle problems. Numerische Mathematik, 99:225–249, 2004. [7] S¨oren Bartels and Alex Kaltenbach. Explicit and eﬃcient error estimation for convex minimization problems. Math. Comp., 92(343):2247–2279, 2023. [8] S¨oren Bartels and R¨udiger M¨uller. Quasi-optimal and robust a posteriori error estimates in L∞(L2) for the approximation of Allen-Cahn equations past singularities. Math. Comp., 80(274):761–780, 2011. [9] Susanne Brenner and Ridgway Scott. The mathematical theory of ﬁnite element methods, volume 15. Springer Science & Business Media, 2007. [10] Ha¨ım Br´ezis. Probl`emes unilat´eraux. J. Math. Pures Appl. (9), 51:1–168, 1972. [11] Zhiming Chen and Ricardo H Nochetto. Residual type a posteriori error estimates for elliptic obstacle problems. Numerische Mathematik, 84:527–548, 2000. [12] Philippe G Ciarlet. The ﬁnite element method for elliptic problems. SIAM, 2002. [13] Alan Demlow, Omar Lakkis, and Charalambos Makridakis. A posteriori error estimates in the maximum norm for parabolic problems. SIAM journal on numerical analysis, 47(3):2157–2176, 2009. [14] Kenneth Eriksson and Claes Johnson. Adaptive ﬁnite element methods for parabolic problems i: A linear model problem. SIAM Journal on Numerical Analysis, 28(1):43–77, 1991. [15] Kenneth Eriksson and Claes Johnson. Adaptive ﬁnite element methods for parabolic problems. II. Optimal error estimates in L∞L2 and L∞L∞. SIAM J. Numer. Anal., 32(3):706–740, 1995. [16] Francesca Fierro and Andreas Veeser. A posteriori error estimators for regularized total variation of characteristic functions. SIAM journal on numerical analysis, 41(6):2032–2055, 2003. [17] Roland Glowinski. Numerical methods for nonlinear variational problems. Springer Series in Computa- tional Physics. Springer-Verlag, New York, 1984. [18] Thirupathi Gudi and Papri Majumder. Conforming and discontinuous Galerkin FEM in space for solving parabolic obstacle problem. Comput. Math. Appl., 78(12):3896–3915, 2019. [19] M. Hinterm¨uller, K. Ito, and K. Kunisch. The primal-dual active set strategy as a semismooth Newton method. SIAM J. Optim., 13(3):865–888 (2003), 2002. 14 HARBIR ANTIL AND ROHIT KHANDELWAL [20] Ronald HW Hoppe and Ralf Kornhuber. Adaptive multilevel methods for obstacle problems. SIAM journal on numerical analysis, 31(2):301–323, 1994. [21] Omar Lakkis and Charalambos Makridakis. Elliptic reconstruction and a posteriori error estimates for fully discrete linear parabolic problems. Mathematics of computation, 75(256):1627–1658, 2006. [22] Charalambos Makridakis and Ricardo H Nochetto. Elliptic reconstruction and a posteriori error esti- mates for parabolic problems. SIAM journal on numerical analysis, 41(4):1585–1594, 2003. [23] Kyoung-Sook Moon, Ricardo H Nochetto, Tobias Von Petersdorﬀ, and Chen-song Zhang. A posteriori error analysis for parabolic variational inequalities. ESAIM: Mathematical Modelling and Numerical Analysis, 41(3):485–511, 2007. [24] Ricardo H. Nochetto, Alfred Schmidt, Kunibert G. Siebert, and Andreas Veeser. Pointwise a posteriori error estimates for monotone semi-linear equations. Numer. Math., 104(4):515–538, 2006. [25] Ricardo H Nochetto, Kunibert G Siebert, and Andreas Veeser. Pointwise a posteriori error control for elliptic obstacle problems. Numerische Mathematik, 95(1):163–195, 2003. [26] Ricardo H Nochetto, Kunibert G Siebert, and Andreas Veeser. Fully localized a posteriori error esti- mators and barrier sets for contact problems. SIAM journal on numerical analysis, 42(5):2118–2135, 2005. [27] Ricardo H Nochetto, Tobias von Petersdorﬀ, and Chen-Song Zhang. A posteriori error analysis for a class of integral equations and variational inequalities. Numerische Mathematik, 116(3):519–552, 2010. [28] Andreas Veeser. Eﬃcient and reliable a posteriori error estimators for elliptic obstacle problems. SIAM journal on numerical analysis, 39(1):146–167, 2001. [29] R¨udiger Verf¨urth. A review of a posteriori error estimation. In and Adaptive Mesh-Reﬁnement Tech- niques, Wiley & Teubner. Citeseer, 1996. [30] Mary Fanett Wheeler. A priori l 2 error estimates for galerkin approximations to parabolic partial diﬀerential equations. SIAM Journal on Numerical Analysis, 10(4):723–759, 1973. [31] Paul Wilmott, Jeﬀ Dewynne, and Sam Howison. Option pricing: mathematical models and computation. (No Title), 1993. Harbir Antil, Department of Mathematical Sciences and the Center for Mathematics and Artificial Intelligence (CMAI), George Mason University, Fairfax, VA 22030, USA. Email address: hantil@gmu.edu Rohit Khandelwal, Department of Mathematical Sciences and the Center for Mathe- matics and Artificial Intelligence (CMAI), George Mason University, Fairfax, VA 22030, USA. Email address: rkhandel@gmu.edu "
}