{
    "optim": "OUT-OF-TIME-ORDERED CORRELATORS FOR WIGNER MATRICES\nGiorgio Cipolloni∗\ngc4233@princeton.edu\nL´aszl´o Erd˝os†\nlerdos@ist.ac.at\nJoscha Henheik†\njoscha.henheik@ist.ac.at\nAbstract. We consider the time evolution of the out-of-time-ordered correlator (OTOC) of two general\nobservables A and B in a mean field chaotic quantum system described by a random Wigner matrix as its\nHamiltonian. We rigorously identify three time regimes separated by the physically relevant scrambling\nand relaxation times. The main feature of our analysis is that we express the error terms in the optimal\nSchatten (tracial) norms of the observables, allowing us to track the exact dependence of the errors on\ntheir rank. In particular, for significantly overlapping observables with low rank the OTOC is shown to\nexhibit a significant local maximum at the scrambling time, a feature that may not have been noticed\nin the physics literature before. Our main tool is a novel multi-resolvent local law with Schatten norms\nthat unifies and improves previous local laws involving either the much cruder operator norm (cf. [10])\nor the Hilbert-Schmidt norm (cf. [11]).\nKey words: Relaxation, Scrambling time, Multi-resolvent local law, Schatten norm.\n2020 Mathematics Subject Classification: 60B20, 82C10.\n1. Introduction\nA basic feature of a strongly interacting quantum system is that local initial states become non-local\nalong the unitary time evolution, in particular they become increasingly harder to distinguish by local\nobservables. The simplest way to detect this chaotic behavior is to monitor the overlap ⟨A(t)B⟩ of the\nHeisenberg time evolution A(t) := e−itHAeitH of an observable A with another static observable B, where\nH is the Hamiltonian and A, B are Hermitian operators. Here ⟨M⟩ :=\n1\nN TrM denotes the normalized\ntrace of an N × N matrix, N is the dimension of the quantum state space. As time goes on, the overlap\nbetween two local observables converges to its stationary value in a process called quantum thermalisation.\nSince this stationary value is practically1 factorized, ⟨A⟩⟨B⟩, the original observable A becomes hardly\ndetectable from its time evolution by local observables B.\nA more refined measure of the dynamically evolving quantum chaos is the out-of-time-ordered correlator\n(OTOC) of two observables, defined as2\nCA,B(t) := 1\n2\n\n\f\f[A(t), B]\n\f\f2\u000b\n(1.1)\nmeasuring the evolution of the commutator of A(t) and B. Starting with commuting observables, [A, B] =\n0, this quantity initially grows, expressing how the time evolution A(t) of a local observable spreads (or\nscrambles) to non-local degrees of freedom expressed by B. The moment when this growth stops is called3\nthe scrambling time t∗. Scrambling is closely related to thermalisation, but it typically involves non-local\nobservables B. Thus in a quantum system with local interactions, the thermalisation time is smaller than\nt∗ and it is independent of the system size, while the scrambling takes place on a longer time scale until\nlocal information is shared with all degrees of freedom in the system. Beyond the scrambling time, the\nOTOC settles to constant value at a larger time scale called the relaxation time, and then it remains\nessentially unchanged.\n∗Princeton Center for Theoretical Science and Department of Mathematics, Princeton University, Princeton, NJ 08544,\nUSA.\n†Institute of Science and Technology Austria, Am Campus 1, 3400 Klosterneuburg, Austria.\n†Supported by ERC Advanced Grant “RMTBeyond” No. 101020331.\n1In a closed quantum system with finitely many degrees of freedom the initial state is never fully lost as the stationary\nvalue still slightly depends on the original overlap ⟨AB⟩, but it is suppressed by N; e.g. it follows from (1.2) that\nlim\nt→∞ EGUE⟨A(t)B⟩ =\n\u0010\n1 −\n1\nN + 1\n\u0011\n⟨A⟩⟨B⟩ +\n1\nN + 1 ⟨AB⟩.\n2In the physics literature, the OTOC is usually defined without the factor 1/2. We chose it, however, for convenience.\n3We remark that some papers use slightly different definition, here we follow the terminology of [27], [17, Section 3.3].\n1\narXiv:2402.17609v1  [math-ph]  27 Feb 2024\n2\nCIPOLLONI, ERD ˝OS, AND HENHEIK\nThe fine distinction between thermalisation and scrambling became very popular in physics about 15\nyears ago motivated by the fundamental papers by Hayden and Preskill [28] and Sekino and Susskind\n[40] related to the black hole information paradox. The concept of the OTOC in quantum chaos research\nwas introduced in Kitaev’s lectures [30] on the connection between the Sachdev-Ye-Kitaev (SYK) model\nand black holes. Owing to these fascinating connections, the physics literature on OTOC in various\ninteracting quantum systems has become enormous; we refer the reader to the reviews [41, 27] and\nextensive references therein. In contrast, OTOC has basically not been considered in the mathematical\nliterature apart from [34] that studies a very different model than our current random matrix setup.\nBesides the OTOC, quantum chaos has several other signatures: the conventional one is the spectral\nstatistics of the Hamiltonian. Following E. Wigner’s groundbreaking observation, in a sufficiently chaotic\nquantum system the local eigenvalue statistics are given by the universal Wigner-Dyson distribution that\ndepends only on the basic symmetries of the system. In the physics literature the spectral statistics are\noften described by the spectral form factor (SFF), or two point spectral correlator, defined as r2(t) :=\nE|⟨eitH⟩|2, where E indicates a statistical averaging over an ensemble of Hamiltonians. It is well known\nthat the SFF tends to become universal for large times4, while it still reflects properties of the actual\nquantum system (especially its density of states) for shorter times. A good physics summary is found\nin [17], while a recent mathematical analysis of the SFF for general Wigner matrices was given in [9];\nmore precise formulas are available for exactly solvable ensembles [23, 24, 25].\nThe OTOC is a more refined description of quantum chaos than the SFF, as it also involves observ-\nables. In particular, the SFF misses important features like the sensitivity of chaos to the locality of the\nobservables or early time chaos, i.e. the exponential growth of the OTOC for certain strongly interact-\ning systems like SYK (called fast scramblers [40]) versus the polynomial growth for slow scramblers like\ncertain weakly chaotic systems (see, e.g. [26, Section II] and references therein). Note that the SFF can\nbe recovered from the OTOC by averaging, either over the observables or over the unitary group in case\nof unitarily invariant Hamiltonians, see [17]. For example, if H is a GUE random matrix, then [17, Eq.\n(57)-(58)])\nEGUE⟨A(t)B⟩ = ⟨A⟩⟨B⟩ + N 2r2(t) − 1\nN 2 − 1\n\u0002\n⟨AB⟩ − ⟨A⟩⟨B⟩\n\u0003\n,\n(1.2)\nwith\nr2(t) =\n\u0010J1(2t)\nt\n\u00112\n+ 1\nN − 1\nN\n\u0010\n1 −\nt\n2N\n\u0011\n1(t ≤ 2N),\nwhere J1 is the Bessel function of the first kind of order one. Thus r2(t) can be expressed from ⟨A(t)B⟩.\nA similar relation holds between the OTOC and the four point spectral correlator.\nThe main goal of the current paper is to give a comprehensive mathematical analysis of the OTOC with\ngeneral observables A, B, when the Hamiltonian H is a Wigner matrix. Wigner matrices represent the\nHamiltonian of the most chaotic quantum systems with matrix elements being independent, identically\ndistributed (i.i.d.) random variables. In the physics literature, random matrix theory (RMT) is often used\nas a test case to see to what extent this relatively simple model mimics the physics of more complicated\nsystems such as interacting many-body models (like SYK) or even models with nontrivial spatial structure\n(like spin chains). Spectral statistics are remarkably robust, especially the universality of the large time\n(so-called plateau) regime of the SFF has proved to be ubiquitous in many different chaotic quantum\nsystems, in accordance with the celebrated Bohigas-Giannoni-Schmit conjecture [5]. The OTOC is a\nmore delicate quantity and, admittedly, its several interesting features that appear in more realistic\nstrongly coupled systems are not captured by RMT. For example, the early time exponential growth\nof the OTOC is not present in RMT and there is no qualitative difference between the thermalisation\nand scrambling times since H is mean field (see [17, Section 3.3] for a detailed analysis). The difference\nbetween chaotic and integrable systems or the effect of their possible coexistence on the OTOC (studied\ne.g. in [26]) are also not visible in RMT since Wigner matrices are fully chaotic. Nevertheless, RMT\nbecomes a good description beyond the scrambling time as claimed in [17, Section 3.3] and demonstrated\nin [17, Section 6]. The calculations are performed under the unitary invariance assumption and without\ncontrolling the error terms.\nIn the main Theorem 2.2 of the current work, using very different methods, we rigorously describe the\nbehaviour of CA,B(t) up to very long times for general Wigner matrices (no unitary invariance assumed).\nWe mimic the locality of the observables by considering matrices A, B that are far from being full rank\n4See the celebrated slope-dip-ramp-plateau picture, e.g. in [35].\nOUT-OF-TIME-ORDERED CORRELATORS FOR WIGNER MATRICES\n3\nand track this effect throughout all error terms by using tracial norms that are sensitive to the rank. We\ndistinguish three time regimes (see Figure 1 and Section 2.1); for short times (before the scrambling time\nt∗) we find a quadratic growth in t; for intermediate times we find that CA,B(t) heavily depends on the\nranks of A, B and their overlap AB. In particular, we detect a remarkable high peak of CA,B(t) when\nthe ranks of A and B are small but their overlap ⟨AB⟩ is still relatively large. To our knowledge, this\nobservation may be new even in the physics literature. We then identify the relaxation time, t∗∗, when\nthe OTOC saturates, i.e. it becomes essentially constant (equal its thermal limiting value) with small\noscillations. As expected, in the last regime, after t∗∗, our model behaves universally; a qualitatively\nsimilar behaviour has been demonstrated for several more complicated systems in the physics literature\nboth theoretically and numerically, see e.g. [17, 26, 41, 36, 27]. While for technical reasons we cannot\nconsider infinite times, our analysis is valid for sufficiently long times to see all physically relevant features.\nFor brevity we carry out the proofs at infinite temperature, but our methods can easily be extended to\nany finite temperature and we will give the corresponding formulas (see Section 2.2 below).\nFigure 1. The two curves show the behaviour of CA,B(t) in two different scenarios for\ntwo commuting traceless observables A, B normalized to ⟨A2⟩ = ⟨B2⟩ = 1. The black\ncurve represents the case A = B with rank(A) = N a, a ∈ [0, 1] where the OTOC exhibits\na large peak of size N 1−a around the scrambling time t∗ ∼ 1. Afterwards, it decays to\nits thermal limiting value (normalized to one) around the relaxation time t∗∗ ∼ N\n1−a\n3 .\nThe red curve represents the case where AB = 0. Here, both t∗ and t∗∗ are of order one,\nindependent of the ranks of A and B. For more details see Section 2.1.\nFrom the mathematical point of view, our work is the closest to [8, 10], where the deterministic leading\nterm of traces of products of observables at different times, ⟨A1(t1)A2(t2)A3(t3)....⟩, were computed (see\nalso [38, 39], where even the Gaussian fluctuations of such chains were proven). Clearly the OTOC is a\nspecial case of (the difference of two) such chains. The main novelty is that now we use only Schatten\n(tracial) norms5 of the observables in the estimates, while [8, 38, 39] used the much cruder operator\nnorm. In particular, we can extend the time scale for the validity of our description. More importantly,\nnote that the interesting features of the OTOC are manifested for small rank observables for which the\noperator norm is a major overestimate and conceptually is an overkill.\nThe main tool is a concentration result, called multi-resolvent local law, for alternating products of\nresolvents of random matrices and deterministic matrices.\nMore precisely, setting Gi := G(zi) and\n5The (normalized) p-th Schatten norm of a matrix A ∈ CN×N is defined as ⟨|A|p⟩1/p for p ∈ [1, ∞), where |A| :=\n(AA∗)1/2.\n4\nCIPOLLONI, ERD ˝OS, AND HENHEIK\nconsidering deterministic matrices Ai, the main object of interest is\nG1A1G2A2G3 . . . Ak−1Gk\n(1.3)\nfor some fixed k. We will show that (1.3) concentrates around a deterministic object and gives an upper\nbound on the fluctuation. The interesting regime is the local one, i.e. when |Im zi| ≪ 1. Resolvents can\nthen be converted to unitary time evolution eitH by standard contour integration.\nLocal laws in general assert that resolvents G(z) tend to become deterministic (with high probability)\nin the large N limit even if the spectral parameter z is very close to the real axis (typically for any\n|Im z| ≫ N −1 in the bulk spectrum). For example, typical single resolvent local laws for Wigner matrices\nassert that, for any fixed ξ > 0,6\n\f\f⟨(G(z)−m(z))A⟩\n\f\f ≤ N ξ∥A∥\nNη\n,\n\f\f⟨x, (G(z)−m(z))y⟩\n\f\f ≤ N ξ∥x∥∥y∥\n√Nη\n,\nwith\nη := |Im z| , (1.4)\nfor a deterministic matrix A ∈ CN×N and deterministic vectors x, y ∈ CN with very high probability as\nN becomes large. Here, m(z) is the Stieltjes-transform of the Wigner semicircle law:\nm(z) = msc(z) :=\nZ\nR\n1\n(x − z)ρsc(x) dx,\nρsc(x) := 1\n2π\np\n[4 − x2]+.\n(1.5)\nHowever, the deterministic limit of a multi-resolvent chain (1.3) is not simply m(z1)m(z2)A1A2 . . . , i.e,\none cannot mechanically replace each G by a scalar m, the actual formula is much more complicated,\nsee (3.2) below. As to the accuracy of this deterministic approximation, besides N and the imaginary\npart of the spectral parameter, η = Im z, the error term crucially depends on the appropriate norms\nof Ai as well as on the distinction whether Ai is traceless or not. The fact that traceless observables\nsubstantially reduce both the size of the deterministic limit of (1.3) and of its fluctuation has first been\nobserved and exploited in [7], see also [10] for a comprehensive analysis of arbitrary long chains. The\nresults in [10] were optimal both in N and η, but they all used the simplest operator norm of Ai’s in the\nerror term which is far from being optimal for low rank observables.\nConcerning the more accurate norms, only very recent papers [11, 14] started deviating from the\noperator norm in the error terms.\nThe main purpose of these papers was to prove the Eigenstate\nThermalisation Hypothesis (ETH) for random matrices (originally posed by Deutsch in [18]) in its most\noptimal form, including low rank observables. Moreover, the key point in [14] was to obtain ETH also\nuniformly in the spectrum, including the critical edge regime. This required to focus on a local law for\n⟨Im GAIm GA⟩ and to extract the smallness of order ρ2 at the spectral edge owing to the imaginary part\nof the resolvents (here ρ = π−1|Im msc| is the local density of states). However, [11, 14] exclusively used\nthe Hilbert-Schmidt (HS) norm, ⟨|A|2⟩1/2, which caused suboptimal (Nη)-dependence. For the purpose\nof [11, 14], this suboptimality in (Nη) was irrelevant since the proof of ETH relies on local laws in the\nη–regime when Nη is practically order one.\nIn contrast to [11, 14], for studying the OTOC at shorter times, we need local laws in the regime where\nNη is large (since η ∼ 1/t dictated by the contour integration and t ≪ N). In the current paper we\nprove local laws that are optimal both in N and η and use the optimal Schatten norms of the observables.\nEspecially, this allows for a more accurate description of the OTOC in the physically relevant regime\nof small rank observables. We, however, do not need to track the ρ-dependence or pay attention to the\nimaginary parts. Therefore, the current work and [14] are complementary; they effectively handle very\ndifferent aspects of the local law. While the fundamental idea of these two works is similar, both use the\nZigzag strategy described in Section 4, the actual proofs are quite different. The main focus in [14] was to\ndesign and handle contour integral representations that allowed us to reduce every estimate to resolvent\nchains involving only Im G’s. In the current paper Im G plays no role, but we need to track the precise\nSchatten norms very carefully.\nTo illustrate the strength of our new result in comparison with the previous bounds, we present the\nfollowing three estimates for the simplest case k = 2, with A1 = A2 = A, z1 = z2 in the bulk, and\n6Traditionally [19, 31, 4], local laws did not consider arbitrary test matrix A, but only A = I or special rank one\nprojections A = yx∗ leading to the isotropic local law in (1.4). General A was included later, e.g. in [22].\nOUT-OF-TIME-ORDERED CORRELATORS FOR WIGNER MATRICES\n5\nignoring N ξ-factors for some arbitrarily small ξ > 0:\n\f\f\f⟨GAGA⟩ − m2⟨A2⟩\n\f\f\f ≲\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n∥A∥2\nNη\nfrom [10, Theorem 2.5];\n√Nη ⟨|A|2⟩\nNη\nfrom [11, Theorem 2.2];\n⟨|A|2⟩\nNη\n+ ⟨|A|4⟩1/2\nN√η\nfrom Theorem 3.3.\n(1.6)\nNote that our current result in the last line of (1.6) implies both previous results since ⟨|A|4⟩1/2 ≤\n√\nN⟨|A|2⟩ and ⟨|A|p⟩1/p ≤ ∥A∥. While the former bound saturates for low rank observables, the latter\nsaturates for high rank ones.\nTherefore, our new result with Schatten norms optimally interpolates\nbetween these two, at least in the bulk regime.\nNotations. By ⌈x⌉ := min{m ∈ Z: m ≥ x} and ⌊x⌋ := max{m ∈ Z: m ≤ x} we denote the upper and\nlower integer part of a real number x ∈ R. For k ∈ N we set [k] := {1, ..., k}, and ⟨A⟩ := d−1Tr(A),\nd ∈ N, for the normalised trace of a d × d-matrix A, while rk A ≡ rank A denotes its rank. For positive\nquantities f, g we write f ≲ g resp. f ≳ g and mean that f ≤ Cg resp. f ≥ cg for some N-independent\nconstants c, C > 0 that may depend only on the basic control parameters Cp, see (2.1) in Assumption 2.1\nbelow. Moreover, we will also write f ∼ g in case that f ≲ g and g ≲ f.\nWe denote vectors by bold-faced lower case Roman letters x, y ∈ CN, for some N ∈ N, and define\n⟨x, y⟩ :=\nX\ni\n¯xiyi ,\nAxy := ⟨x, Ay⟩ .\nMatrix entries are indexed by lower case Roman letters a, b, c, ..., i, j, k, ... from the beginning or the\nmiddle of the alphabet and unrestricted sums over those are always understood to be over {1, ..., N}.\nWe will use the concept ’with very high probability’, meaning that for any fixed D > 0, the probability\nof an N-dependent event is bigger than 1 − N −D for all N ≥ N0(D). Also, we will use the convention\nthat ξ > 0 denotes an arbitrarily small positive exponent, independent of N. Moreover, we introduce the\ncommon notion of stochastic domination (see, e.g., [20]): For two families\nX =\n\u0010\nX(N)(u) | N ∈ N, u ∈ U (N)\u0011\nand\nY =\n\u0010\nY (N)(u) | N ∈ N, u ∈ U (N)\u0011\nof non-negative random variables indexed by N, and possibly an additional parameter u from a parameter\nspace U (N), we say that X is stochastically dominated by Y , if for all ϵ, D > 0 we have\nsup\nu∈U (N) P\nh\nX(N)(u) > N ϵY (N)(u)\ni\n≤ N −D\nfor large enough N ≥ N0(ϵ, D). In this case we write X ≺ Y . If for some complex family of random\nvariables we have |X| ≺ Y , we also write X = O≺(Y ).\n2. Main results\nWe consider N×N Wigner matrices W, i.e. W is a random real symmetric or complex Hermitian matrix\nW = W ∗ with independent entries (up to the Hermitian symmetry) and with single entry distributions\nwaa\nd= N −1/2χd, and wab\nd= N −1/2χod, for a > b. The random variables χd, χod satisfy the following\nassumptions.7\nAssumption 2.1. The off-diagonal distribution χod is a real or complex centered random variable,\nEχod = 0, satisfying E|χod|2 = 1. The diagonal distribution is a real centered random variable, Eχd = 0.\nFurthermore, we assume the existence of high moments, i.e. for any p ∈ N there exists Cp > 0 such that\nE\n\u0002\n|χd|p + |χod|p\u0003\n≤ Cp .\n(2.1)\nOur main result, Theorem 2.2 below, concerns the Heisenberg time evolution A(t) := e−iW tAeiW t of\na fixed deterministic self-adjoint observable A = A∗ ∈ CN×N governed by the Wigner matrix W. More\nprecisely, we consider the out-of-time-ordered correlator (OTOC)\nCA,B(t) := 1\n2\n\n\f\f[A(t), B]\n\f\f2\u000b\n=\n\nA(t)2B2\u000b\n−\n\nA(t)BA(t)B\n\u000b\n(2.2)\n7By inspecting our proof, it is easy to see that actually we do not need to assume that the off-diagonal entries of W are\nidentically distributed. We only need that they all have the same second moments, but higher moments can be different.\n6\nCIPOLLONI, ERD ˝OS, AND HENHEIK\nwith another self-adjoint observable B = B∗ ∈ CN×N, consisting of a two-point and a four-point8 part,\nDA,B(t) :=\n\nA(t)2B2\u000b\nand\nFA,B(t) :=\n\nA(t)BA(t)B\n\u000b\n,\nrespectively.\n(2.3)\nIn the formulation of Theorem 2.2, a key role is played by the Fourier transform of the semicircular\ndensity (1.5),\nφ(t) := c\nρsc(t) =\nZ 2\n−2\ndxρsc(x)eixt = J1(2t)\nt\n,\nt ∈ R,\n(2.4)\nwhere we recall that J1 is the Bessel function of the first kind of order one. We note that by standard\nasymptotics of the Bessel functions on the real line, it holds that\nJ1(s) =\n\n\n\n\n\n\n\n−sgn(s) cos\n\u0010\n|s| + π\n4\n\u0011 r 2\nπ|s| + O\n\u0012\n1\n|s|3/2\n\u0013\ns → ±∞ ,\ns\n2 − 1\n2\n\u0010s\n2\n\u00113\n+ O(|s|5)\ns → 0 .\n(2.5)\nFor simplicity, we formulate our main result only for traceless matrices, ⟨A⟩ = ⟨B⟩ = 0 and at infinite\ntemperature. For general observables, see Remark 2.3 and for finite temperature, see Section 2.2.\nTheorem 2.2 (OTOC for Wigner matrices). Let W be a Wigner matrix satisfying Assumption 2.1 and\nlet A, B ∈ CN×N be self-adjoint deterministic matrices which are traceless, ⟨A⟩ = ⟨B⟩ = 0. Fix any\nϵ > 0. Then, the OTOC (2.2) satisfies\nCA,B(t) =⟨A2⟩⟨B2⟩\n\u0002\n1 − φ(t)2\u0003\n+ 2⟨AB⟩2φ(t)2 \u0002\nφ(2t) − φ(t)2\u0003\n+ ⟨A2B2⟩ φ(t)2 − ⟨ABAB⟩φ(t)4 + O≺\n\u0000EA,B(t, N)\n\u0001\n(2.6)\nwith an error term\nE = EA,B(t, N) := et/N 1/2−ϵ \u0012|t|4⟨A2⟩2\nN\n+ |t|⟨A8⟩1/2\nN\n\u00131/2 \u0012|t|4⟨B2⟩2\nN\n+ |t|⟨B8⟩1/2\nN\n\u00131/2\n.\n(2.7)\nThe proof of Theorem 2.2 is given in Section 3.3 below. It is based on a novel multi-resolvent local law\nwith error terms involving optimal Schatten norms, see Theorem 3.3.\nRemark 2.3. We have several comments on Theorem 2.2:\n(i) [Non-traceless observables] For general observables A, B, we can decompose them into a tracial\nand traceless part, A =: ⟨A⟩ + ˚\nA, and similarly for B. The tracial parts, ⟨A⟩ and ⟨B⟩, then\ncommute with the unitary time evolution eitW and one straightforwardly obtains a result similar\nto Theorem 2.2 (see also Remark 3.5).\n(ii) [Variance of fluctuations] The size of the fluctuations around the deterministic leading term in\n(2.6), i.e. the variance of CA,B(t), is explicitly computable, following the arguments leading to [38,\nLemma 2.5]. The result is expressible purely in terms of Schatten norms of A and B (cf. [38,\nLemma 2.5 and Definition 3.4]), however in [38, 39] the error terms are still in terms of crude\noperator norms.\n(iii) [Gaussianity] It is also possible to prove Gaussianity of the fluctuations of CA,B(t) (cf. [38, The-\norem 2.7 and Corollary 2.12]) by showing an approximate Wick theorem for resolvent chains,\nsimilarly to [38, Theorem 3.6]. However, we refrain from doing this for brevity of the current\npaper.\n2.1. Physical interpretation of Theorem 2.2 by two examples. We will now discuss the behavior\nof CA,B(t) in two exemplary and extreme situations of observables A, B. In the first example we will set\nthe two observables identical, in the second we will assume that their product vanishes. More concretely,\nwe define\nA = N\n1−a\n2 diag(1, −1, ..., 1, −1, 0, ..., 0) ,\na ∈ [0, 1) ,\nB = N\n1−b\n2 diag(0, ..., 0, 1, −1, ..., 1, −1) ,\nb ∈ [0, 1) ,\n(2.8)\nin such a way that AB = BA = 0, and ⟨A⟩ = ⟨B⟩ = 0 as well as ⟨A2⟩ = ⟨B2⟩ = 1, i.e. A (resp. B)\ncontains N a-many (resp. N b-many) non-zero entries on the diagonal.\n8We remark that some papers (see, e.g., [37]) refer to the four-point part FA,B(t) alone as the OTOC.\nOUT-OF-TIME-ORDERED CORRELATORS FOR WIGNER MATRICES\n7\nExample 1. For the first example, we have\nCA,A(t) = ⟨A2⟩2\u0002\n1 − φ(t)2\b\n1 − 2φ(2t) + 2φ(t)2}\n\u0003\n+ ⟨A4⟩\n\u0002\nφ(t)2 − φ(t)4\u0003\n+ O≺\n\u0000EA,A(t, N)\n\u0001\n.\n(2.9)\nExample 2. For the second example, we have\nCA,B(t) = ⟨A2⟩⟨B2⟩\n\u0002\n1 − φ(t)2\u0003\n+ O≺\n\u0000EA,B(t, N)\n\u0001\n.\n(2.10)\nThe key features of these two examples (2.9)–(2.10) are briefly summarized in Table 1. Ignoring the\nrespective error terms, CA,A(t) and CA,B(t) are schematically depicted in Figure 1. Now we comment on\neach time regime.\n(i) [Short-time regime] By the asymptotics in (2.5), we have the short-time asymptotic\nCA,A(t) = t2 \u0000⟨A4⟩ − ⟨A2⟩2\u0001\n+ O\n\u0000|t|4⟨A4⟩\n\u0001\n+ O≺\n\u0000E\n\u0001\n(Example 1) ,\nCA,B(t) = t2 ⟨A2⟩⟨B2⟩ + O\n\u0000|t|4⟨A2⟩⟨B2⟩\n\u0001\n+ O≺\n\u0000E\n\u0001\n(Example 2) .\nThis shows, that the OTOC for Wigner matrices does not exhibit the exponential increase ∼ e2λt,\nobserved for quantum systems with a classically chaotic analogue, where λ is the Lyapunov\nexponent of the classical system. Instead, the OTOC (2.2) behaves polynomially, as expected for\nquantum chaotic systems without a classical analogue (e.g. for certain spin− 1\n2 chains [26]).\n(ii) [Scrambling time] The monotonous growth of both CA,A(t) and CA,B(t) stops at a time of order\none (using elementary properties of φ from (2.4)), hence the scrambling time is t∗ ∼ 1. However,\nthe maximally attained value strongly differs for the two examples: While CA,A(t∗) ∼ N 1−a\nheavily depends on a (i.e. the rank of A), the peak of CA,B(t∗) ∼ 1 is independent of the ranks\nof A and B.\n(iii) [Intermediate regime up to the relaxation time] The following interval of intermediate times\nis characterized by a decay of the OTOC (2.6) towards its thermal limiting value ⟨A2⟩⟨B2⟩ = 1\nup to the relaxation time t∗∗. This regime is also quite different for the two examples (2.9)–\n(2.10): While for Example 1 the interval of intermediate times is given by t ∈ [t∗, t∗∗] where\nt∗∗ ∼ N (1−a)/3, in Example 2 the relaxation time t∗∗ ∼ 1 is comparable with the scrambling\ntime. However, for technical reasons, the entire interval of intermediate times is only accessible\nif a > 5/11 for Example 1, and a + b > 2/3 for Example 2, otherwise the leading terms in (2.9)–\n(2.10) become smaller than their respective error term. In comparison, computing the OTOC\nwith the operator norm in the error terms [10, Corollary 2.7], would lead to the (more restrictive)\nconditions a > 5/8 for Example 1, and a + b > 1 for Example 2.\n(iv) [Long-time regime] In the consecutive long-time regime, i.e. t ≫ N (1−a)/3 for Example 1 and\nt ≫ 1 for Example 2, we find the OTOC (2.6) to concentrate around its thermal limiting value\n⟨A2⟩⟨B2⟩ = 1 with small oscillations. This confirms the expectation, that the OTOC in strongly\nchaotic systems exhibits only small fluctuations for long times. These are accessible up to\nt ≤ N min{ 1\n4 , 3a−1\n2 }−ϵ\nand\nt ≤ N min{ 1\n4 , 3a+1\n10\n, 3b+1\n10 , 3(a+b)−2\n4\n}−ϵ\nfor Example 1 and 2, respectively. Again, in comparison with Theorem 2.2, the operator norm\nerror terms from [10, Cor. 2.7] would lead to the constraints t ≤ N\n2a−1\n2\n−ϵ for Example 1, and\nt ≤ N\na+b−1\n2\n−ϵ for Example 2.\nEx. 1 (2.9): A = B, rk A = N a\nEx. 2 (2.10): AB = 0, rk A = N a, rk B = N b\nshort times\nCA,A(t) ∼ t2 \u0000⟨A4⟩ − ⟨A2⟩2\u0001\nCA,B(t) ∼ t2 ⟨A2⟩⟨B2⟩\nscrambling time\nt∗ ∼ 1 and CA,A(t∗) ∼ N 1−a\nt∗ ∼ 1 and CA,B(t∗) ∼ 1\nintermediate times\nfull access if a > 5/11\nfull access if a + b > 2/3\nrelaxation time\nt∗∗ ∼ N\n1−a\n3\nand CA,A(t∗∗) ∼ ⟨A2⟩2\nt∗∗ ∼ 1 and CA,B(t∗∗) ∼ ⟨A2⟩⟨B2⟩\nlong times\nup to t ≤ N min{ 1\n4 , 3a−1\n2 }−ϵ\nup to t ≤ N min{ 1\n4 , 3a+1\n10\n, 3b+1\n10 , 3(a+b)−2\n4\n}−ϵ\nTable 1. Overview of the two examples (2.9) and (2.10).\n8\nCIPOLLONI, ERD ˝OS, AND HENHEIK\n2.2. Finite temperature case. Theorem 2.2 can easily be extended to the case of finite temperature,\nβ = 1/T > 0. The OTOC (2.2) now is given by\nC(β)\nA,B(t) := 1\n2\nTr\n\u0002\n|[A(t), B]|2e−βW \u0003\nZ\n(2.11)\nwith partition function Z = Tr\n\u0002\ne−βW \u0003\n. In this case, the analog of (2.6) in the regime9 β ≪ log N reads\nC(β)\nA,B(t) =⟨A2⟩⟨B2⟩\n\u0002\n1 − φ(t)2\u0003\n+ ⟨AB⟩2 φ(t)\nφ(iβ) Re\n\u0014\nφ(2t)φ(t + iβ) + φ(t)φ(2t + iβ) − 2φ(t)2φ(t + iβ)\n\u0015\n+ ⟨A2B2⟩ φ(t)2 − ⟨ABAB⟩φ(t)3Re [φ(t + iβ)]\nφ(iβ)\n+ O≺ (EA,B(t, N)) ,\n(2.12)\nwhere E is from (2.7). Here φ(z) is the complex extension of φ(t) for z ∈ C; note that φ(z) is generically\ncomplex but φ(iβ) is real.\nFigure 2. Depicted are four curves illustrating the influence of β = 1/T on the OTOC\nC(β)\nA,A(t) up to intermediate times for Example 1 from Section 2.1 (i.e. normalized to\n⟨A2⟩ = 1 with rank A = N\n1−a\n2\nand a ∈ [0, 1]). As β increases, the characteristic rank-\ndependent peak of size ∼ N 1−a around the scrambling time t∗ ∼ 1 becomes more pro-\nnounced and very slightly shifted to the left.\nMoreover, using the asymptotics of the Bessel function in the complex plane, we have\nφ(z) = −\nr\n1\nπz3\n\u0010\ncos\n\u0010\n2z + π\n4\n\u0011\n+ e2|Im z|O\n\u0000|z|−1\u0001\u0011\nfor\n|z| → ∞\nwith\n| arg z| < π .\nIn particular, the thermal limiting value of C(β)\nA,B(t) is independent of β at least in our regime β ≪ log N.\nNote that for much larger β ≳\n√\nN physics calculations predict a temperature dependence of the thermal\nlimiting value of the OTOC , see [36, Eqs. (3.8)–(3.9)].\nHowever, before the long-time regime and neglecting the error term in (2.12), we find a strong de-\npendence of the OTOC on temperature for Example 1 from Section 2.1 (cf. (2.8)–(2.9)) as illustrated in\nFigure 2. In contrast to that, for Example 2 from Section 2.1 (cf. (2.8) and (2.10)), the whole OTOC\ncurve (as depicted in Figure 1) is independent of temperature at any time. This is because all the β\ndependent terms in (2.12) drop out since AB = BA = 0.\n9We restrict to this regime for simplicity, as all the error terms can be absorbed into ≺.\nOUT-OF-TIME-ORDERED CORRELATORS FOR WIGNER MATRICES\n9\n3. Proof of Theorem 2.2: Multi-resolvent local law with Schatten norms\nTheorem 2.2 relies on a new multi-resolvent local law for alternating chains (1.3) with deterministic\nmatrices via simple contour integration (see Section 3.3). Its main novelty, using Schatten norms for\nthe observables and still keeping optimality in N and η, has already been explained in the Introduction.\nAfter collecting some preliminary information, in Section 3.2 we present our new local law, Theorem 3.3,\nthen in Section 3.3 we quickly complete the proof of Theorem 2.2. Starting from Section 4 we will focus\non the proof of Theorem 3.3.\n3.1. Preliminaries on the deterministic approximation. Before stating our main technical result,\nwe introduce some additional notation. Given a non-crossing partition π of the set [k] := { 1, . . . , k }\narranged in cyclic order, the partial trace pTrπ is defined as\npTrπ(B1, . . . , Bk−1) :=\nY\nS∈π\\B(k)\n*Y\nj∈S\nBj\n+\nY\nj∈B(k)\\{ k }\nBj,\n(3.1)\nwith B(k) ∈ π denoting the unique block containing k. Then, for generic Bi’s, the deterministic approx-\nimation of (1.3) is given by (see [8, Theorem 3.4])\nM[1,k] = M(z1, B1, . . . , Bk−1, zk) :=\nX\nπ∈NC([k])\npTrK(π)(B1, . . . , Bk−1)\nY\nS∈π\nm◦[S],\n(3.2)\nwhere NC([k]) denotes the non-crossing partitions of the set [k], and K(π) denotes the Kreweras comple-\nment of π (see [8, Definition 2.4] and [32]). Furthermore, for any subset S ⊂ [k] we define m[S] := msc[zS]\nas the iterated divided difference of msc evaluated in zS := {zi : i ∈ S}, and by m◦[·] denote the free-\ncumulant transform of m[·] which is uniquely defined implicitly by the relation\nm[S] =\nX\nπ∈NC(S)\nY\nS′∈π\nm◦[S′],\n∀S ⊂ [k],\n(3.3)\ne.g. m◦[i, j] = m[{ i, j }] − m[{ i }]m[{ j }]. Throughout the paper, we will often use the fact that msc[zS]\ncan be written as follows\nmsc[{ zi : i ∈ S }] =\nZ 2\n−2\nρsc(x)\nY\ni∈S\n1\n(x − zi)dx.\n(3.4)\nIn order to formulate bounds on the deterministic approximation M as well as the local law bounds\nin a concise way, we introduce the following weighted Schatten norms.\nDefinition 3.1 (ℓ-weighted Schatten norms). For B ∈ CN×N, ℓ > 0 and p ∈ [2, ∞], we define the\nℓ-weighted (2, p)-Schatten norm as\n|||B|||p,ℓ := ⟨|B|2⟩1/2\nℓ1/2\n+ ⟨|B|p⟩1/p\nℓ1/p\nfor\np < ∞\nand\n|||B|||∞,ℓ := ⟨|B|2⟩1/2\nℓ1/2\n+ ∥B∥ .\n(3.5)\nBy elementary inequalities, we have\n|||B|||p,ℓ ≲ |||B|||q,ℓ\nand\n|||B|||q,ℓ ≲\nh\n1 + (Nℓ)\nq−p\npq\ni\n|||B|||p,ℓ ,\n2 ≤ p ≤ q ≤ ∞.\n(3.6)\nThe next lemma gives a bound on the deterministic approximation M[1,k] with traceless observables;\nits proof is given in Appendix A. We will henceforth follow the convention that the letter B is used for\ngeneric matrices, while A is reserved for traceless ones.\nLemma 3.2 (M-bound). Fix k ≥ 1.\nConsider spectral parameters z1, ..., zk ∈ C \\ R and traceless\nmatrices A1, ..., Ak ∈ CN×N. Denoting ℓ := minj∈[k] ηjρj with ηj := |Im zj| and ρj := π−1|Im m(zj)|, it\nholds that10\n\f\f⟨M[1,k](z1, A1, ..., zk)Ak⟩\n\f\f ≲ 1(k ≥ 2) ℓ\nY\ni∈[k]\n|||Ai|||k,ℓ ,\n(3.7)\nwhere |||Ai|||k,ℓ was defined in (3.5).\nIt is easy to see that the bound (3.7) is optimal for k even (cf. Footnote 10) and in case that Ai = A\nfor all i ∈ [k] and zi ∈ {z, ¯z} for some z ∈ C \\ R in the bulk, i.e. Re z ∈ [−2 + δ, 2 − δ] for some δ > 0.\n10We point out that the bound can be improved to ℓ Q\ni∈[k]\n\u0000ℓ(1−k)/(2k)⟨|Ai|3⟩1/k⟨|Ai|2⟩(k−3)/(2k) + ℓ−1/k⟨|Ai|k⟩1/k\u0001\nin case of odd k ≥ 3, but we do not follow this improvement for brevity and ease of notation.\n10\nCIPOLLONI, ERD ˝OS, AND HENHEIK\n3.2. Multi-resolvent local law. We now formulate our main technical result, an averaged multi-\nresolvent local law with Schatten norms, in Theorem 3.3; its proof is given in Section 4. The corresponding\nisotropic multi-resolvent local law will be formulated in Theorem 6.2 later.\nTheorem 3.3 (Averaged multi-resolvent local law with Schatten norms). Let W be a Wigner matrix\nsatisfying Assumption 2.1, and fix k ∈ N. Consider spectral parameters z1, ..., zk ∈ C \\ R, the associated\nresolvents Gj = G(zj) := (W − zj)−1, and traceless deterministic matrices A1, ..., Ak ∈ CN×N. Denote\nηj := |Im zj| ,\nρj := π−1|Im m(zj)| ,\nℓ := min\nj∈[k] ηjρj,\nand let M[1,k] be given in (3.2). Then, for any fixed ϵ > 0 and recalling (3.5), we have\n\f\f⟨G1A1...GkAk⟩ − ⟨M[1,k]Ak⟩\n\f\f ≺ 1\nN\nY\ni∈[k]\n|||Ai|||2k,ℓ ,\n(3.8)\nuniformly in spectral parameters satisfying Nℓ ≥ N ϵ and maxj |zj| ≤ N 1/ϵ.\nNotice that, in the bulk regime, ℓ essentially agrees with η := mini∈[k] |Im zi|, since ρi ∼ 1. However,\nfor (3.8) to be valid in any regime, the standard condition Nη ≫ 1 for the local law in the bulk needs to\nbe replaced by Nℓ ≫ 1. This ensures that we are at the mesoscopic scale, i.e. there are many eigenvalues\nin a local window of size ηi around each Re zi.\nAs already mentioned in the Introduction around (1.6), Theorem 3.3 unifies and improves the previ-\nous local laws (in the bulk spectrum) with an error term involving either the operator norm (see [10,\nEq. (2.11a) in Theorem 2.5]) or Hilbert-Schmidt norm (see [11, Theorem 2.2]). This follows by estimating\n(in the relevant ℓ ≲ 1 regime)\n|||Ai|||2k,ℓ ≲\n\n\n\n\n\n\n\n∥Ai∥\nℓ1/2\nfor [10, Eq. (2.11a) in Theorem 2.5]\n(Nℓ)\nk−1\n2k ⟨|Ai|2⟩1/2\nℓ1/2\nfor [11, Theorem 2.2]\n(3.9)\nin (3.8) for Nℓ > 1 and every i ∈ [k] by means of elementary inequalities.\nRemark 3.4 (Optimality). The bound (3.8) is optimal in case that Ai = A for all i ∈ [k] and zi ∈ {z, ¯z}\nfor some z ∈ C \\ R with |Im z| ≥ N −1+ϵ in the bulk. For W being GUE, this can easily be checked\nby spectral decomposition of the resolvents and using Weingarten calculus [16] for the Haar-distributed\neigenvectors. The so-called “ladder diagram” gives the (first) Hilbert-Schmidt term in the estimate\n\f\f⟨(GA)k⟩ − ⟨M[1,k]A⟩\n\f\f ≺\n|||A|||k\n2k,ℓ\nN\n∼ ⟨|A|2⟩k/2\nNℓk/2\n+ ⟨|A|2k⟩1/2\nNℓ1/2\n.\n(3.10)\nInterestingly, in some regimes the second term in (3.10) (non ladder diagram) gives the main contribution,\ndefying the general belief that always the ladder diagrams are the leading terms.\nRemark 3.5 (Extensions). In Theorem 3.3, each G may also be replaced by a product of G’s or even\n|G|’s (absolute value). We refrain from stating these results explicitly, as they can be easily obtained\nfrom appropriate integral representations (see (5.24) and (5.28) below). We formulate only the following\nexample for k = 2 and identical observables B1 = B2 for illustration. Let B ∈ CN×N be an arbitrary\n(i.e. not necessarily traceless) deterministic matrix. Then, decomposing B = ˚\nB + ⟨B⟩, we have\n⟨G1BG2B⟩ = ⟨B⟩2⟨G1G2⟩ + ⟨B⟩⟨G1G2 ˚\nB⟩ + ⟨B⟩⟨G2G1 ˚\nB⟩ + ⟨G1 ˚\nB1G2 ˚\nB2⟩\n= m1m2⟨B⟩2\n1 − m1m2\n+ m1m2⟨˚\nB2⟩ + O≺\n \n|⟨B⟩|2\nNℓ2 + |⟨B⟩|⟨|˚\nB|2⟩1/2\nNℓ3/2\n+ ⟨|˚\nB|2⟩\nNℓ\n+ ⟨|˚\nB|4⟩1/2\nNℓ1/2\n!\n.\n(3.11)\nThe statement for different observables B1, B2 is analogous.\n3.3. Out-of-time-ordered correlators: Proof of Theorem 2.2. In order to prove Theorem 2.2, we\ndistinguish the following three time regimes,\n(i) |t| < 1 ,\n(ii) 1 ≤ |t| ≤ N (1−ϵ)/2 ,\nand\n(iii) |t| > N (1−ϵ)/2\n(3.12)\nfor some small fixed ϵ > 0 from Theorem 2.2. In the following, we focus on the most complicated case\n(ii) and discuss the other two cases briefly at the end of this section. Since the arguments in this section\nare fairly standard, we will leave some irrelevant technical details to the reader.\nOUT-OF-TIME-ORDERED CORRELATORS FOR WIGNER MATRICES\n11\nFor 1 ≤ |t| ≤ N (1−ϵ)/2, we employ the integral representation\ne±itW =\n1\n2πi\nI\nΓ\ne±itzG(z)dz\n(3.13)\nwith the contour\nΓ ≡ Γt,R := ∂\n\u0000[−R, R] × i[−|t|−1, |t|−1]\n\u0001\n(3.14)\nparametrized counterclockwise and the parameter R chosen as R = N κ for some arbitrarily small (but\nfixed) κ > 0. In this way, we can write the four-point part FA,B(t) in (2.3) of the OTOC (2.2) as\nFA,B(t) =\n\n Y\ni∈[4]\nI\nΓ\ndzi\n2πi\n\n eit(z1+z3−z2−z4)⟨G(z1)AG(z2)BG(z3)AG(z4)B⟩ .\n(3.15)\nFor the part, where all zi’s, i ∈ [4], run on the horizontal parts of the contour Γ, we can replace\n⟨G(z1)A...G(z4)B⟩ by ⟨M(z1, A, ..., z4)B⟩ at the price of an error O≺(E) with E = EA,B(t) from (2.7) by\nmeans of Theorem 3.3 for k = 4. Here, we used ℓ ≳ N −2κ|t|−2, which follows by ρ(zi) ≳ |Im zi|(1 +\ndist(zi, [−2, 2])2)−1, and that κ > 0 is arbitrarily small and hence N κ can be absorbed into ≺.\nIf all the zi’s run on the vertical parts of Γ, we employ the global law version of our main result,\nProposition 4.1 below, to replace ⟨G(z1)A...G(z4)B⟩ by ⟨M(z1, A, ..., z4)B⟩, now at the price of an error\nO≺\n\u0000⟨A8⟩1/4⟨B8⟩1/4/N\n\u0001\n, which can easily be included in O≺(E). We point out that Theorem 3.3 cannot\nbe used in this regime, since ℓ = 0 when one of the zi’s crosses the real axis.\nIn the remaining cases, where some of the zi’s run on the horizontal parts and others run on the vertical\nparts, we can no longer cleanly apply either the local or global law (Theorem 3.3 and Proposition 4.1,\nrespectively). Instead, we treat this situation by expanding around the case where all zi are on the\nhorizontal parts. More precisely, in case that, say, z1 runs on the right vertical part of the contour Γ\nand z2, ...., z4 are fixed on the horizontal parts, we employ analyticity of G(z1) away from [−3, 3] (since\n∥W∥ ≤ 2 + ϵ with very high probability).\nThis enables us to write g(z1) := ⟨G(z1)A...G(z4)B⟩ at\nz1 = R + iq with q ∈ [−|t|−1, |t|−1], by Taylor expansion around ζ := R + i|t|−1, as\ng(R + iq) =\nK\nX\nj=0\n(q − |t|−1)j\n2πi\nI\nC1/(2|t|)\ng(w)\n(w − ζ)j+1 dw + O\n\u0000eE\n\u0001\n,\neE := ⟨A4⟩1/2⟨B4⟩1/2\nRK+1|t|K−2\n(3.16)\nfor any K ∈ N to be chosen below, where C1/(2|t|) is the circle of radius 1/(2|t|) centered around ζ. In\n(3.16), we used that the (K + 1)th derivative of g(z1) on the vertical part of the contour is (determinis-\ntically) bounded as\n\f\fg(K+1)(z1)\n\f\f ≲\n\f\f\n\u0000G(z1)\n\u0001K+1AG(z2)BG(z3)AG(z4)B\n\u000b\f\f ≲ ⟨A4⟩1/2⟨B4⟩1/2|t|3\nRK+1\n,\nsince ∥G(zi)∥ ≤ |t| for i ∈ {2, 3, 4}.\nUsing the representation (3.16), we can now replace g(w) by\nh(w) := ⟨M(w, A, ..., z4)B⟩, again at the expense of an error O≺(E) by means of Theorem 3.3. As one\ncan easily see that h is also analytic around R + iq and satisfies the same relation as g in (3.16), we find\nthat |g(R + iq) − h(R + iq)| ≺ E + eE. Hence, in order to absorb eE into E, it remains to choose K in (3.16)\nas K := ⌈κ−1⌉.\nTherefore, since integrating the O≺(E)-bound in (3.15) only adds some N κ-factors from the length of\nΓ (note that |eit(z1+z3−z2−z4)| ≲ 1), which can easily be absorbed into ≺, we find that\nFA,B(t) =\n\n Y\ni∈[4]\nI\nΓ\ndzi\n2πi\n\n eit(z1+z3−z2−z4)⟨M(z1, A, z2, B, z3, A, z4)B⟩ + O≺\n\u0000E\n\u0001\n.\n(3.17)\nSimilarly, decomposing A2 = (A2 − ⟨A2⟩) + ⟨A2⟩ and analogously for B, the two-point part DA,B(t)\nfrom (2.3) is given by, again for times 1 ≤ |t| ≤ N (1−ϵ)/2,\nDA,B(t) = ⟨A2⟩⟨B2⟩ +\n\n Y\ni∈[2]\nI\nΓ\ndzi\n2πi\n\n eit(z1−z2)⟨M(z1, (A2 − ⟨A2⟩), z2)(B2 − ⟨B2⟩)⟩ + O≺(E) .\n(3.18)\n12\nCIPOLLONI, ERD ˝OS, AND HENHEIK\nIn the other two regimes, |t| < 1 and |t| > N (1−ϵ)/2, we follow the above arguments for 1 ≤ |t| ≤ N 1/2−ϵ,\nbut replace the contour Γ from (3.14) by11\n{z ∈ C : dist(z, [−2, 2]) = |t|−1}\nand\n∂\n\u0000[−R, R] × i[−N (1−ϵ)/2, N (1−ϵ)/2]\n\u0001\n,\nrespectively. This results in error terms in identities analogous to (3.17)–(3.18), that can easily be seen\nto be bounded by O≺(E), just as before, by application of Proposition 4.1 and Theorem 3.3, respectively.\nIt remains to explicitly compute the deterministic terms in (3.17)–(3.18), which, by using the formu-\nlas (3.1)–(3.4), straightforwardly results in the expression given in (2.6). This concludes the proof of\nTheorem 2.2.\n□\n4. Zigzag strategy: Proof of Theorem 3.3\nIn this section we prove our main technical result from Section 3, the multi-resolvent local law in\nTheorem 3.3. Its proof is conducted via the characteristic flow method [2, 6, 29, 1, 33, 3] followed by a\nGreen function comparison (GFT) argument. A combination of these tools, which we coin the Zigzag\nstrategy, has first been used in [12, 14, 15]. It consists of the following three steps:\n1. Global law. Proof of a multi-resolvent global law, i.e. for spectral parameters “far away” from\nthe spectrum, minj dist(zj, [−2, 2]) ≥ δ for some small δ > 0 (see Proposition 4.1 below).\n2. Characteristic flow. Propagate the global law to a local law by considering the evolution of\nthe Wigner matrix W along the Ornstein-Uhlenbeck flow\ndWt = −1\n2Wtdt + dBt\n√\nN\n,\nW0 = W ,\n(4.1)\nwith Bt a standard real symmetric or complex Hermitian Brownian motion, thereby introducing\nan order one Gaussian component (see Proposition 4.3). The spectral parameters of the resolvents\nevolve from the global regime to the local regime according to the characteristic (semicircular)\nflow\n∂tzi,t = −m(zi,t) − zi,t\n2 .\n(4.2)\nThe simultaneous effect of these two evolutions is a key cancellation of two large terms.\n3. Green function comparison. Remove the Gaussian component by a Green function compari-\nson (GFT) argument (see Proposition 4.4).\nAs the first step, we have the following global law, the proof of which is completely analogous to\nthe proofs presented in [10, Appendix B], [11, Appendix A], and [14, Appendix A], and so omitted.\nProposition 4.1 is stated for a general deterministic matrix B since the traceless condition plays no role\nin this case.\nProposition 4.1 (Step 1: Global law). Let W be a Wigner matrix satisfying Assumption 2.1, and fix\nk ∈ N and δ > 0. Consider spectral parameters z1, ..., zk ∈ C \\ R, the associated resolvents Gj = G(zj) :=\n(W − zj)−1, and deterministic matrices B1, ..., Bk ∈ CN×N. Then, uniformly in spectral parameters\nsatisfying d := minj∈[k] dist(zj, [−2, 2]) ≥ δ and deterministic matrices B1, ..., Bk, it holds that\n\f\f⟨G1B1...GkBk⟩ − ⟨M[1,k]Bk⟩\n\f\f ≺ 1\nN\nY\ni∈[k]\n|||Bi|||2k,d .\n(4.3)\nNext, using Proposition 4.1 as an input, we derive Theorem 3.3 for Wigner matrices which have an\norder one Gaussian component, as formulated in Proposition 4.3.\nFor this purpose we consider the\nevolution of the Wigner matrix W along the Ornstein-Uhlenbeck flow (4.1) and define its resolvent\nGt(z) := (Wt − z)−1 with zi ∈ C \\ R. Even if not stated explicitly we will always consider this flow only\nfor short times, i.e. for 0 ≤ t ≤ T, where the maximal time T is smaller than some γ > 0. Note that the\nfirst two moments of Wt are preserved along the flow (4.1), and hence the self-consistent density of states\nof Wt is unchanged; it remains the standard semicircle law. We now want to compute the deterministic\napproximation to an alternating product of resolvents and deterministic matrices A1, A2, ... with trace\nzero\nGt(z1)A1Gt(z2)A2Gt(z3)A3 . . . ,\n(4.4)\nand have a very precise estimate of the error term.\n11We choose the first contour only for t ̸= 0. If t = 0, the lhs. of (2.6) carries no randomness, and we find CA,B(0) =\n⟨A2B2⟩ − ⟨ABAB⟩.\nOUT-OF-TIME-ORDERED CORRELATORS FOR WIGNER MATRICES\n13\nIn fact, we will let the spectral parameters evolve with time with a carefully chosen equation that will\nconveniently cancel some error terms in the time evolution of (4.4). The corresponding equation will\nbe the characteristic equation for the semicircular flow, i.e. given by the first order ODE (4.2) (see [14,\nFigure 1] for an illustration of this flow). We remark that, along the characteristics we have\n∂tm(zi,t) = −∂zm(zi,t)\n\u0010\nm(zi,t) + zi,t\n2\n\u0011\n= −∂zm(zi,t)\n\u0012\n−\n1\n2m(zi,t) + m(zi,t)\n2\n\u0013\n= m(zi,t)\n2\n,\n(4.5)\nwhere in the last two equalities we used the defining equation m(z)2 + zm(z) + 1 = 0 of the Stieltjes\ntransform of the semicircular law. In particular, this implies that ρi,s ∼ ρi,t for any 0 ≤ s ≤ t, where we\ndenoted ρi,t := π−1|Im m(zi,t)|. In contrast to that, the behavior of the ηi,t := |Im zi,t| depends on the\nregime: in the bulk ηi,t decreases linearly in time with a speed of order one, at the edge the decay is still\nlinear but with a speed depending on the size of the local density of states. By standard ODE theory we\nobtain the following lemma:\nLemma 4.2 (see Lemma 3.2 in [14]). Fix an N–independent γ > 0, fix 0 < T < γ, and pick z ∈ C \\ R.\nThen there exists an initial condition z0 such that the solution zt of (4.2) with this initial condition z0\nsatisfies zT = z. Furthermore, there exists a constant C > 0 such that dist(z0, [−2, 2]) ≥ CT.\nThe spectral parameters evolving by (4.1) will have the property that\nGt(z1,t)A1 . . . Ak−1Gt(zk,t) − M[1,k],t ≈ G0(z1,0)A1 . . . Ak−1G0(zk,0) − M[1,k],0,\n(4.6)\nwith M[1,k],t := M(z1,t, A1, . . . , Ak−1, zk,t), for any 0 ≤ t ≤ T. Note that the deterministic approximation\nM[1,k],t depends on time only through the time dependence of the spectral parameters, the deterministic\napproximation of (4.4) with fixed spectral parameters does not depend on time, i.e. it is unchanged along\nthe whole flow (4.1).\nProposition 4.3 (Step 2: Characteristic flow). Fix any ϵ, γ > 0, a time 0 ≤ T ≤ γ, and K ∈ N.\nConsider z1,0, . . . , zK,0 ∈ C \\ R as initial conditions to the solution zj,t of (4.2) for 0 ≤ t ≤ T and define\nGj,t := Gt(zj,t) as well as ηj,t := |Im zj,t| and ρj,t := π−1|Im m(zj,t)|.\nLet k ≤ K, define ℓt := minj∈[k] ηj,tρj,t and recall (3.5). Then, assuming that\n\f\f⟨G1,0A1...Gk,0Ak⟩ − ⟨M[1,k],0Ak⟩\n\f\f ≺ 1\nN\nY\ni∈[k]\n|||Ai|||2k,ℓ0 ,\n(4.7)\nholds uniformly for any k ≤ K, any choice of deterministic traceless A1, ..., Ak and any choice of zi,0’s\nsuch that Nℓ0 ≥ N ϵ and maxj∈[k] |zj,0| ≤ N 1/ϵ, then we have\n\f\f⟨G1,T A1...Gk,T Ak⟩ − ⟨M[1,k],T Ak⟩\n\f\f ≺ 1\nN\nY\ni∈[k]\n|||Ai|||2k,ℓT\n(4.8)\nfor any k ≤ K, again uniformly in traceless matrices Ai and in spectral parameters satisfying NℓT ≥ N ϵ\nand maxj∈[k] |zj,T | ≤ N 1/ϵ.\nThe proof of Proposition 4.3 is given in Section 5. As the third and final step, we show that the\nadditional Gaussian component introduced in Proposition 4.3 can be removed using a Green function\ncomparison (GFT) argument at the price of a negligible error. The proof of this proposition is presented\nin Section 6.\nProposition 4.4 (Step 3: Green function comparison). Let H(v) and H(w) be two N × N Wigner\nmatrices with matrix elements given by the random variables vab and wab, respectively, both satisfying\nAssumption 2.1 and having matching moments up to third order,12 i.e.\nE¯vu\nabvs−u\nab\n= E ¯wu\nabws−u\nab\n,\ns ∈ {0, 1, 2, 3} ,\nu ∈ {0, ..., s} .\n(4.9)\nFix K ∈ N and consider spectral parameters z1, ..., zK ∈ C\\R satisfying minj Nηjρj ≥ N ϵ and maxj |zj| ≤\nN 1/ϵ for some ϵ > 0 and the associated resolvents G(#)\nj\n= G(#)(zj) := (H(#) − zj)−1 with # = v, w.\nPick traceless matrices A1, ..., AK ∈ CN×N.\nAssume that, for H(v), we have the following bounds (writing Gj ≡ G(#)\nj\nfor brevity): For any k ≤ K,\nconsider any subset of cardinality k of the K spectral parameters, and similarly, consider any subset of\n12This condition can easily be relaxed to being matching up to an error of size N−2 as done, e.g., in [21, Theorem 16.1].\n14\nCIPOLLONI, ERD ˝OS, AND HENHEIK\ncardinality k of the deterministic matrices. Relabeling both of them by [k], setting ℓ := minj∈[k] ηjρj and\nrecalling (3.5), we have that\n\f\f⟨G1A1...GkAk⟩ − ⟨M[1,k]Ak⟩\n\f\f ≺ 1\nN\nY\ni∈[k]\n|||Ai|||2k,ℓ\n(4.10)\nuniformly in all choices of subsets of z’s and A’s.\nThen, (4.10) also holds for the ensemble H(w), uniformly all choices of subsets of z’s and A’s.\nWe are now ready to finally conclude the proof of Theorem 3.3. Fix T > 0, and fix z1, . . . , zk ∈ C \\ R\nsuch that mini Nηiρi ≥ N ϵ, and let zi,0 be the initial conditions of the characteristics (4.2) chosen so\nthat zi,T = zi (this is possible thanks to Lemma 4.2). Then, the assumption (4.7) of Proposition 4.3 is\nsatisfied for those zi,0 by Proposition 4.1 with δ = CT, since d ≳ ℓ0 and where C > 0 is the constant from\nLemma 4.2. We can thus use Proposition 4.3 to show that (4.8) holds. Finally, the Gaussian component\nadded in Proposition 4.3 is removed using Proposition 4.4 with the aid of a complex version (see [14,\nLemma A.2]) of the standard moment-matching lemma [21, Lemma 16.2].\n□\n5. Characteristic flow: Proof of Proposition 4.3\nIn this section, we give the proof of Proposition 4.3. The argument is divided into three parts.\n(i) We begin by introducing several deterministic and stochastic control quantities, which play a\nfundamental role throughout the rest of this paper.\nThe stochastic control quantities (some\nnormalized differences between a resolvent chain and the corresponding M-term, see (5.12)–(5.13)\nbelow) satisfy a system of master inequalities (see Propositions 5.2–5.3).\n(ii) Taking these master inequalities together with Proposition 4.1 as inputs, we will prove Proposi-\ntion 4.3 in Section 5.1, thus concluding Step 2 of the argument in Section 4.\n(iii) Afterwards, based on Proposition 4.1 and several relations among the deterministic control quan-\ntities (see Lemma 5.1), we will prove the master inequalities in Section 5.2.\nTo keep the presentation simpler, within this section we assume that Eχ2\nod = 0 and that Eχ2\nd = 1, i.e.\nwe consider only complex Wigner matrices. The modifications for the general case are analogous to [14,\nSection 4], and so omitted.\nWe recall our choice of the characteristics\n∂tzi,t = −m(zi,t) − zi,t\n2 ,\n(5.1)\nnote that t 7→ ηi,t is decreasing and that ρi,t ∼ ρi,s for any 0 ≤ s ≤ t (see (4.5) and the paragraph below\nit for more details). Additionally, we record the following, trivially checkable, simple integration rule\nwhich will be used many times in this section:\nZ t\n0\n1\nηαs\nds ≲ log N\nηα−2\nt\nℓt\nwith\nηs := min\ni\nηi,s ,\nℓs := min\ni\nηi,sρi,s .\n(5.2)\nAlong the characteristics, using the short–hand notation Gi,t = (Wt − zi,t)−1, with Wt being the\nsolution of (4.1), by Itˆo’s formula, we have13\nd⟨(G[1,k],t − M[1,k],t)A⟩ =\n1\n√\nN\nN\nX\na,b=1\n∂ab⟨G[1,k],tA⟩dBab,t + k\n2⟨G[1,k],tA⟩dt +\nk\nX\ni,j=1\ni<j\n⟨G[i,j],t⟩⟨G[j,i],t⟩dt\n+\nk\nX\ni=1\n⟨Gi,t − mi,t⟩⟨G(i)\n[1,k],tA⟩dt − ∂t⟨M[1,k],tA⟩dt,\n(5.3)\nwhere ∂ab denotes the directional derivative ∂wab. We also set\nG[i,j],t :=\n\n\n\n\n\nGi,tAi . . . Aj−1Gj,t\nif\ni < j\nGi,t\nif\ni = j\nGi,tAi,t . . . Gk,tAkG1,tA1 . . . Aj−1Gj,t\nif\ni > j,\n(5.4)\n13We point out that (5.3) holds for any matrix Ai ∈ CN×N, i.e. we did not use that the Ai’s are traceless.\nOUT-OF-TIME-ORDERED CORRELATORS FOR WIGNER MATRICES\n15\nand defined G(l)\n[i,j],t as G[i,j],t but with the l–th resolvent substituted by G2\nl,t. The last definition for i > j\nreflects the cyclicity of the trace, since G[i,j],t will be needed in a tracial situation. For any i, j ∈ [k], we\ndenote the deterministic approximation of G[i,j],t by M[i,j],t, with M[i,j],t being defined as in (3.2) with\n[1, k] replaced by [i, j] if i < j and by [1, j] ∪ [i, k] if i > j.\nDeterministic control quantities: mean and standard deviation size. We now introduce two\ndeterministic control quantities that measure the size of the mean of long chains ⟨G1A1...GkAk⟩ and\ntheir standard deviation, respectively, in terms of the ℓ-weighted Schatten norms of A1, ..., Ak (recall\nDefinition 3.1) and the spectral parameters of the resolvents Gi = G(zi). These are given by\nmk(ℓ; AJk) := 1(k ≥ 2)\nY\nα∈Jk\n|||Aα|||k,ℓ\nand\nsk(ℓ; AJk) :=\nY\nα∈Jk\n|||Aα|||2k,ℓ ,\n(5.5)\nand will be called the mean size and the standard deviation size, respectively. They are functions of\na positive number ℓ (usually given by ℓ = mini ηiρi) and a multiset AJk = (Aα)α∈Jk of deterministic\nmatrices of cardinality |Jk| = k.\nIn the following, we shall frequently drop the symbol A from the definitions in (5.5), i.e. write mk(ℓ; Jk)\nand sk(ℓ; Jk) instead of mk(ℓ; AJk) and sk(ℓ; AJk), respectively. Moreover, for time dependent spectral\nparameters, we will also use the notation mk(t) = mk(t; Jk) = mk(ℓt; AJk), with ℓt = mini ηi,tρi,t, and a\nsimilar notation for the standard deviation size. In particular, we may often omit the dependence on the\ndeterministic matrix A. (More generally, we will omit every argument of (5.5), whenever it is clear what\nthey are and it does not lead to confusion.) For example, for i < j, we have, with ηt := mini ηi,t,\n|⟨M[i,j],tAj⟩| ≲ ℓt mj−i+1(t),\n|⟨M[i,j],t⟩| ≲ (ℓt/ηt)mj−i(t).\n(5.6)\nThe first bound follows from (3.7); the second bound in (5.6) can easily be obtained by arguments entirely\nanalogous to the ones leading to Lemma A.1 in Appendix A. The bounds (5.6) justify the terminology\nthat mk is the mean size of a resolvent chain ⟨G1A1...GkAk⟩, which is well approximated by ⟨M[1,k]Ak⟩.\nThe additional ℓt factor was introduced to simplify formulas later.\nIn the remainder of this section we will often use the following lemma about some relations among the\nsizes mk(t), s(t) from (5.5). The proofs are immediate consequences of (3.6) and ℓs ≳ ℓt for s ≤ t (recall\nthe discussion below (4.5)) and hence omitted.\nLemma 5.1 (m/s-relations). Let k ≥ 1 and consider time-dependent spectral parameters z1,t, ..., zk,t and\na multiset of traceless matrices AJk as above. Then, the mean size mk and the standard variation size sk\nsatisfy the following inequalities.\n(i) Super-multiplicativity, i.e. for any 1 ≤ j ≤ k − 1 we have\nmj(t; Jj) mk−j(t; Jk−j) ≲ mk(t; Jk)\nand\nsj(t; Jj) sk−j(t; Jk−j) ≲ sk(t; Jk)\n(5.7)\nfor all disjoint decompositions Jk = Jj ˙∪Jk−j.\n(ii) The mean size can be upper bounded by the standard deviation size as\nmk(t; Jk) ≲ sk(t; Jk)\nand\np\nm2k(t; Jk ∪ Jk) ≲ sk(t; Jk) ,\n(5.8)\nwhere Jk ∪ Jk denotes the union of the multiset Jk with itself.\n(iii) The standard deviation size satisfies the doubling inequality (recall ℓt = minj∈[k] ηj,tρj,t)\ns2k(t; Jk ∪ Jk) ≲ [1 +\np\nNℓt]\n\u0000sk(t; Jk)\n\u00012 .\n(5.9)\n(iv) Monotonicity in time: for any 0 ≤ s ≤ t we have\nmk(s; Jk) ℓα\ns ≲ mk(t; Jk) ℓα\nt\nsk(s; Jk) ℓβ\ns ≲ sk(t; Jk) ℓβ\nt\n(5.10)\nfor all α ∈ [0, 1] and β ∈ [0, 1/2].\nStochastic control quantities: Master and reduction inequalities. Using the notation from (5.5),\nthe goal is thus to prove that\n⟨G[1,k],T Ak⟩ − ⟨M[1,k],T Ak⟩ = ⟨G[1,k],0Ak⟩ − ⟨M[1,k],0Ak⟩ + O≺\n\u0010sk(T)\nN\n\u0011\n,\n(5.11)\nuniformly in the spectrum and uniformly in traceless deterministic matrices Ai, for some fixed T ≲ 1.\nWe may henceforth assume that all the Ai’s are Hermitian; the general case follows by multilinearity.\n16\nCIPOLLONI, ERD ˝OS, AND HENHEIK\nFor the purpose of proving (5.11), recall the notation ℓt := mini ηi,tρi,t from (5.2) and define\nΦk(t) = Φk(t; z[1,k]; A[1,k]) :=\nN\nsk(ℓt; A[1,k])\n\f\f⟨(G[1,k],t − M[1,k],t)Ak⟩\n\f\f\nfor all\nk ≥ 1 .\n(5.12)\nHere, A[1,k] = (A1, . . . , Ak) and z[1,k] = (z1, ..., zk) with zi = zi,0 (initial condition) denote multisets of\ndeterministic matrices and spectral parameters, respectively. We now briefly comment on the definition\n(5.12). We chose the pre–factor in the definition of Φk(t) so that eventually Φk(t) will be of order one\nwith high probability (cf. (5.11)). However, we will not be able to prove this directly, we first prove\nthat Φk(t) ≺ √Nℓt and then, using this bound as an input, we prove the desired bound Φk(t) ≺ 1. To\nimplement this technically we introduce another quantity\nΨk(t) = Ψk(t; z[1,k]; A[1,k]) :=\nN\nsk(ℓt; A[1,k])√Nℓt\n\f\f⟨(G[1,k],t − M[1,k],t)Ak⟩\n\f\f\nfor all\nk ≥ 1 ,\n(5.13)\nwhich we will show to be bounded by one (note that Ψk(t) ≺ 1 implies Φk(t) ≺ √Nℓt), and then show\nthat Ψk(t) ≺ 1 in fact implies Φk(t) ≺ 1.\nWe start considering Ψk(t); note that by (4.7) it follows\nΨk(0) ≲ Φk(0) ≺ 1,\n(5.14)\nfor any k ≥ 1. For this purpose we will derive a series of master inequalities for these quantities with the\nfollowing structure. We assume that\nΨk(t) ≺ ψk\n(5.15)\nholds for some deterministic control parameter ψk ≥ 1, uniformly in deterministic matrices Ai, times\n0 ≤ t ≤ T and in spectral parameters with ℓt ≥ N −1+ϵ for some small fixed ϵ > 0 (we stress that the ψk’s\ndepend neither on time, nor on the spectral parameters zi,t, nor on the deterministic matrix A). Starting\nfrom (5.15) we derive an improved upper bound for Ψk(t) and show that, by iterating these inequalities,\nwe indeed obtain the desired Ψk(t) ≺ 1. The main inputs to prove this fact are the master inequalities\nin (5.16), which informally states that if Ψl(t) ≺ ψl for any l = 1, . . . , k + 1(k odd), then this actually\nimplies the improved bound (5.16).\nProposition 5.2 (Master inequalities). Fix k ∈ N. Assume that Ψl(t) ≺ ψl for some deterministic\ncontrol parameters ψl, for any 1 ≤ l ≤ k + 1(k odd), uniformly in t ∈ [0, T]. Then\nΨk(t) ≺ 1 +\nk−2\nX\nj=1\nψj +\n1\n(NℓT )1/4\nk\nX\nj=1\neψj eψk−j,\n(5.16)\nuniformly in t ∈ [0, T]. Here we set eψl := ψl + 1(l odd)\np\nψl−1ψl+1 and ψ0 := 1.\nUsing (5.16), in the next section we show that Ψk(t) ≺ 1 by an iterative procedure. Then, to conclude\nΦk(t) ≺ 1, we rely on the following proposition, which will eventually prove Proposition 4.3.\nProposition 5.3. Fix k ∈ N, assume that Φl(t) ≺ 1, for l ≤ k − 2 uniformly in t ∈ [0, T], and that\nΦl(t) ≺ √Nℓt for 1 ≤ l ≤ 2k and t ∈ [0, T]. Then\nΦk(t) ≺ 1,\n(5.17)\nuniformly in t ∈ [0, T].\n5.1. Closing the hierarchy: Proof of Proposition 4.3. To show that Proposition 5.2 in fact implies\nΨk(t) ≺ 1 we rely on the following procedure, which we refer to as iteration (see, e.g., [13, Lemma 4.1]).\nLemma 5.4 (Iteration). Fix k ∈ N, T > 0, and N-independent constants ϵ, δ > 0, α ∈ (0, 1) and D > 0.\nLet X be a random variable depending on k time dependent spectral parameters z1,t, ..., zk,t, t ∈ [0, T], and\nrecall that ℓt = minj∈[k] ηj,tρj,t. Assume that the a-priori bound X ≺ N D holds uniformly in t ∈ [0, T],\nℓt ≥ N −1+ϵ. Suppose that there is a deterministic quantity x (may depend on ℓT and N) such that for\nany fixed l ∈ N the fact that X ≺ x uniformly for t ∈ [0, T] and ℓt ≥ N −1+lϵ implies14\nX ≺ A + x\nB + x1−αCα,\n(5.18)\n14Here the scalar A > 0 should not be confused with the matrices Ai which appear throughout the proof.\nOUT-OF-TIME-ORDERED CORRELATORS FOR WIGNER MATRICES\n17\nuniformly for t ∈ [0, T] and ℓt ≥ N −1+(l+l′)ϵ, for some constants15 l′ ∈ N, B ≥ δ > 0, A, C > 0. Then,\niterating (5.18) finitely many times, we obtain\nX ≺ A + C,\nuniformly for t ∈ [0, T] and ℓt ≥ N −1+(1+Kl′)ϵ, for some K = K(α, D, δ).\nWe are now ready to present the proof of Proposition 4.3.\nProof of Proposition 4.3. The proof of this proposition is divided into two steps: we first prove that\nΨk(t) ≺ 1 for any k and then use this information as an input to conclude that Φk(t) ≺ 1 for any k.\nThese two bounds are quite different in spirit. The first one is an a-priori bound so the iterative procedure\nbehind its proof must be self-improving. This is reflected in the triangular structure of (5.16): the right\nhand side contains quantities with index at most k (or k + 1 when k is odd) and terms with the highest\nindex come with a small prefactor (recall that NℓT is large). This makes the system (5.16) closable. The\niteration is done essentially for each fixed k and then we use an induction on k. Owing to the parity\nissue in the definition of eψ, we use a step-two induction, but this is just a small technicality. The second\nbound Φk(t) ≺ 1 is quite different, since its proof relies on the a-priori bound obtained in the first step.\nThe key point is that in order to prove Φk(t) ≺ 1 for some fixed k, we need to know the a-priori bound\nΦl(t) ≺ √Nℓt for any l ≤ 2k, i.e. without the a-priori bound the system of inequalities behind the proof\nof Φk(t) ≺ 1 would not be closable. This explains why we need to proceed in two stages.\nWe now start we the proof of Ψk(t) ≺ 1. We first prove this for k = 1, 2 and then, using an inductive\nargument, we show that the same bound holds for any k ≥ 3. By (5.16) for k = 1, 2 we have\nΨ1(t) ≺ 1 + ψ1 + √ψ2\n(NℓT )1/4 ,\nΨ2(t) ≺ 1 + ψ2\n1 + ψ2\n(NℓT )1/4\n(5.19)\nUsing iteration we then obtain (all estimates are uniform in t ∈ [0, T])\nΨ1(t) ≺ 1 +\n√ψ2\n(NℓT )1/4 ,\nΨ2(t) ≺ 1 +\nψ2\n1\n(NℓT )1/4 .\n(5.20)\nPlugging the first inequality into the second one and using iteration, this immediately gives that Ψ1(t) +\nΨ2(t) ≺ 1.\nNext, we proceed with the induction step. Fix an even k ∈ N, and assume that Ψl(t) ≺ 1, for l ≤ k−2,\nthen by (5.16) we have\nΨk−1(t) ≺ 1 + ψk−1 + √ψk\n(NℓT )1/4\n,\nΨ2(t) ≺ 1 + ψk−1 + ψk + √ψk\n(NℓT )1/4\n(5.21)\nBy iteration, we have\nΨk−1(t) ≺ 1 +\n√ψk\n(NℓT )1/4 ,\nΨ2(t) ≺ 1 + ψk−1,\n(5.22)\nwhich concludes Ψl(t) ≺ 1, for l ≤ k, by plugging the first inequality into the second one and using\niteration once again.\nFinally, to conclude Φk(t) ≺ 1, we proceed by a step-two induction on k. For k = 1, 2, the assumption\nΦl(t) ≺ √Nℓt, for l ≤ 4, of Proposition 5.3 is satisfied, and so we have Φ1(t) + Φ2(t) ≺ 1. Then we\nproceed with the induction step, i.e. for a fixed even k ∈ N we assume that Φl(t) ≺ √Nℓt, for l ≤ 2k,\nand Φl(t) ≺ 1, for l ≤ k − 2. Then, by Proposition 5.3, we have Φl(t) ≺ 1 for l ≤ k; this concludes the\ninduction step, hence the proof.\n□\n5.2. Master and reduction inequalities: Proofs of Propositions 5.2–5.3. We first present the\nproof of Proposition 5.2 in detail and then at the end of this section we explain the minor changes to\nobtain Proposition 5.3.\nProof of Proposition 5.2. To keep the notation simple, from now on we often omit the t–dependence from\nthe resolvents Gi = Gi,t and from their deterministic approximations M[i,j] = M[i,j],t, but we will still\nkeep the t–dependence in the spectral parameters, in Ψk(t) and in the quantities (5.5); additionally, we\nstress that ψk does not depend on time. All estimates are uniform in the time parameters t, s ∈ [0, T].\n15The constants A, B, C may depend on N, while l and l′ are independent of N.\n18\nCIPOLLONI, ERD ˝OS, AND HENHEIK\nNote that in (5.13) we defined Ψk(t) only for alternating chains of single resolvents and deterministic\nA’s, i.e. no Gk\ni appears. However, in (5.3) we naturally get chains involving G2\ni . For these terms we use\nthe estimate (recall the estimate for ⟨M[i,j]⟩ from (5.6)):\n\f\f⟨G[i,j] − M[i,j]⟩\n\f\f ≺ ψj−isj−i(t)\nNηt\n.\n(5.23)\nFor Im zi,tIm zj,t > 0 this trivially follows by integral representation\nGjGi =\n1\n2πi\nZ\nΓ\nG(z)\n(z − zi,t)(z − zj,t) dz,\n(5.24)\nfor ”linearizing” the product of the first and last G’s in ⟨G[i,j]⟩ = ⟨GiAi . . . Aj−iGj⟩ after using cyclicity\nof the trace. Here Γ is a contour which lies in the region {z ∈ C : |Im z|ρ(z) ≥ ℓt/2}. For Im zi,tIm zj,t < 0\nwe ”linearize” by the resolvent identity. Using (5.24) will change the value of the imaginary part of the\nspectral parameters, so the domain on which the inequalities below hold (characterized by Nℓ ≥ N ϵ)\nmay change from time to time, i.e., say ϵ → ϵ/2. However, this can happen only finitely many times as\nit does not affect the ≺–bound (see [13, Figure 2] for a detailed discussion of this minor technicality).\nTo describe the evolution of M[1,k],t in (5.3) we rely on the following lemma.\nLemma 5.5 (Lemma 4.8 of [14]). For any deterministic matrices Ai ∈ CN×N (i.e. not necessarily\ntraceless), we have\n∂t⟨M[1,k],tAk⟩ = k\n2⟨M[1,k],tAk⟩ +\nk\nX\ni,j=1,\ni<j\n⟨M[i,j],t⟩⟨M[j,i],t⟩.\n(5.25)\nAdding and subtracting the deterministic approximation of each term in (5.3) and using Lemma 5.5\nwe thus obtain\nd⟨(G[1,k],t − M[1,k],t)Ak⟩ =\n1\n√\nN\nN\nX\na,b=1\n∂ab⟨G[1,k],tAk⟩dBab,t + k\n2⟨G[1,k],tAk⟩dt +\nk\nX\ni,j=1\ni<j\n⟨G[i,j],t − M[i,j],t⟩⟨M[j,i],t⟩dt\n+\nk\nX\ni,j=1\ni<j\n⟨M[i,j],t⟩⟨G[j,i],t − M[j,i],t⟩dt +\nk\nX\ni,j=1\ni<j\n⟨G[i,j],t − M[i,j],t⟩⟨G[j,i],t − M[j,i],t⟩dt\n+\nk\nX\ni=1\n⟨Gi,t − mi,t⟩⟨G(i)\n[1,k],tAk⟩dt.\n(5.26)\nWe point out that, using a simple change of variables, the term ⟨G[1,k]Ak⟩ amounts to a simple rescaling\nekt/2, so we will ignore it. The quadratic variation of the martingale term in (5.26) is given by\n1\nN\nN\nX\na,b=1\n\f\f∂ab⟨G[1,k]Ak⟩\n\f\f2 ≲\nk\nX\ni=1\n⟨Im Gi(AiIm Gi+1 . . . Ai−1)Im Gi(AiIm Gi+1 . . . Ai−1)∗⟩\nN 2η2\ni,t\n,\n(5.27)\nwhere we also used the Ward-identity GiG∗\ni = η−1\ni\nIm Gi. Notice that the rhs. of (5.27) naturally contains\nchains of 2k resolvents. However, to have a closed system of master inequalities for products of resolvents\nof length k, we split the chain of length 2k into the product of two chains of length k. For this purpose\nwe use the following reduction inequality which will be proven at the end of this section. For any fixed\nmatrices R, Q ∈ CN×N, and spectral parameters z, w ∈ C \\ R, we have16\n⟨Im G(z)QG(w)RIm G(z)R∗G(w)∗Q∗⟩ ≲ N⟨Im G(z)Q|G(w)|Q∗⟩⟨Im G(z)R∗|G(w)|R⟩.\n(5.29)\n16We point out that the bound Ψk(t) ≤ ψk holds also for chains when some resolvents G’s are replaced by their absolute\nvalue |G|. This can be easily seen using the integral representation\n|G(E + iη)| = 2\nπ\nZ ∞\n0\nIm G(E + i\np\nη2 + v2)\np\nη2 + v2\ndv ,\n(5.28)\ntogether with the bound (5.13) for chains containing only resolvents (see e.g. [10, Lemma 5.1]).\nOUT-OF-TIME-ORDERED CORRELATORS FOR WIGNER MATRICES\n19\nWe now focus on the case k being even for notational simplicity. Combining (5.27) with (5.29) used\nfor z = z1, w = zk/2 and\nQ = A1G2 . . . Gk/2−1Ak/2−1 ,\nR = Ak/2Gk/2+1 . . . GkAk,\ntogether with Ψk(t) ≺ ψk, we obtain the following bound for the quadratic variation\n1\nN\nN\nX\na,b=1\n\f\f∂ab⟨G[1,k],sAk⟩\n\f\f2 ≺ mk(s)2\nNη2s\n+ Nℓts(s)2ψ2\nk\nN 3η2s\n.\n(5.30)\nThen, using the Burkholder–Davis–Gundy (BDG) inequality, we conclude that the martingale term in\n(5.26) is bounded by\nN\nsk(t)√Nℓt\n\u0014Z t\n0\n\u0012ℓsmk(s)2\nNη2s\n+ Nℓssk(s)2ψ2\nk\nN 3η2s\n\u0013\nds\n\u00151/2\n≲ mk(t)\nsk(t) + ψk\n√\nN\n\u0012Z t\n0\n1\nη2s\nds\n\u00131/2\n≲ 1 +\nψk\n√Nℓt\n,\n(5.31)\nwith very high probability. Here in the first inequality we used (5.10), and in the second inequality we\nused (5.8) for the first term and (5.2) for the second term.\nSimilarly, for odd k, using (5.29) for z = z1, w = z(k−1)/2 and\nQ = A1G2 . . . G(k−3)/2A(k−3)/2 ,\nR = A(k−1)/2G(k+1)/2 . . . GkAk\nwe get a bound 1 +\np\nψk−1ψk+1/(Nℓt)1/4 for the martingale term.\nNext, using (5.23), we estimate the contribution of the last term in (5.26)\nN\nsk(t)√Nℓt\nZ t\n0\n⟨Gi,s − mi,s⟩⟨G(i)\n[1,k],sAk⟩ ds ≺\nN\nsk(t)√Nℓt\nZ t\n0\n1\nNη2s\n\u0012\nℓsmk(s) + ψksk(s)√Nℓs\nN\n\u0013\nds\n≲\n1\n√Nℓt\n+ ψk\nNℓt\n,\n(5.32)\nwhere in the first inequality we used |⟨Gi,s − mi,s⟩| ≺ (Nηs)−1 from (1.4), and in the second inequality\nwe used (5.8), (5.10) and (5.2).\nUsing again (5.23), we estimate the last term in the first line and the first term in the second line of\n(5.26) as follows:\nN\nsk(t)√Nℓt\nZ t\n0\nk−1\nX\ni,j=1\ni<j\n⟨M[i,j],s⟩⟨G[j,i],s − M[j,i],s⟩ ds\n≺\nN\nsk(t)√Nℓt\nZ t\n0\nk−1\nX\ni,j=1\ni+1<j\nℓsmj−i(s)\nηs\nψk−(j−i)sk−j+i(s)√Nℓs\nNηs\nds ≲\nk−2\nX\nj=1\nψj,\n(5.33)\nwhere in the first inequality we used that ⟨M[i,i+1],s⟩ = 0 and (5.6) to estimate ⟨M[i,j],s⟩, and in the\nsecond inequality we used (5.7)–(5.8), (5.10) and (5.2).\nFinally, for the last term in the second line of (5.26) we estimate:\nN\nsk(t)√Nℓt\nZ t\n0\nk−1\nX\ni,j=1\ni<j\n⟨G[i,j],s − M[i,j],s⟩⟨G[j,i],s − M[j,i],s⟩ ds\n≺\nN\nsk(t)√Nℓt\nk−1\nX\ni,j=1\ni<j\nZ t\n0\nψj−isj−i(s)√Nℓs\nNηs\nψk−(j−i)sk−j+i(s)√Nℓs\nNηs\nds\n≲\n1\n√Nℓt\nk−1\nX\nj=1\nψjψk−j,\n(5.34)\n20\nCIPOLLONI, ERD ˝OS, AND HENHEIK\nwhere in the second inequality we used (5.7), (5.10) and (5.2). Collecting all these bounds, using that\nℓt ≳ ℓT and NℓT ≥ 1, we obtain\nΨk(t) ≺ 1 + ψk + 1(k odd)\np\nψk−1ψk+1\n(NℓT )1/4\n+\nk−2\nX\nj=1\nψj +\n1\n(NℓT )1/2\nk−1\nX\nj=1\nψjψk−j.\nFinally, using that ψl ≥ 1 and NℓT ≥ 1, we conclude (5.16).\n□\nProof of Proposition 5.3. The proof of (5.17) is very similar to the one of (5.16), for this reason we only\nexplain the minor differences. All the terms in (5.26) are estimated exactly in the same way as in the\nproof of Proposition 5.2 with the exception of the martingale term. In fact, this is the only step where\nthe estimate for Ψk (first step) differs from the estimate on Φk (second step). Estimating a longer chain\nby two smaller ones loses a certain Nℓ factor; this loss is unavoidable in the first step, but it can be\navoided in the second one, once the a-priori bound is available.\nMore precisely, the estimates in (5.32), (5.34), after multiplying them by a factor √Nℓt, are the same\nwith the only minor difference that we can now use ψl = 1. The estimate (5.33) becomes (recall that\n⟨M[i,i+1],s⟩ = 0)\nN\nsk(t)\nZ t\n0\nk−1\nX\ni,j=1\ni+1<j\n⟨M[i,j],s⟩⟨G[j,i],s−M[j,i],s⟩ ds ≺\nN\nsk(t)\nZ t\n0\nk−1\nX\ni,j=1\ni+1<j\nℓsmj−i(s)\nηs\nΦk−(j−i)sk−j+i(s)\nNηs\nds ≲ 1, (5.35)\nwhere the only difference with (5.33) is that now in the second inequality we used that Φl(t) ≺ 1, for\nl ≤ k − 2, by the induction assumption. Instead of the bound for the quadratic variation (5.27), using\nthat Φ2k(t) ≺ √Nℓt, the estimate in (5.31) is replaced by\nN\nsk(t)\n\u0014Z t\n0\n⟨Im G1,s(A1 . . . Ak)Im G1,s(Ak . . . A1)∗⟩\nN 2η2s\nds\n\u00151/2\n≺\nN\nsk(t)\n\u0014Z t\n0\n\u0012m2k(s)ℓs\nN 2η2s\n+ Φ2k(s)s2k(s)\nN 3η2s\n\u0013\nds\n\u00151/2\n≲\n\u0014Z t\n0\n\u0012 ℓt\nη2s\n+\n√Nℓt\nNη2s\n\u0013\nds\n\u00151/2\n≲ 1 ,\n(5.36)\nwhere in the second inequality we used (5.8), (5.10) and in the last inequality we used (5.2).\nThis\nconcludes the proof of Proposition 5.3.\n□\nWe conclude this section with the proof of (5.29).\nProof of (5.29). By spectral decomposition of W (λi, ui being its eigenvalues and eigenvectors) we have\n⟨Im G(z)QG(w)RIm G(z)R∗G(w)∗Q∗⟩ = |Im z|2\nN\nN\nX\ni,j,k,l=1\n⟨ui, Quj⟩⟨uj, Ruk⟩⟨uk, R∗ul⟩⟨ul, Q∗ui⟩\n|λi − z|2(λj − w)|λk − z|2(λl − w)\n≲ N⟨Im G(z)Q|G(w)|Q∗⟩⟨Im G(z)R∗|G(w)|R⟩,\n(5.37)\nwhere in the last step we used Schwarz inequality\n\f\f⟨ui, Quj⟩⟨uj, Ruk⟩⟨uk, R∗ul⟩⟨ul, Q∗ui⟩\n\f\f ≲\n\f\f⟨ui, Quj⟩⟨uk, R∗ul⟩\n\f\f2 +\n\f\f⟨uj, Ruk⟩⟨ul, Q∗ui⟩\n\f\f2 .\n□\n6. Green function comparison: Proof of Proposition 4.4\nIn this section, we remove the Gaussian component introduced in Proposition 4.3 using a Green\nfunction comparison (GFT) argument, i.e. we prove Proposition 4.4. The basic idea is the same as in [14,\nSection 5]: We perform a self-consistent GFT (i.e., given a local law for one ensemble, we aim to prove it\nfor a different one) using an entry-by-entry Lindeberg replacement strategy in O(N 2) many steps. Note\nthat, unlike here, in typical applications of GFT to answer universality questions, the local law is given as\nan a-priori input. Prior to [14] the GFT has been used in a similar spirit by Knowles and Yin [31] in order\nto prove a single resolvent local law for ensembles, where the deterministic approximation M to G is no\nlonger a multiple of the identity (e.g. deformed Wigner matrices). In contrast to our approach, they used\nOUT-OF-TIME-ORDERED CORRELATORS FOR WIGNER MATRICES\n21\na continuous interpolation between ensembles, but we stick with the entrywise Lindeberg replacement,\nwhich is easier to adjust to multiple resolvents, similarly as in [14].\nA characteristic property of the Lindeberg strategy, is that along the replacement procedure isotropic\nresolvent chains naturally arise. In particular, we have to consider the isotropic analog of Theorem 3.3,\nthe average local law, as well, and need to show that also\n\u0000G1A1...GkAkGk+1\n\u0001\nxy\n(6.1)\nconcentrates around a deterministic value\n\u0000M(z1, A1, ..., zk, Ak, zk+1)\n\u0001\nxy with M given by (3.2). This\nwill also be done via the Zigzag strategy (recall the outline in the beginning of Section 4) in Section 6.1.\nFirst, analogously to Lemma 3.2, we have the following bound on the deterministic approximation of\n(6.1), the proof of which is deferred to Appendix A.\nLemma 6.1 (Isotropic M-bounds). Assume the setting of Lemma 3.2 but with k + 1 (instead of k)\nspectral parameters z1, ..., zk+1 ∈ C \\ R. Then, for deterministic vectors x, y ∈ CN with ∥x∥, ∥y∥ ≲ 1, it\nholds that17\n\f\f⟨x, M[1,k+1](z1, A1, ..., Ak, zk+1)y⟩\n\f\f ≲\nY\ni∈[k]\n|||Ai|||∞,ℓ ,\n(6.2)\nwhere |||Ai|||∞,ℓ has been introduced in Definition 3.1.\nThe analog of Theorem 3.3 is the following isotropic multi-resolvent local law. The proof is given in\nSection 6.1.\nTheorem 6.2 (Isotropic multi-resolvent local laws). Assume the setting of Theorem 3.3 but with k + 1\n(instead of k) spectral parameters z1, ..., zk+1 ∈ C \\ R and let x, y ∈ CN be deterministic vectors with\n∥x∥, ∥y∥ ≲ 1. Then it holds that\n\f\f⟨x, G1A1...AkGk+1y⟩ − ⟨x, M[1,k+1]y⟩\n\f\f ≺\n1\n√\nNℓ\nY\ni∈[k]\n|||Ai|||∞,ℓ ,\n(6.3)\nwhere |||Ai|||∞,ℓ has been introduced in Definition 3.1.\nAnalogously to Theorem 3.3 and (3.9), this unifies and improves the previous local laws with operator\nnorm (see [10, Eq. (2.11b) in Theorem 2.5]) and Hilbert-Schmidt norm (see [11, Corollary 2.4]) in the\nbulk of the spectrum. This follows by estimating (in the relevant ℓ ≲ 1 regime)\n|||Ai|||∞,ℓ ≲\n\n\n\n\n\n\n\n∥Ai∥\nℓ1/2\nfor [10, Eq. (2.11b) in Theorem 2.5]\n(Nℓ)1/2 ⟨|Ai|2⟩1/2\nℓ1/2\nfor [11, Corollary 2.4]\n(6.4)\nin (6.3) for Nℓ > 1 and every i ∈ [k] by means of elementary inequalities.\nNote that in the isotropic law (6.3) we use the |||Ai|||∞,ℓ norm instead of the |||Ai|||2k,ℓ norm in the\ncorresponding averaged law (3.8). By taking Ak+1 := Nyx∗ (assume for simplicity that ⟨x, y⟩ = 0) in\n(3.8) for k → k +1, it would in fact be possible to obtain an isotropic law immediately from Theorem 3.3.\nHowever, the bound provided in (6.3) is stronger than that, as can be seen by means of (3.6) and\n|||Ak+1|||2(k+1),ℓ ∼ N/(Nℓ)\n1\n2(k+1) , which yield\n1\n√\nNℓ\nY\ni∈[k]\n|||Ai|||∞,ℓ ≲ 1\nN\nY\ni∈[k+1]\n|||Ai|||2(k+1),ℓ .\n(6.5)\nIn case that all Ai for i ∈ [k] have large rank, the lhs. of (6.5) is in fact much smaller (by some inverse\n(Nℓ)-power) than the rhs. of (6.5).\nAs for Theorem 3.3, we now give a concrete example (6.6) how to use Theorem 6.2 for general (i.e. not\nnecessarily traceless) matrices.\n17Analogously to Footnote 10, we point out that the case of k odd admits an improved bound by Q\ni∈[k] ∥Ai∥\n1\nk |||A|||\n1− 1\nk\n∞,ℓ ,\nbut we do not follow this improvement for simplicity.\n22\nCIPOLLONI, ERD ˝OS, AND HENHEIK\nExample 6.3. For k = 1, by (6.3), we have\n\f\f\f\f⟨x, G1BG2y⟩ − m1m2Bxy − m1m2⟨B⟩⟨x, y⟩\n1 − m1m2\n\f\f\f\f ≺ |⟨B⟩|\n√\nNℓ3 + ⟨|˚\nB|2⟩1/2\n√\nNℓ2\n+ ∥˚\nB∥\n√\nNℓ\n,\n(6.6)\nfor a general matrix B = ˚\nB + ⟨B⟩, completely analogously to (3.11).\n6.1. Isotropic law: Proof of Theorem 6.2. Analogously to the proof of the averaged law, Theo-\nrem 3.3, the proof of the isotropic law, Theorem 6.2, is also conducted via the Zigzag strategy with\nnatural modifications, so we will be very brief. The initial step, the global law, has already been proven\nin [10, Theorem 2.5] (see Eq. (2.11b) in the d ≥ 1 regime, which is even stronger than (6.7) below).\nProposition 6.4 (Step 1: Isotropic global law). Let W be a Wigner matrix satisfying Assumption 2.1,\nand fix k ∈ N and δ > 0. Consider spectral parameters z1, ..., zk+1 ∈ C \\ R, the associated resolvents\nGj = G(zj) := (W − zj)−1, and deterministic matrices B1, ..., Bk ∈ CN×N. Then, uniformly in spectral\nparameters satisfying d := minj∈[k+1] dist(zj, [−2, 2]) ≥ δ, deterministic matrices B1, ..., Bk and deter-\nministic vectors x, y with ∥x∥, ∥y∥ ≲ 1, it holds that\n\f\f\f\n\u0000G1B1...BkGk+1\n\u0001\nxy −\n\u0000M[1,k+1]\n\u0001\nxy\n\f\f\f ≺\nQ\ni∈[k] |||Bi|||∞,d\n√\nNd\n.\n(6.7)\nIn the second step, the global law is propagated to a local law through the characteristic flow (4.1)–\n(4.2), thereby introducing an order one Gaussian component. The proof of Proposition 6.5 is postponed\nto Appendix A.2.1.\nProposition 6.5 (Step 2: Isotropic characteristic flow). Fix any ϵ, γ > 0, a time 0 ≤ T ≤ γ, and K ∈ N.\nConsider z1,0, . . . , zK+1,0 ∈ C \\ R as initial conditions to the solution zj,t of (4.2) for 0 ≤ t ≤ T and\ndefine Gj,t := Gt(zj,t) as well as ηj,t := |Im zj,t| and ρj,t := π−1|Im m(zj,t)|.\nLet k ≤ K, define ℓt := minj∈[k+1] ηj,tρj,t and recall (3.5). Assuming that\n\f\f\f\n\u0000G1,0A1...AkGk+1,0\n\u0001\nxy −\n\u0000M[1,k+1],0\n\u0001\nxy\n\f\f\f ≺\n1\n√Nℓ0\nY\ni∈[k]\n|||Ai|||∞,ℓ0\n(6.8)\nholds uniformly for any k ≤ K, any choice of deterministic traceless A1, ..., Ak, any choice of zi,0’s such\nthat Nℓ0 ≥ N ϵ and maxj∈[k] |zj,0| ≤ N 1/ϵ, and all deterministic vectors ∥x∥, ∥y∥ ≲ 1, then we have\n\f\f\f\n\u0000G1,T A1...AkGk+1,T\n\u0001\nxy −\n\u0000M[1,k+1],T\n\u0001\nxy\n\f\f\f ≺\n1\n√NℓT\nY\ni∈[k]\n|||Ai|||∞,ℓT\n(6.9)\nfor any k ≤ K, again uniformly in traceless matrices Ai, in deterministic vectors x, y with ∥x∥, ∥y∥ ≲ 1\nand in spectral parameters satisfying NℓT ≥ N ϵ and maxj∈[k] |zj,T | ≤ N 1/ϵ.\nIn the third and final step, we remove the Gaussian component introduced in Proposition 6.5 by a\nGFT argument. The proof of Proposition 6.6 is given in Section 6.2.1 below.\nProposition 6.6 (Step 3: Isotropic Green function comparison). Let H(v) and H(w) be two N × N\nWigner matrices with matrix elements given by the random variables vab and wab, respectively, both\nsatisfying Assumption 2.1 and having matching moments up to third order, i.e.\nE¯vu\nabvs−u\nab\n= E ¯wu\nabws−u\nab\n,\ns ∈ {0, 1, 2, 3} ,\nu ∈ {0, ..., s} .\n(6.10)\nFix K ∈ N and consider spectral parameters z1, ..., zK+1 ∈ C \\ R satisfying minj Nηjρj ≥ N ϵ and\nmaxj |zj| ≤ N 1/ϵ for some ϵ > 0 and the associated resolvents G(#)\nj\n= G(#)(zj) := (H(#) − zj)−1 with\n# = v, w. Pick traceless matrices A1, ..., AK ∈ CN×N.\nFor any k ≤ K, consider any subset of cardinality k+1 of the K +1 spectral parameters, and similarly,\nconsider any subset of cardinality k of the deterministic matrices. Relabeling them by [k + 1] and [k],\nrespectively, setting ℓ := minj∈[k+1] ηjρj and recalling (3.5), we assume that for Gj = G(v)\nj\nwe have\n\f\f\f\n\u0000G1A1...AkGk+1\n\u0001\nxy −\n\u0000M[1,k+1]\n\u0001\nxy\n\f\f\f ≺\n1\n√\nNℓ\nY\ni∈[k]\n|||Ai|||∞,ℓ ,\n(6.11)\nuniformly in all choices of subsets of z’s and A’s and in bounded deterministic vectors ∥x∥, ∥y∥ ≲ 1.\nThen, (6.11) also holds for the ensemble H(w), i.e. for Gj = G(w)\nj\n, uniformly in all choices of subsets\nof z’s and A’s and in bounded deterministic vectors ∥x∥, ∥y∥ ≲ 1.\nOUT-OF-TIME-ORDERED CORRELATORS FOR WIGNER MATRICES\n23\nBased on Propositions 6.4–6.6, the proof of Theorem 6.2 is concluded in the same way as the proof of\nTheorem 3.3 in the end of Section 4.\n□\n6.2. GFT argument: Proof of Propositions 4.4 and 6.6. The principal idea of the GFT argument\nis the same as in [14, Section 5] and even the detailed argument almost directly translates to our case.\nThe main difference is that we now use the conceptual mean and standard deviation sizes m/s (recall\n(5.5)) and miso/siso (see (6.13) and (A.5) below) as basic deterministic control quantities; while in [14,\nSection 5] they were not introduced explicitly as they essentially boiled down to simple N-powers. More\nprecisely, in view of the bounds [14, Eqs. (2.17)–(2.18) and (2.20)–(2.21)], we simply replace (ignoring all\nthe ρ-factors and using the normalization ⟨|Ai|2⟩ = 1 for the just mentioned terms in [14])\nN k/2\nNℓ\n−→ mk ,\nN k/2\n(Nℓ)1/2 −→ sk ,\nN k/2 −→ miso\nk ,\nand\nN k/2\nℓ1/2 −→ siso\nk .\n(6.12)\nGiven this similarity (6.12) we will henceforth be very brief and only point out a few minor adaptions\nof the proof in [14, Section 5] to our new conceptual notations in Sections 6.2.1–6.2.2, discussing the\nisotropic and averaged case, respectively. For further simplicity of notation, we shall drop all irrelevant\nsub-scripts of resolvents and deterministic matrices, i.e. write G = Gj and A = Aj. Additionally, we will\nalso drop the qG- and G(γ)-notations (see [14, Eq. (5.10)]), indicating the precise step in the replacement\nprocedure, as it will be irrelevant for the modifications discussed below.\n6.2.1. Part (a): Proof of the isotropic law, Proposition 6.6 (cf. Section 5.2 in [14]). We start with some\npreliminaries. In order to express the bounds in (6.2) and (6.3) concisely, we employ the miso/siso-notation\n(the isotropic mean and standard deviation sizes, analogously to (5.5) in the average case) to write (6.2)\nand (6.3) as\n\f\f(M[1,k+1])xy\n\f\f ≲ (|||A|||∞,ℓ)k =: miso\nk\nand\n\f\f\f\n\u0000(GA)kG\n\u0001\nxy −\n\u0000M[1,k+1]\n\u0001\nxy\n\f\f\f ≺\n(|||A|||∞,ℓ)k\n√\nNℓ\n=: siso\nk\nN 1/2 ,\n(6.13)\nrespectively (the general definition of miso/siso is given in (A.5)). Moreover, we also write Mj−i+1 ≡ M[i,j]\nfor all 1 ≤ i < j ≤ k + 1 with a slight abuse of notation (see [14, Eq. (5.33)]). Lastly, we will heavily use\nthe following relations, proven in parts (i)–(ii) of Lemma A.2,\nmiso\nj\nmiso\nk−j ≲ miso\nk ,\nsiso\nj\nsiso\nk−j ≲ ℓ−1/2siso\nk ,\nand\nmiso\nk\n≲ ℓ1/2 siso\nk\n(6.14)\nfor all k ∈ N and 0 ≤ j ≤ k using the conventions miso\n0\n:= 1 and siso\n0\n:= ℓ−1/2 (recall ℓ = mini ηiρi). With\n(6.13)–(6.14) at hand, we can now discuss the two bits of the argument in [14, Section 5.2], which are not\ncompletely straightforward to adapt to our current setting (cf. Case (i) and Case (ii) in [14, Section 5.2.2]).\nWe will refer to explicit equation numbers within a longer proof in [14] that we do not repeat here, hence\nthe reader needs to be familiar with [14, Section 5.2] to follow the details.\nHowever, to facilitate a\nhigh level understanding without going into details, we recall the novel idea in [14]. Traditional GFT\nproofs via the Lindeberg strategy estimated the change of, say, E\n\f\f\u0000(GA)kG\n\u0001\nxy\n\f\fp after each replacement\nvab → wab and showed that it is bounded by o(N −2)-times its natural target size, so N 2 replacements\nwere affordable. In other words the telescopic summation over (a, b) ∈ [N]2 was done trivially. This does\nnot hold for the self-consistent GFT argument in [14]: the replacement for some (a, b) pairs may be too\nlarge, but their sum is still affordable. We will refer to it as the gain from the summation idea. This is\nrelated to our efforts to control the observables in tracial norms; the simplest toy example is the estimate\n1\nN 2\nX\nab\n|Aab| ≤ N −1/2⟨|A|2⟩1/2\n(6.15)\nwhich is optimal. However, if we use the best available bound |Aab| ≤ ∥A∥ for each summand individually,\nthen the lhs. of (6.15) is overestimated by ∥A∥ which is much bigger than the rhs. With keeping this\nidea in mind, we now return to the detailed modifications in [14, Section 5.2.2].\nThe terms considered in Case (i) are the ones for which there are enough (G − M)-type terms to\nbalance the N-prefactor (cf. (6.16) and (6.17)) by solely using (6.14). The terms in Case (ii) require to\ngain from the summation over all steps in the replacement procedure.\n24\nCIPOLLONI, ERD ˝OS, AND HENHEIK\nCase (i): First, the analog of [14, Eq. (5.34)] becomes (neglecting the irrelevant |Ψk|p−1- and N ξ-factors)\nN 1/2\nsiso\nk\nX\n0≤kl≤k−1:\nP\nl kl=k\nE\nh\f\f\u0000(GA)k1G − Mk1+1\n\u0001\nxei\n\u0000Mk2+1\n\u0001\nejej\n\u0000Mk3+1\n\u0001\neiei\n\u0000Mk4+1\n\u0001\nejej\n\u0000Mk5+1\n\u0001\neiy\n\f\f\n+\n\f\f\u0000(GA)k1G − Mk1+1\n\u0001\nxei\n\u0000(GA)k2G − Mk2+1\n\u0001\nejej\n\u0000Mk3+1\n\u0001\neiei\n\u0000Mk4+1\n\u0001\nejej\n\u0000Mk5+1\n\u0001\neiy\n\f\f + ...\ni\n≲ N 1/2\nsiso\nk\nX\n0≤kl≤k−1:\nP\nl kl=k\n\"\nsiso\nk1\nN 1/2\n 5\nY\nl=2\nmiso\nkl\n!\n+ siso\nk1 siso\nk2\nN\n 5\nY\nl=3\nmiso\nkl\n!\n+ ...\n#\n≲\n\u0014\n1 +\n1\n(Nℓ)1/2 + ...\n\u0015\n≲ 1 .\n(6.16)\nIn the penultimate step we used the relations in (6.14) multiple times to estimate siso\nk1\nQ5\nl=2 miso\nkl ≲\nsiso\nk\nand siso\nk1 siso\nkl\nQ5\nl=3 miso\nkl ≲ ℓ−1/2siso\nk , and similarly for the other analogous terms indicated by\ndots. The last step in (6.16) is due to Nℓ > 1.\nCase (ii): Second, the key trick in [14, Section 5.2.2], the gain from summations described in [14, Exam-\nple 5.7], turns into the following. The trivial estimate, cf. [14, Eq. (5.36)], reads (again neglecting\nthe irrelevant |Ψk|p−1- and N ξ-factors)\nN 1/2\nsiso\nk\nX\n0≤kl≤k:\nP\nl kl=k\nh\f\f\u0000Mk1+1\n\u0001\nxei\n\u0000Mk2+1\n\u0001\nejej\n\u0000Mk3+1\n\u0001\neiei\n\u0000Mk4+1\n\u0001\nejej\n\u0000Mk5+1\n\u0001\neiy\n\f\f + ...\ni\n≲ N 1/2\nsiso\nk\nX\n0≤kl≤k:\nP\nl kl=k\n\" 5\nY\nl=1\nmiso\nkl\n!\n+ ...\n#\n≲ (Nℓ)1/2 ,\n(6.17)\nwhere we again used (6.14) multiple times. Analogously to [14, Eq. (5.37)], this can be improved\non by averaging over all replacement steps: Fixing one constellation of kl’s in (6.17), we find\nN 1/2\nsiso\nk\n1\nN 2\nX\ni,j\nh\f\f\u0000Mk1+1\n\u0001\nxei\n\u0000Mk2+1\n\u0001\nejej\n\u0000Mk3+1\n\u0001\neiei\n\u0000Mk4+1\n\u0001\nejej\n\u0000Mk5+1\n\u0001\neiy\n\f\f + ...\ni\n≲ (Nℓ)1/2 1\nN 2\nX\ni,j\n\"\f\f(Mk1+1)xei\n\f\f\nmiso\nk1\n+ ...\n#\n≲ (Nℓ)1/2\n1\nN 1/2 ≲ 1\n(6.18)\nin the relevant ℓ ≤ 1 regime (the opposite regime being covered by Proposition 6.4). To go to the\nsecond line, we employed (6.14). In the penultimate step, we used\nX\ni\n\f\f(Mk1+1)xei\n\f\f ≤\n√\nN\nq\u0000|Mk1+1|2\u0001\nxx ≲\n√\nN miso\nk1 ,\n(6.19)\nwhich follows by a Schwarz inequality, completely analogously to [14, Eq. (5.38)–(5.39)].\nWith these two slight adjustments, which rest on the estimates in (6.14), the proof in [14, Section 5.2]\ncan entirely be translated to our current setting in a straightforward way, so we omit further details. This\nconcludes the proof of Proposition 6.6.\n□\n6.2.2. Part (b): Proof of the averaged law, Proposition 4.4 (cf. Section 5.3 in [14]). For the averaged\nlaw, in addition to the bounds in (6.13)–(6.14), we will also use the relations\nmk ≲ miso\nk ,\nsk ≲ ℓ1/2 siso\nk ,\nand\nsiso\nk\n≲ N\n\u0002\n1 + (Nℓ)−1/2\u0003\nsk\n(6.20)\nfrom (A.11)–(A.12) in Lemma A.3 for all k ∈ N. Just as in the case of Section 6.2.1, there are two bits\nof the argument in [14, Section 5.3], that are not entirely straightforward to adjust to the setting of the\ncurrent paper (cf. Case (i) and Case (ii) in [14, Section 5.3]).\nAnalogously to the isotropic case in Section 6.2.1, while the terms considered in Case (i) solely use (6.14)\nand (6.20), the terms in Case (ii) require to gain from the summation over all steps in the replacement\nprocedure.\nOUT-OF-TIME-ORDERED CORRELATORS FOR WIGNER MATRICES\n25\nCase (i): First, consider [14, Eq. (5.54)] with d = 2 (for concreteness). Then, the estimate turns into\n(neglecting the irrelevant N ξ-factor)\n\u0012N\nsk\n\u00132 1\nN 2\nX\nk1+k2=k\nk′\n1+k′\n2=k\n\"\nmiso\nk1\nsiso\nk2\nN 1/2 miso\nk′\n1\nsiso\nk′\n2\nN 1/2 + miso\nk1 miso\nk2\nsiso\nk′\n1\nN 1/2\nsiso\nk′\n2\nN 1/2 + ...\n#\n≲\n\u0014\n1 + 1\nNℓ\n\u0015\n≲ 1 ,\nwhere we used (6.14) and (6.20) to bound miso\nk1 siso\nk2 ≲ ℓ−1/2[1 + (Nℓ)1/2]sk as well as miso\nk1 miso\nk2 ≲\n[1 + (Nℓ)1/2]sk and siso\nk′\n1 siso\nk′\n2 ≲ ℓ−1[1 + (Nℓ)1/2]sk in the penultimate step, and the last step used\nNℓ > 1.\nCase (ii): Second, we again discuss how to gain from the summation, as originally explained in [14, Ex-\nample 5.11]. The trivial estimate from [14, Eq. (5.55)], again neglecting the irrelevant |Ψk|p−1\nfactor and fixing one constellation of kl’s summing up to k, becomes (neglecting the irrelevant\nN ξ-factor)\n(sk)−1 h\f\f\u0000Mk1+1\n\u0001\neiei\n\u0000Mk2+1\n\u0001\nejej\n\u0000Mk3+1\n\u0001\neiei\n\u0000Mk4+1\n\u0001\nejej\n\f\f + ...\ni\n≲ (sk)−1\n\"Y\nl\nmiso\nkl + ...\n#\n≲ (Nℓ)1/2 ,\n(6.21)\nwhere we used (6.14) and (6.20). Analogously to [14, Eq. (5.59)], we can again improve upon\nthis by averaging over all replacement positions. The key for this gain from the summation is the\nbound\n⟨|Mk+1|2⟩ ≲ (sk)2\n∀k ∈ N ,\n(6.22)\nwhich can be obtained completely analogously to [14, Lemma 5.12]. Armed with (6.22), the analog\nof the improved bound [14, Eq. (5.59)] now reads (again neglecting the irrelevant N ξ-factor)\n(sk)−1 1\nN 2\nX\ni,j\nh\f\f\u0000Mk1+1\n\u0001\neiei\n\u0000Mk2+1\n\u0001\nejej\n\u0000Mk3+1\n\u0001\neiei\n\u0000Mk4+1\n\u0001\nejej\n\f\f + ...\ni\n≲(sk)−1\n\n Y\nl∈[4]\n \n1\nN\nX\ni\n\f\f\u0000Mkl+1\n\u0001\neiei\n\f\f2\n!1/2\n+ ...\n\n ≲ (sk)−1\n\n Y\nl∈[4]\nskl + ...\n\n ≲ 1 ,\n(6.23)\nwhere in the first step we employed a trivial Schwarz inequality.\nWith the above two slight adjustments at hand, which basically rest on the estimates in (6.14), (6.20)\nand (6.22), we can straightforwardly translate the entire proof of the averaged part in [14, Section 5.3] to\nour current setting. This finishes our discussion of the adjustments of the arguments from [14, Section 5.2]\nand thus the proof of Proposition 4.4.\n□\nAppendix A. Additional technical results\nIn this section we prove several additional technical results which were used in the main sections.\nA.1. Bound on the deterministic approximation:\nProofs of Lemmas 3.2 and 6.1. We will\ndeduce Lemmas 3.2 and 6.1 from the following stronger bound. Part (a) of Lemma A.1 is already proven\nin [14, Lemma A.1] applied to the special case Ik = ∅. The proof of part (b) is analogous to that and\nhence omitted.\nLemma A.1 (cf. Lemma A.1 in [14]). Fix k ≥ 1 and let A1, ..., Ak ∈ CN×N be traceless deterministic\nmatrices.\n(a) Consider spectral parameters z1, ..., zk ∈ C \\ R and define η := minj∈[k] |Im zj|. Then, for every\n1 ≤ s ≤ ⌊k/2⌋ and π ∈ NC([k]) with |π| = k + 1 − s, it holds that\n\f\f\f\f\f⟨pTrK(π)(A1, . . . , Ak−1)Ak⟩\nY\nS∈π\nm◦[S]\n\f\f\f\f\f ≲\n1\nηs−1\n\n\n\n\nY\nS∈K(π)\n|S|≥2\nY\nj∈S\n⟨|Aj||S|⟩\n1\n|S|\n\n\n\n .\n(A.1)\nwith m◦[S] being defined in (3.3). For s > ⌊k/2⌋ the lhs. of (A.1) equals zero.\n26\nCIPOLLONI, ERD ˝OS, AND HENHEIK\n(b) Consider spectral parameters z1, ..., zk+1 ∈ C \\ R and define η := minj∈[k+1] |Im zj|. Then, for\nevery 1 ≤ s ≤ ⌈(k + 1)/2⌉ and π ∈ NC([k + 1]) with |π| = k + 1 − s, it holds that\n\r\r\r\r\rpTrK(π)(A1, . . . , Ak)\nY\nS∈π\nm◦[S]\n\r\r\r\r\r ≲\n1\nηs−1\n\n\n\n\nY\nS∈K(π)\\B:\n|S|≥2\nY\nj∈S\n⟨|Aj||S|⟩\n1\n|S|\n\n\n\n\n\n\nY\nj∈B\\{k+1}\n∥Aj∥\n\n .\n(A.2)\nwhere B ≡ B(k + 1) ∈ K(π) being the unique block containing k + 1 (recall (3.1)). For s >\n⌈(k + 1)/2⌉ the lhs. of (A.2) equals zero.\nGiven Lemma A.1, analogously to [14, Appendix A.1], the proofs of Lemmas 3.2 and 6.1 immediately\nfollow after realizing that η ≳ ℓ and applying H¨older’s and Young’s inequality. To show this mechanism,\nconsider (A.1) for an example where k = 6 and s = 2, and focus on the non-crossing partition π =\n{15|2|3|4|6} for which K(π) = {1234|56}. In this case, the rhs. of (A.1) can be estimated as\nη−1\n 4\nY\ni=1\n⟨|Ai|4⟩1/4\n!  6\nY\ni=5\n⟨|Ai|2⟩1/2\n!\n≲ ℓ\n 4\nY\ni=1\n\u0002\n⟨|Ai|6⟩1/8ℓ−1/8\u0003 \u0002\n⟨|Ai|2⟩1/8ℓ−1/8\u0003\n!  6\nY\ni=5\n⟨|Ai|2⟩1/2ℓ−1/2\n!\n≲ ℓ\nY\ni∈[6]\n\u0012⟨|Ai|6⟩1/6\nℓ1/6\n+ ⟨|Ai|2⟩1/2\nℓ1/2\n\u0013\n.\nIn the first step, we employed η ≳ ℓ and H¨older’s inequality in the form ⟨|Ai|4⟩1/4 ≤ ⟨|Ai|6⟩1/8⟨|Ai|2⟩1/8\nfor i ∈ [4]. In the second step, we then used Young’s inequality for i ∈ [4] and added ⟨|Ai|6⟩1/6ℓ−1/6 for\ni = 5, 6 to complete the |||Ai|||6,ℓ norm for all i ∈ [6] (recall (3.5) and (3.7)).\n□\nA.2. GFT and isotropic local law: Additional proofs for Section 6.\nA.2.1. Isotropic law: Proof of Theorem 6.2. In this section we want to study chains of the form\n(G1A1 . . . AkGk+1)xy := ⟨x, G1A1 . . . AkGk+1y⟩,\n(A.3)\nfor unit deterministic vectors x, y.\nFollowing the notation (5.4), by G[1,k+1],t we denote the evolution of the quantity in (A.3) along the\nOrnstein-Uhlenbeck flow (4.1) with the characteristic equation (4.2). Then, by (5.3) and Lemma 5.5\n(used for k → k + 1), choosing Ak+1 = Nyx∗, we obtain the flow\nd(G[1,k+1],t − M[1,k+1],t)xy =\n1\n√\nN\nN\nX\na,b=1\n∂ab(G[1,k+1],t)xydBab,t + k\n2(G[1,k+1],t − M[1,k+1],t)xydt\n+\nk+1\nX\ni,j=1\ni<j\n⟨G[i,j],t − M[i,j],t⟩(M[1,i]∪[j,k+1],t)xydt\n+\nk+1\nX\ni,j=1\ni<j\n⟨M[i,j],t⟩(G[1,i]∪[j,k+1],t − M[1,i]∪[j,k+1],t)xydt\n+\nk+1\nX\ni,j=1\ni<j\n⟨G[i,j],t − M[i,j],t⟩(G[1,i]∪[j,k+1],t − M[1,i]∪[j,k+1],t)xydt\n+\nk+1\nX\ni=1\n⟨Gi,t − mi,t⟩(G(i)\n[1,k+1],t)xydt,\n(A.4)\nwhere we used the notation\n(G[1,i]∪[j,k+1],t)xy := (G1,tA1 . . . Ai−1Gi,tGj,tAj . . . Ak−1Gk+1,t)xy\nand similarly for M[1,i]∪[j,k+1],t.\nOUT-OF-TIME-ORDERED CORRELATORS FOR WIGNER MATRICES\n27\nDeterministic control quantities. Next, we introduce the new isotropic control quantities, the ana-\nlogues of the averaged quantities defined in (5.5) (recall (3.5) for the definition of |||Aα|||∞,ℓ):\nmiso\nk (ℓ; AJk) :=\nY\nα∈Jk\n|||Aα|||∞,ℓ\nand\nsiso\nk (ℓ; AJk) := ℓ−1/2 Y\nα∈Jk\n|||Aα|||∞,ℓ ,\n(A.5)\nwhich will be called the isotropic mean size and isotropic standard deviation size, respectively. They are\nfunctions of a positive number ℓ (usually given by ℓ = mini ηiρi for some spectral parameters zi) and a\nmultiset AJk = (Aα)α∈Jk of deterministic matrices of cardinality |Jk| = k.\nSimilarly to the paragraph below (5.5), we may often omit the arguments of miso\nk\nand siso\nk , write Jk\ninstead of AJk, and for time dependent spectral parameters we use the short–hand notations miso\nk (t) =\nmiso\nk (t; Jk) = miso\nk (ℓt; AJk) and siso\nk (t) = siso\nk (t; Jk) = siso\nk (ℓt; AJk). Note that with this definitions, by\n(6.2), we have (analogously to (5.6)), with ηt := mini ηi,t,\n\f\f(M[i,j],t)xy\n\f\f ≲ miso\nj−i(t)\nand\n\f\f(M[1,i]∪[j,k+1],t)xy\n\f\f ≲ η−1\nt\nmiso\nk−(j−i)(t) .\n(A.6)\nWe now record the following relations about miso\nk /siso\nk , analogously to Lemma 5.1. The proof is again\nan immediate consequence of (3.6) and ℓs ≳ ℓt for s ≤ t (recall the discussion below (4.5)) and hence\nomitted.\nLemma A.2 (miso/siso-relations). Let k ≥ 1 and consider time-dependent spectral parameters z1,t, ..., zk+1,t\nand a multiset of traceless matrices AJk as above. Set ℓt := minj∈[k+1] ηj,tρj,t. Then, the mean size miso\nk\nand the standard deviation size siso\nk\nsatisfy the following inequalities (using the conventions miso\n0 (t) := 1\nand siso\n0 (t) := ℓ−1/2\nt\n).\n(i) Super-multiplicativity; i.e. for any 0 ≤ j ≤ k it holds that\nmiso\nj (t; Jj) miso\nk−j(t; Jk−j) ≲ miso\nk (t; Jk)\nand\nsiso\nj (t; Jj) siso\nk−j(t; Jk−j) ≲ ℓ−1/2\nt\nsiso\nk (t; Jk)\n(A.7)\nfor all disjoint decompositions Jk = Jj ˙∪Jk−j.\n(ii) The mean size can be upper bounded by the standard deviation size as\nmiso\nk (t; Jk) ≲ ℓ1/2\nt\nsiso\nk (t; Jk) .\n(A.8)\n(iii) The standard deviation size satisfies the doubling inequality\nsiso\n2k (t; Jk ∪ Jk) ≲ ℓ1/2\nt\n\u0000siso\nk (t; Jk)\n\u00012 ,\n(A.9)\nwhere Jk ∪ Jk denotes the union of the multiset Jk with itself.\n(iv) Monotonicity in time: for any 0 ≤ s ≤ t and α ∈ [0, 1/2], we have\nmiso\nk (s; Jk) ≲ miso\nk (t; Jk)\nand\nsiso\nk (s; Jk) ℓα\ns ≲ siso\nk (t; Jk) ℓα\nt .\n(A.10)\nMoreover, we have the following relations among miso/siso and m/s from (5.5), whose proofs are again\nimmediate from (3.6) and hence omitted.\nLemma A.3 (miso/siso-m/s-relations). Let k ≥ 1, consider a multiset AJk of traceless matrices as above\nand fix ℓ > 0. Then, the mean sizes miso\nk\nand mk, and the standard deviation sizes siso\nk\nand sk, satisfy the\nfollowing inequalities.\n(i) The average sizes m/s are bounded by the isotropic sizes miso/siso:\nmk(ℓ; Jk) ≲ miso\nk (ℓ; Jk)\nand\nsk(ℓ; Jk) ≲ ℓ1/2 siso\nk (ℓ; Jk) .\n(A.11)\n(ii) The isotropic standard deviation size can be upper bounded by the average standard deviation size\nsiso\nk (ℓ; Jk) ≲ N\n\u0002\n1 + (Nℓ)−1/2\u0003\nsk(ℓ; Jk) .\n(A.12)\nStochastic control quantities. Consider deterministic vectors x, y ∈ CN with ∥x∥, ∥y∥ ≲ 1, traceless\nmatrices A1, . . . , Ak, and for k ≥ 1 define, analogously to (5.12)–(5.13),\nΨiso\nk (t) = Ψiso\nk (t; x, y; z[1,k+1]; A[1,k]) :=\nN 1/2\nsiso\nk (ℓt; A[1,k])(Nℓt)1/4\n\f\f(G[1,k+1],t − M[1,k+1],t)xy\n\f\f ,\nΦiso\nk (t) = Φiso\nk (t; x, y; z[1,k+1]; A[1,k]) :=\nN 1/2\nsiso\nk (ℓt; A[1,k])\n\f\f(G[1,k+1],t − M[1,k+1],t)xy\n\f\f ,\n(A.13)\n28\nCIPOLLONI, ERD ˝OS, AND HENHEIK\nwhere we denoted the multisets of deterministic matrices by A[1,k] and z[1,k+1] = (z1, ..., zk+1) with\nzi = zi,0 (initial condition), respectively. Note that by (1.4), using the convention siso\n0 (t) := ℓ−1/2\nt\n, we\nhave Φ0(t) ≺ 1, and that by (6.7) it follows\nΦiso\nk (0) ≺ 1,\n(A.14)\nfor any k ≥ 1. Similarly to the averaged case (see the two paragraphs around (5.12)–(5.13)), also in the\nisotropic case we introduced the two quantities in (A.13) as we will first prove Ψiso\nk (t) = Φiso\nk (t)/(Nℓt)1/4 ≺\n1 using the master inequalities in Proposition A.4, and then use this as an input to prove Φiso\nk (t) ≺ 1 in\nProposition A.5.\nProposition A.4 (Isotropic master inequalities). Fix k ∈ N, assume that Ψiso\nl (t) ≺ ψiso\nl , with ψiso\n0\n:= 1\nand Φl(t) ≺ 1 (with Φl(t) from (5.13)), for any 0 ≤ l ≤ k + 1(k odd) uniformly in t ∈ [0, T]. Then\nΨiso\nk (t) ≺ 1 +\nψiso\nk\n+ ψiso\nk+1(k odd)\n(NℓT )1/8\n+\nk−1\nX\nl=1\nψiso\nl\n(A.15)\nuniformly in t ∈ [0, T].\nAnalogously to Section 5, using Proposition A.4 we show that Ψiso\nk (t) ≺ 1 and then use this information\nas input to conclude Φiso\nk (t) ≺ 1:\nProposition A.5. Fix k ∈ N, assume that Φiso\nl (t) ≺ 1, for 0 ≤ l ≤ k − 2, Φl(t) ≺ 1 for 0 ≤ l ≤ k (with\nΦl(t) from (5.12)), and Φk(t) ≺ (Nℓt)1/4 for l ≤ 2k, uniformly in t ∈ [0, T]. Then\nΦiso\nk (t) ≺ 1\n(A.16)\nuniformly in t ∈ [0, T].\nClosing the hierarchy. We start showing that (A.15), using iteration as in Lemma 5.4, in fact implies\nΨk(t) ≺ 1. We start with k = 1, 2. By (A.15), we have\nΨiso\n1 (t) ≺ 1 + ψiso\n1\n+ ψiso\n2\n(NℓT )1/8 ,\nΨiso\n2 (t) ≺ 1 +\nψiso\n2\n(NℓT )1/8 + ψiso\n1 .\n(A.17)\nThen, by iteration, we obtain\nΨiso\n1 (t) ≺ 1 +\nψiso\n2\n(NℓT )1/8 ,\nΨiso\n2 (t) ≺ 1 + ψiso\n1 .\n(A.18)\nFinally, plugging the first inequality into the second one and using iteration once again we obtain Ψiso\n1 (t)+\nΨiso\n2 (t) ≺ 1.\nNext, we proceed by induction. Fix an even k ∈ N, and assume that Ψiso\nl (t) ≺ 1 for l ≤ k − 2, then by\n(A.15) we have\nΨiso\nk−1(t) ≺ 1 + ψiso\nk−1 + ψiso\nk\n(NℓT )1/8 ,\nΨiso\nk (t) ≺ 1 +\nψiso\nk\n(NℓT )1/8 + ψiso\nk−1.\n(A.19)\nProceeding exactly as in (A.17)–(A.18), by (A.19), we conclude that Ψiso\nl (t) ≺ 1 for any l ≤ k. Finally,\nusing that as a consequence of (Nℓt)1/4Φiso\nk (t) = Ψiso\nl (t) ≺ 1 the hypothesis of Proposition A.5 are\nsatisfied, we conclude that Φiso\nk (t) ≺ 1 and so the proof of Theorem 6.2.\n□\nA.2.2. Isotropic master inequalities: Proofs of Propositions A.4–A.5.\nProof of Proposition A.4. Note that the second term in the first line of (A.4) can be incorporated into\nthe lhs. by differentiating e−kt/2(G[1,k+1,t] − M[1,k+1,t])xy. The exponential factor ekt/2 ∼ 1 is irrelevant,\nwe thus neglect this term from the analysis. In the following we will often use the simple bound (5.2)\neven if not stated explicitly. Additionally, every time that two resolvents get next to each other in a chain\nwe use the integral representation (5.24) to reduce their number by one at the price of an additional\n1/η–factor (see e.g. (5.23)).\nWe now start with the computation of the quadratic variation of the martingale term in (A.4):\n1\nN\nk+1\nX\ni=1\n\u0002\nG[1,i],t(G[1,i],t)∗\u0003\nxx\n\u0002\n(G[i,k+1],t)∗G[i,k+1],t\n\u0003\nyy dt.\n(A.20)\nOUT-OF-TIME-ORDERED CORRELATORS FOR WIGNER MATRICES\n29\nSimilarly to the averaged case (see (5.27)–(5.31)), to estimate the quadratic variation of the martingale\nterm in (A.4) we rely on the following reduction inequality for k ∈ N even and j ≤ k (here for simplicity\nwe drop the indices of G’s and A’s):\n\f\f(G[1,k+j+1])xy\n\f\f ≲\n√\nN⟨|G|A(GA)j−1|G|(AG∗)j−1A⟩1/2\nY\nv∈{x,y}\n[(GA)k/2|G|(AG∗)k/2]1/2\nvv .\n(A.21)\nThe proof of (A.21) is postponed to the end of this section.\nRecall the conventions ψiso\n0\n= 1 and\nsiso\n0 (t) = ℓ−1/2\nt\n, then using (A.21) for j = k − 2i + 2, i ≤ k/2 for even k (and j = k − 2i + 1, i ≤ (k + 1)/2\nfor odd k) and then (A.8), (5.8), to bound (recall (5.28) in Footnote 16)\n\u0002\n(G[i,k+1],s)∗G[i,k+1],s\n\u0003\nyy ≺\n√\nN\n\u0012\nmiso\nk (s) + siso\nk (s)(Nℓs)1/4\n√\nN\n\u0013 \u0012\nℓsm2(k−2i+2)(s) + s2(k−2i+2)(s)\nN\n\u00131/2\n≲ siso\nk (s)\nq\ns2(k−2i+2)(s)ℓ1/2\ns\n\u0000p\nNℓt + (Nℓt)1/4ψiso\nk\n\u0001\n,\n(A.22)\nwe estimate each term of (A.20) by\n√\nN\nsiso\nk (t)(Nℓt)1/4\n \n1\nN\nk+1\nX\ni=1\nZ t\n0\n\u0002\nG[1,i],s(G[1,i],s)∗\u0003\nxx\n\u0002\n(G[i,k+1],s)∗G[i,k+1],s\n\u0003\nyy ds\n!1/2\n≺\n√\nN\nsiso\nk (t)(Nℓt)1/4\n ⌈k/2⌉\nX\ni=1\nZ t\n0\nsiso\nk (s)\nNη2s\n \nmiso\n2(i−1)(s) +\nψiso\n2(i−1)siso\n2(i−1)(s)(Nℓs)1/4\n√\nN\n!\n×\n\u0000p\nNℓs + ψiso\nk+1(k odd)(Nℓs)1/4\u0001q\nℓss2(k−i+1)(s) ds\n!1/2\n≲\n√\nN\nsiso\nk (t)(Nℓt)1/4\n\n\n⌈k/2⌉\nX\ni=1\nZ t\n0\nsiso\nk (s)siso\nk−i+1(s)siso\ni−1(s)\nNη2s\nℓ3/2\ns\n \n1 +\nψiso\n2(i−1)\n(Nℓs)1/4\n!\n\u0000p\nNℓs + ψiso\nk+1(k odd)(Nℓs)1/4\u0001\nds\n\n\n1/2\n≲ 1 +\n⌈k/2⌉\nX\ni=1\nq\nψiso\n2(i−1)\n(Nℓs)1/8 +\nq\nψiso\nk+1(k odd)\n(Nℓt)1/8\n+\n⌈k/2⌉\nX\ni=1\nq\nψiso\n2(i−1)ψiso\nk+1(k odd)\n(Nℓt)1/4\n.\n(A.23)\nHere in the second inequality (A.8)–(A.9), (A.11), and in the last inequality we used (A.7), (A.10).\nIn the following computations, when two G’s, with spectral parameters having imaginary parts of the\nsame sign appear next to each other (i.e. without a A in between), we use the integral representation\n(5.24) to reduce the number of G’s by one at the price of an additional 1/η. If the imaginary parts of\nthe spectral parameters have different signs, we use resolvent identity (see e.g. around (5.23)–(5.24) in\nthe averaged case). For the terms in the second line of (A.4) we estimate\n√\nN\nsiso\nk (t)(Nℓt)1/4\nZ t\n0\n⟨G[i,j],s−M[i,j],s⟩(M[1,i]∪[j,k+1],s)xy ds ≺\n√\nN\nsiso\nk (t)(Nℓt)1/4\nZ t\n0\nsj−i(s)\nNηs\nmiso\nk−j+i(s)\nηs\nds ≲\n1\n(Nℓt)3/4 ,\n(A.24)\nwhere we used (A.6)–(A.8), the second inequality in (A.11), and (A.10).\nFor the terms in the third line of (A.4) we estimate\n√\nN\nsiso\nk (t)(Nℓt)1/4\nZ t\n0\n⟨M[i,j],s⟩(G[1,i]∪[j,k+1],s − M[1,i]∪[j,k+1],s)xy ds\n≺\n√\nN\nsiso\nk (t)(Nℓt)1/4\nZ t\n0\nmj−i(s)\nηs\nsiso\nk−j+i(s)ψiso\nk−j+i(Nℓs)1/4\n√\nNηs\nds ≲ ψiso\nk−j+i,\n(A.25)\nwhere in the last inequality we used the first inequality of (A.11), (A.7)–(A.8).\n30\nCIPOLLONI, ERD ˝OS, AND HENHEIK\nFor the terms in the fourth line of (A.4) we estimate\n√\nN\nsiso\nk (t)(Nℓt)1/4\nZ t\n0\n⟨G[i,j],s − M[i,j],s⟩(G[1,i]∪[j,k+1],s − M[1,i]∪[j,k+1],s)xy ds\n≺\n√\nN\nsiso\nk (t)(Nℓt)1/4\nZ t\n0\nsj−i(s)\nNηs\nsiso\nk−j+i(s)ψiso\nk−j+i(Nℓs)1/4\n√\nNηs\nds ≲\n1\nNℓt\nψiso\nk−j+i,\n(A.26)\nwhere in the last step we used the second inequality of (A.11) and the second inequality of (A.7).\nFinally, for the term in the last line of (A.4) we estimate\n√\nN\nsiso\nk (t)(Nℓt)1/4\nZ t\n0\n⟨Gi,s − mi,s⟩(G(i)\n[1,k+1],s)xy ds ≺\n√\nN\nsiso\nk (t)(Nℓt)1/4\nZ t\n0\n1\nNηs\n\u0012miso\nk (s)\nηs\n+ siso\nk (s)ψiso\nk (Nℓs)1/4\n√\nNηs\n\u0013\nds\n≲\n1\n(Nℓt)3/4 + ψiso\nk\nNℓt\n,\n(A.27)\nwhere we used (A.6) and (A.8) together with (A.8). Combining (A.23)–(A.27), recalling that ⟨M[i,i+1],s⟩ =\n0 in (A.25), using (A.14) to bound Ψiso\nk (0) ≺ 1 and NℓT ≥ 1, ψiso\nl\n≥ 1, ℓt ≳ ℓT , we conclude (A.15).\n□\nProof of Proposition A.5. The proof of this proposition is analogous to the proof of Proposition A.5. All\nthe terms except for the martingale one are estimated as in the proof of Proposition A.5 after multiplying\neach line by (Nℓt)1/4 and setting ψiso\nl\n= 1. We conclude the proof pointing out that the only difference\nis in the estimate of the quadratic variation of the martingale term, i.e. (A.23) has to be replaced by\n√\nN\nsiso\nk (t)\n \n1\nN\nk+1\nX\ni=1\nZ t\n0\n\u0002\nG[1,i],s(G[1,i],s)∗\u0003\nxx\n\u0002\n(G[i,k+1],s)∗G[i,k+1],s\n\u0003\nyy ds\n!1/2\n≺\n√\nN\nsiso\nk (t)\n Z t\n0\nℓssiso\n2(i−1)(s)siso\n2k−2(i−1)(s)\nNη2s\nds\n!1/2\n≲ 1,\n(A.28)\nwhere in the first inequality we used the definition (A.13) together with (A.6), (A.8), and in the second\ninequality we used (A.7), (A.9)–(A.10).\n□\nProof of (A.21). By spectral decomposition we estimate\n\f\f(Q1G(z)Q2G(w)Q3)xy\n\f\f =\n\f\f\f\f\f\f\nX\nij\n⟨x, Q1ui⟩⟨ui, Q2uj⟩⟨uj, Q3uj⟩\n(λi − z)(λj − w)\n\f\f\f\f\f\f\n≲\n√\nN(Q1|G(z)|Q∗\n1)xx(Q∗\n3|G(w)|Q3)yy⟨|G(z)|Q2|G(w)|Q∗\n2⟩1/2,\n(A.29)\nwhere in the last inequality we used Schwarz inequality to separate Q2 from Q1, Q3. Choosing z = zk/2+1,\nw = zk/2+j+1, and\nQ1 = G1A1 . . . Ak/2,\nQ2 = Ak/2+1Gk/2+2 . . . Ak/2+j,\nQ3 = Ak/2+j+1Gk/2+j+2 . . . Gk+1,\nthis concludes the proof.\n□\nReferences\n[1] A. Adhikari, J. Huang. Dyson Brownian motion for general β and potential at the edge. Probability Theory and Related\nFields 178, 893–950 (2020).\n[2] A. Adhikari, B. Landon. Local law and rigidity for unitary Brownian motion. Probability Theory and Related Fields\n187.3, 753–815 (2023).\n[3] A. Aggarwal, J. Huang. Edge Rigidity of Dyson Brownian Motion with General Initial Data. arXiv: 2308.04236 (2023).\n[4] A. Bloemendal, L. Erd˝os, A. Knowles, H.-T. Yau, J. Yin. Isotropic local laws for sample covariance and generalized\nWigner matrices. Electronic Journal of Probability 19, 33, 1–53 (2014).\n[5] O. Bohigas, M.-J. Giannoni, C. Schmit. Characterization of chaotic quantum spectra and universality of level fluctuation\nlaws. Physical Review Letters 52, 1–4 (1984).\n[6] P. Bourgade. Extreme gaps between eigenvalues of Wigner matrices. Journal of the European Mathematical Society\n24, 2823–2873 (2021).\n[7] G. Cipolloni, L. Erd˝os, D. Schr¨oder. Eigenstate Thermalisation Hypothesis for Wigner matrices. Communications in\nMathematical Physics 388, 1005–1048 (2021).\nOUT-OF-TIME-ORDERED CORRELATORS FOR WIGNER MATRICES\n31\n[8] G. Cipolloni, L. Erd˝os, D. Schr¨oder. Thermalisation for Wigner matrices. Journal of Functional Analysis 282, 109394\n(2022).\n[9] G. Cipolloni, L. Erd˝os, D. Schr¨oder. On the Spectral Form Factor for Random Matrices. Communications in Mathe-\nmatical Physics 401, 1665–1700 (2023).\n[10] G. Cipolloni, L. Erd˝os, D. Schr¨oder. Optimal multi-resolvent local laws for Wigner matrices. Electronic Journal of\nProbability 27, 1–38 (2022).\n[11] G. Cipolloni, L. Erd˝os, D. Schr¨oder. Rank-uniform local law for Wigner matrices. Forum of Mathematics, Sigma 10,\nE96 (2022).\n[12] G. Cipolloni, L. Erd˝os, D. Schr¨oder. Mesoscopic central limit theorem for non-Hermitian random matrices. Accepted\nto Probability Theory and Related Fields, arXiv: 2210.12060 (2022).\n[13] G. Cipolloni, L. Erd˝os, J. Henheik, D. Schr¨oder. Optimal Lower Bound on Eigenvector Overlaps for non-Hermitian\nRandom Matrices. arXiv: 2301.03549 (2023).\n[14] G. Cipolloni, L. Erd˝os, J. Henheik. Eigenstate thermalisation at the edge for Wigner matrices. arXiv: 2309.05488\n(2023).\n[15] G. Cipolloni, L. Erd˝os, Y. Xu. Universality of extremal eigenvalues of large random matrices. arXiv: 2312.08325 (2023).\n[16] B. Collins, S. Matsumoto, J. Novak. The Weingarten Calculus. Notices of the American Mathematical Society 69, 5\n(2022).\n[17] J. Cotler, N. Hunter-Jones, J. Liu, B. Yoshida. Chaos, complexity, and random matrices. Journal of High Energy\nPhysics 2017, 48, 1–60 (2017).\n[18] J. M. Deutsch. Quantum statistical mechanics in a closed system. Physical Review A 43, 2046–2049 (1991).\n[19] L. Erd˝os, H.-T. Yau, J. Yin. Rigidity of eigenvalues of generalized Wigner matrices. Advances in Mathematics 229,\n1435–1515 (2012).\n[20] L. Erd˝os, A. Knowles, H.-T. Yau, J. Yin. The local semicircle law for a general class of random matrices. Electronic\nJournal of Probability 18, No. 59, 1–58 (2013).\n[21] L. Erd˝os, H.-T. Yau. A dynamical approach to random matrix theory. American Mathematical Society, Vol. 28 (2017).\n[22] L. Erd˝os, T. Kr¨uger, D. Schr¨oder. Random matrices with slow correlation decay. Forum of Mathematics, Sigma 7, E8\n(2019).\n[23] P. J. Forrester. Differential identities for the structure function of some random matrix ensembles. Journal of Statistical\nPhysics 183, 2, 33 (2021).\n[24] P. J. Forrester. Quantifying dip–ramp–plateau for the Laguerre unitary ensemble structure function. Communications\nin Mathematical Physics 387, 1, 215–235 (2021).\n[25] P. J. Forrester, M. Kieburg, S. H. Li, J. Zhang. Dip-ramp-plateau for Dyson Brownian motion from the identity on\nU(N). Accepted to Probability and Mathematical Physics, arXiv: 2206.14950 (2022).\n[26] E. M. Fortes, R. A. Jalabert, D. A. Wisniacki. Gauging classical and quantum integrability through out-of-time-ordered\ncorrelators. Physical Review E 100, 4, 042201 (2019).\n[27] I. Garc´ıa-Mata, R. A. Jalabert, D. A. Wisniacki. Out-of-time-order correlations and quantum chaos. Scholarpedia 18,\n4, 55237 (2023).\n[28] P. Hayden, J. Preskill. Black holes as mirrors: quantum information in random subsystems. Journal of High Energy\nPhysics 2007, 09, 120 (2007).\n[29] J. Huang, B. Landon. Rigidity and a mesoscopic central limit theorem for Dyson Brownian motion for general β and\npotentials. Probability Theory and Related Fields 175, 209–253 (2019).\n[30] A. Kitaev. Hidden correlations in the Hawking radiation and thermal noise. Talk at Breakthrough Prize Symposium\nYouTube (2014).\n[31] A. Knowles, J. Yin. The isotropic semicircle law and deformation of Wigner matrices. Communications on Pure and\nApplied Mathematics 66, 1663–1749 (2013).\n[32] G. Kreweras. Sur les partitions non crois´ees d’un cycle. Discrete mathematics 1, 333–350 (1972).\n[33] B. Landon, P. Sosoe. Almost-optimal bulk regularity conditions in the CLT for Wigner matrices. arXiv: 2204.03419\n(2022).\n[34] M. Lemm, S. Rademacher. Out-of-time-ordered correlators of mean-field bosons via Bogoliubov theory. arXiv:\n2312.01736 (2023).\n[35] L. Leviandier M. Lombardi, R. Jost, J. Pique. Fourier transform: A tool to measure statistical level properties in very\ncomplex spectra. Physical Review Letters 56, 2449–2452 (1986).\n[36] D. Markovi´c, M. ˇCubrovi´c. Detecting few-body quantum chaos: out-of-time ordered correlators at saturation. Journal\nof High Energy Physics 2022, 5, 1–28 (2022).\n[37] S. Pappalardi, F. Fritzsch, T. Prosen. General Eigenstate Thermalization via Free Cumulants in Quantum Lattice\nSystems. arXiv: 2303.00713 (2023).\n[38] J. Reker. Multi-Point Functional Central Limit Theorem for Wigner Matrices. arXiv: 2307.11028 (2023).\n[39] J. Reker. Fluctuation Moments for Regular Functions of Wigner Matrices. arXiv: 2307.11029 (2023).\n[40] Y. Sekino, L. Susskind. Fast scramblers. Journal of High Energy Physics 2008,10, 065 (2008).\n[41] S. Xu, B. Swingle. Scrambling Dynamics and Out-of-Time-Ordered Correlators in Quantum Many-Body Systems.\nPRX Quantum 5, 1, 010201 (2024).\n"
}