{
    "optim": "1\nCSI-Free Optimization of Reconfigurable Intelligent Surfaces with\nInterference by Using Multiport Network Theory\nAndrea Abrardo Senior Member, IEEE\nAbstract—Reconfigurable Intelligent Surfaces (RIS) will play a\npivotal role in next-generation wireless systems. Despite efforts to\nminimize pilot overhead associated with channel estimation, the\nnecessity of configuring the RIS multiple times before obtaining\nreliable Channel State Information (CSI) may significantly di-\nminish their benefits. Therefore, we propose a CSI-free approach\nthat explores the feasibility of optimizing the RIS for the\nuplink of a communication system in the presence of interfering\nusers without relying on CSI estimation but leveraging solely\nsome a priori statistical knowledge of the channel. In this\ncontext, we consider a multiport network model that accounts\nfor several aspects overlooked by traditional RIS models used\nin Communication Theory, such as mutual coupling among\nscattering elements and the presence of structural scattering.\nThe proposed approach targets the maximization of the average\nachievable rate and is shown to achieve performance that, in\nsome cases, can be very close to the case where the RIS is\noptimized leveraging perfect CSI.\nIndex Terms—Reconfigurable intelligent surface, Multi-user\nuplink communications, CSI-free optimization, structural scat-\ntering, mutual coupling, optimization.\nI. INTRODUCTION\nReconfigurable Intelligent Surfaces (RIS) are considered\na pivotal technology for enabling the concept of the smart\nradio environment in the context of next-generation wireless\nsystems, particularly those operating at mmWave frequencies\nor even higher [1]–[4]. In a smart radio environment, the\nwireless system goes beyond conventional communication de-\nvice parameters, with the environment itself (e.g., the channel)\nbecoming a variable that can be optimized [5]–[7]. In RIS-\naided communications, precise estimation of the cascaded\nchannel (from the UE to RIS and from the RIS to the BS)\nis essential for effective phase-shift design and harnessing\nthe benefits offered by RIS technology. However, this task\nis complex, mainly attributed to the passive characteristics\nof the RIS and the complexities posed by high-dimensional\nchannels [8]–[10]. Indeed, since all RIS elements are passive,\ni.e., they cannot transmit, receive, or process any pilot signal,\nCSI estimation can only be performed by a central controller\n(e.g., the BS) at the expenses of a huge overhead needed\nto estimate the channel with respect to standard MIMO\nsystems. Accordingly, CSI estimation has been the subject of\nseveral studies in recent years, with the goal of minimizing\nA. Abrardo is with the University of Siena and CNIT, Italy (e-mail:\nabrardo@unisi.it). The work is supported by the 6G SHINE European\nproject. I would like to express my sincere gratitude to Professor Marco\nDi Renzo and Professor Alberto Toccafondi for their invaluable contributions\nto this work. The collaboration with Marco Di Renzo in several past and\npresent research activities in the field of RIS modeling and optimization\nhas been instrumental in shaping the direction of this research. The support\nof Alberto Toccafondi allowed to enrich my understanding and expertise in\nelectromagnetic modeling.\nthe number of pilot RIS configurations required for accu-\nrate estimation [11]–[14]. The presence of electromagnetic\ninterference, which cannot be ignored, particularly with very\nlarge RIS surfaces, can further complicate the CSI problem if\nappropriate countermeasures are not implemented, as shown\nin [15], [16].\nDespite efforts to minimize pilot overhead associated with\nchannel estimation, the need to configure the RIS multiple\ntimes before obtaining reliable CSI may significantly dimin-\nish their benefits, especially if the number of individually\nreconfigurable elements is excessively large or if an inefficient\nchannel estimation algorithm is utilized [17], [18]. Further-\nmore, considering the dynamic nature of the wireless channel\nand user mobility, reconfiguring a RIS within a timescale\naligned with the coherence time of the environment (e.g., the\nchannel) can be challenging, particularly in highly dynamic\nenvironments [3].\nTo address these open research issues, some authors have\nrecently delved into research on RIS-aided systems that do\nnot strictly depend on perfect CSI knowledge, e.g., see [17],\n[19]–[23]. Specifically, in [19], the phase shifts of the RIS\nand the transmit beamforming/precoding vector at the ac-\ncess point are optimized using a two-timescale beamforming\noptimization algorithm. The RIS is optimized based on the\nstatistical CSI of all links, which is operated on a long time-\nscale, effectively reducing the CSI overhead. Simultaneously,\nthe transmit beamforming/precoding vectors at the access\npoint are designed based on the instantaneous CSI of the\neffective channels, given the optimized RIS configuration.\nFollowing a different direction, in [17], [20], the RIS design is\nconducted offline assuming a priori statistical knowledge of\nUE locations. This involves a two-phase optimization process,\nencompassing an offline phase (long-term and sporadic) and\nan online phase (short-term and more frequent). During the\nonline phase, communication between the BS and the UEs\nis optimized without interaction with the RISs. The key\nadvantage of this approach is that information necessary\nfor RIS optimization can either be known beforehand (e.g.,\nknowledge of UEs confined within a specific area) or can\nbe occasionally learned during system operation, leveraging a\nlocalization infrastructure.\nIn all the previously mentioned works, and in the majority\nof works addressing RIS optimization for communications\nand/or CSI estimation, a RIS is characterized as a planar array\ncomprising a given number of reflective elements strategically\npositioned at sub-wavelength intervals. The impedance of each\nelement can be finely adjusted to introduce a controllable\nphase-shift to the incident wave before reflecting it. By\noptimizing the phase-shift pattern across the RIS, it becomes\npossible to manipulate the reflected wavefront, directing it\narXiv:2402.17651v1  [cs.IT]  27 Feb 2024\n2\ninto a beam aimed at the intended receiver. These models\nare not always electromagnetically consistent, since they do\nnot consider several aspects that play an important role in\ncharacterizing the operation of a realistic RIS [24]–[26].\nRecent results highlight, in fact, the critical need of using\nrealistic reradiation models [27], which result in a strong in-\nterplay between the surface-level optimization of RISs and the\nelement-level design of the RIS elements [28]. In this context,\nmultiport network theory has been proved to be a suitable\napproach for modeling and optimizing RIS-aided channels\n[29]. The motivation for using multiport network theory lies in\nits inherent capability of modeling the electromagnetic mutual\ncoupling between closely-spaced radiating elements, which is\na key distinguishing feature of RISs, especially for realizing\nadvanced wave transformations at a high power efficiency\n[30]–[32].\nThe first multiport model for RIS-aided channels was\nintroduced in [33], assuming a minimum scattering radiating\nelement configuration. The model employed thin wire dipoles\nas scattering elements for analytical tractability, aligning with\nthe discrete dipole approximation [34]. A similar model based\non the coupled dipoles formalism is presented in [35]. The\ndistinctive feature of the communication model in [33] is its\nnon-linearity, arising from the tunable impedances, leading\nto a system response affected by electromagnetic mutual\ncoupling between closely spaced RIS elements. Subsequently,\nthis multiport model has been applied in various works consid-\nering different communication scenarios, such as Single-Input\nSingle-Output (SISO), Multiple-Input Single-Output (MISO),\nand Multiple-Input Multiple-Output (MIMO), and different\nchannel models [17], [36]–[42].\nIn two recent works [43], [44], an easily applicable mul-\ntiport network model is proposed, based on the S and Z\nparameters representation of the network. This model re-\nveals the approximations inherently considered in classical\nRIS models used in communication theory that assume the\nRIS as an ideal scatterer. These classical models overlook\nthe effects of: (i) electromagnetic mutual coupling between\nscattering elements; (ii) correlation between the phase and\namplitude of the reflection coefficient; (iii) the presence of\na structural scattering component, leading to an unwanted\nspecular component of the reflected wavefront.\nIn all these works dealing with multiport network models,\nthe channel is assumed to be perfectly known at the central\ncontroller, and RIS optimization is carried out accordingly.\nA. Contribution\nIn this work, we adopt the CSI-free approach, exploring the\nfeasibility of optimizing the RIS without relying on CSI esti-\nmation. Similar to other works proposing methods for cascade\nchannel estimation, such as [9], [16], and [45], we presume\na priori statistical knowledge of the channel, specifically the\ncorrelation matrix. The two main novel contributions of this\nwork are listed below.\n• Instead of utilizing the knowledge of the channel correla-\ntion matrix to develop an efficient channel estimation, we\nemploy it directly for RIS optimization, as proposed in\n[19], [17], and [20]. However, unlike these works, we do\nnot rely on a Monte Carlo approach for RIS optimization,\nwhich can be computationally very intensive. Instead, we\nemploy an approach that optimizes the RIS directly based\nsolely on the correlation matrix of the channel. This\napproach is generalized to accommodate the presence\nof a certain number of interferers in the form of other\ntransmitting nodes.\n• The proposed approach fot CSI-free RIS optimization\nleverages the multiport network model proposed in [44].\nAs discussed earlier, this model allows for a more real-\nistic characterization of the RIS compared to the ideal\nmodels considered so far in the field of CSI estimation\nor CSI-free RIS optimization.\nThe offline CSI-free RIS optimization proposed in this paper\nis carried out assuming that in the channel between the Base\nStation (BS) and the RIS, the presence of natural scattering\ncan be neglected and that the BS and the RIS are positioned\nin fixed and known locations. The first assumption arises\nfrom the consideration that the BS and the RIS can, in many\ncases, be optimally deployed to have a very strong Line-of-\nSight (LOS) component. However, in the model considered\nfor simulations, we will take into account the presence of\nmultipath also in the BS-RIS link. In the Results section,\nwe will demonstrate the validity of the proposed approach\nand how the CSI-free approach allows for achieving good\nperformance in terms of achievable throughput in an uplink\ncommunication scenario. It is also demonstrated how the\nuse of simplified models that assume the Reconfigurable\nIntelligent Surface (RIS) as an ideal scatterer results in a\nsignificant performance loss due to model mismatch.\nB. Paper Outline and Notation\nThe rest of this paper is organized as follows. In Sec-\ntion II, we introduce the model adopted for the system,\nincluding the propagation models and the communication\nscenario. In Section III, the multiport network model for the\nReconfigurable Intelligent Surface (RIS) characterization is\nproposed. In Section IV, we provide an iterative algorithm\nwith provable convergence that allows carrying out the CSI-\nfree RIS optimization. Numerical results are presented in\nSection V, while conclusions are drawn in Section VI.\nNotation: Unless otherwise specified, matrices are denoted\nby bold uppercase letters (i.e., X), vectors are represented by\nbold lowercase letters (i.e., x), and scalars are denoted by\nnormal font (i.e., x). (·)T, (·)H and (·)−1 stand for the trans-\npose, Hermitian transpose and inverse of the matrices. The\nsymbol ⊙ represents the Hadamard (element-wise) product\nwhile with diag (x) we mean the diagonal matrix obtained\nfrom the element of vector x. The notation ||x|| signifies\nthe Euclidean norm of the vector x, and E{·} represents the\nstatistical expectation.\nII. SYSTEM MODEL\nWe consider a wireless scenario with Nu single-antenna\nUEs that must establish a communication link with an N-\nelement BS. The BS antennas are arranged in a uniform planar\n3\nFig. 1: RIS-aided communication system.\narray (UPA) with NH rows and NV columns, resulting in\nN = NHNV . In this environment, a Reconfigurable Intelli-\ngent Surface (RIS) is present with the goal of supporting the\ncommunication of one of the UEs, referred to as the reference\nuser. The RIS is equipped with M passive reconfigurable\nelements, forming a UPA with MH rows and MV columns,\nwhere M = MHMV . Without loss of generality, we assume\nthat the first UE serves as the reference user. Hence, in the\nconsidered scenario, the objective of the RIS is to maximize\nthe rate of the first UE, while users i, where i = 2, . . . , Nu,\nact as interferers.\nSince we are interested in finding the optimal Reconfig-\nurable Intelligent Surface (RIS) configuration, we neglect in\nwhat follows the direct links between the User Equipments\n(UEs) and the Base Station (BS) that are not under the control\nof the RIS. On the other hand, as discussed in most previous\nworks on RIS, e.g., see [17], [46], [47], in the presence of\na strong BS-UE direct link, the impact and contribution of\nthe RISs are usually not very significant. Hence, optimizing\nthe RISs to take into account this possibility typically has no\nsignificant benefit.\nAccordingly, denoting by ti ∈ CM×1 the channel between\nUE i and the RIS, and by S ∈ CN×M the channel between the\nRIS and the BS, we can express the received vector y ∈ CN×1\nas follows:\ny = S∆(z)\nNu\nX\ni=1\ntisi + n.\n(1)\nHere, ∆(z) ∈ CM×M is the RIS reflecting matrix, dependent\non a vector z ∈ CM×1 of tunable parameters, si represents\nthe transmitted symbol by UE i, and n ∈ CN×1 is the thermal\nnoise with variance σ2\nn.\nConcerning the matrix S, it is assumed to be perfectly\nknown from the network deployment. On the other hand, the\nBase Station (BS) and the Reconfigurable Intelligent Surface\n(RIS) are typically in fixed positions and arranged to establish\na strong LOS that depends solely on their respective positions.\nTherefore, the channel can be assumed to be deterministic and\nknown. In the model considered for simulations, we will take\ninto account the presence of a certain amount of multipath in\nthe BS-RIS link, showing that this presence does not impact\nthe validity of this assumption, provided, of course, that the\nLOS component overwhelms the scattering component.\nConversely, the channels ti are not known to the BS,\nand for this reason, the optimization of the Reconfigurable\nIntelligent Surface (RIS) requires either a direct estimation or\nprior knowledge of certain statistical parameters characteriz-\ning these channels. This latter approach is considered in this\npaper as it avoids the heavy overhead of channel estimation,\nas discussed in Section I. In particular, we assume to know\nthe correlation matrices:\nRti = E\n\u0000titH\ni\n\u0001\n(2)\nwith i = 1, . . . , Nu and we denote by x = t1s1, the intended\nsignal, and by wi = tisi, with i > 1 the interfering users.\nThen we introduce:\nRx = E\n\u0000xxH\u0001\n= σ2\n1Rt1\nRwi = E\n\u0000wiwH\ni\n\u0001\n= σ2\ni Rti\ni = 2, . . . , Nu\n(3)\nwhere σ2\ni\n=\nE\n\u0000|si|2\u0001\nis the transmitted power of the\ni-th UE. It is worth noting that this assumption is often\nemployed\nto\nsupport\nChannel\nState\nInformation\n(CSI)\nestimation in previous works, such as [20], [48], [49]. In our\npaper, we utilize this a-priori information to optimize the\nReconfigurable Intelligent Surface (RIS) without involving\nany channel estimation phase.\nIII. RIS MODELS\nA. Communication Theory (CT) Model\nThe model traditionally used to characterize RIS and inte-\ngrate them into a communication system is to represent them\nas surfaces composed of ideal scatterers capable of imparting\na phase shift on the impinging signal. This model, which\nwe will refer to as the Communication Theory model (CT)\nhereafter, can be represented by a diagonal reflection matrix\nwith elements:\n[∆CT (z)]m,m = K0Γm\n(4)\nwhere K0 is a constant depending on the geometry of the\nscatterer, and Γm = ejϕm is the load reflection coefficient\nwhich can be changed by acting on the tunable parameter\nzm.\nB. Multiport Network (MP) Model\nReferring to the multiport Z-parameters representation of\nan end-to-end channel matrix involving an RIS presented in\n[43], we have:\n∆MP (z) = −2Y0(ZSS + r0IM + ZR)−1.\n(5)\nHere, ZSS\n∈ CM×M represents the matrix of self and\nmutual impedances of the RIS, ZR = diag(z) where z are\ntunable impedances connected at the RIS ports, r0 is a small\nparasitic resistance, IM is the identity matrix, and Y0 is a\nreference admittance which depends, among other factors, on\nthe reference impedance Z0. For simplicity, it is assumed that\nZ0 is the same for all ports and equal to Z0 = 50Ω. Note\nthat (5) has dimensions of Ω−2, which is consistent with\n4\nthe fact that when using the Z-parameter representation of\nthe multiport, S and ti in (1) are impedance matrices with\ndimensions of Ω.\nC. Comparison between CT and MP models\nThe CT model in (4) can be seen as a particular case of the\nmore general MP model in (5), as broadly discussed in [43]. It\nis indeed straightforward to derive the CT model from the MP\none my making the following assumptions. First we neglect\nthe parasitic resistance r0 and impose ZSS = Z0IM. In this\nmanner, beyond ignoring the mutual coupling, the scattering\nmatrix of the RIS becomes zero, and the effect of the RIS is\nsolely to introduce a pure phase shift to the incident signal.\nThis simplified model is denoted by ideal Multi-Port (iMP)\nwhich, from (5), yields a diagonal RIS reflection matrix with\nelements:\n[∆iMP (z)]m,m = −2Y0(Z0 + zm)−1.\n(6)\nHence, it is easy to verify that:\n∆iMP (z) = ∆CT (z) − Y0\nZ0\nIM,\n(7)\nwhen K0 = Y0\nZ0 and Γm(zm) = jbm−Z0\njbm+Z0 . The above equation\nallows to shed light on a third important approximation which\nis inherent in the CT model, in which ∆S = − Y0\nZ0 IM is\nnot considered. This term corresponds to the scattered signal\nobtained when the the RIS is terminated with impedances\nzm = Z0, i.e., when the load reflection coefficient is zero,\nand hence the CT model would entails zero scattered energy.\nThis structural component causes the RIS to behave like a\nscatterer that does not introduce any phase shift on the incident\nsignal, thereby introducing a specular component that, as we\nwill see, cannot be ignored without significantly deteriorating\nperformance in certain situations.\nIV. RIS OPTIMIZATION\nA. Problem Formulation\nFrom now on, we will consider the case where the RIS\nis terminated with a purely reactive impedance, which is the\ncase of interest where we have maximum signal reflection.\nTherefore, we consider z = jb. For simplicity, we denote\n∆(b) = ∆(jb). Hence, denoting by Φ = S∆(b) and\nemphasizing the effect of the intended UE with respect to\nthe others, we can rewrite (1) as follows:\ny = Φx + Φ\nNu\nX\ni=2\nzi + n.\n(8)\nThe BS estimates the transmitted signal s1 by using the\ncombining vector v ∈ CN×1 to obtain:\nˆs1 = vHy = vHΦx + vHΦ\nNu\nX\ni=2\nzi + vHn.\n(9)\nConsidering the worst-case bound for the evaluation of the\nrate based on the assumption of uncorrelated additive noise\ngiven in [50], we can write the following expression for the\nergodic achievable uplink rate:\nR = Ex [log2 (1 + γ(x, Φ))]\n(10)\nwhere Ex is the expectation with respect to x and\nγ(x, Φ) =\nvHΦxxHΦHv\nE\n\u0012Nu\nP\ni=2\nvHΦzizH\ni ΦHv + vHvσ2n\n\u0013\n(11)\n=\nvHΦxxHΦHv\nvH\n\u0012\nΦ\nNu\nP\ni=2\nRwiΦH + σ2nIN\n\u0013\nv\nIn order to provide a CSI-free RIS design, the RIS could\ntherefore be designed with the aim of maximizing:\nZ\nw\nγ(w, Φ)fx(w)dw\n(12)\nWhere fx(w) is the probability density function (pdf) of x,\ni.e., aimed at maximizing the average rate. This approach has\nalready been proposed in previous works, for example, see\n[51] and [17], for traditional RIS models. However, it has the\ndrawback of requiring knowledge of the full channel statistics.\nMoreover, since the integral in (12) cannot be evaluated in\nclosed form, it is necessary to rely on a Monte Carlo approach.\nTo overcome these challenges, we consider the upper bound\nRb ≥ R derived from the concavity of the logarithm function,\nwhere:\nRb = log2 {1 + Ex [γ (x, Φ)]} .\n(13)\nFrom (11) we have:\nEx [γ (x, Φ)] =\nvHΦRxΦHv\nvH\n\u0012\nΦ\nNu\nP\ni=2\nRwiΦH + σ2nIN\n\u0013\nv\n(14)\nfor which it is only necessary to know the channel correlation.\nTo further elaborate, we are then in the position to formulate\nthe optimal CSI-free RIS design as:\nb∗ = arg max\nb\nvHΦ(b)RxΦ(b)Hv\nvHΦ(b)\nNu\nP\ni=2\nRwiΦ(b)Hv + vHvσ2n\n(15)\ns.t. Φ ∈ F\nwhere the feasible set\nF = {Φ ∈ C1×M|Φ = S∆(b)}\n(16)\nenforces the multiport network model, where b represents\nthe tunable reactances of the RIS, i.e., b ∈ RM. To further\nelaborate, we first observe that problem (15) is not convex\nin b. Hence, we provide in the following an alternative\nformulation of the same problem which allows to get a local\noptimum.\nFirst, to reduce the dimension of the problem we consider\nthe eigen-decomposition Rx = UDUH and denote by r the\nrank of Rx. Then, we denote by r ∈ Cr×1 a vector of i.i.d.\nGaussian random variables with r ∼ N(0, Ir). Observing that\n5\nUD\n1\n2 r and x have the same correlation matrix, we rewrite\n(8) as:\ny = ΦUD\n1\n2 r + Φ\nNu\nX\ni=2\nzi + n.\n(17)\nThe linear minimum mean square error (LMMSE) estimator\nof r from vHy is the linear filter Λ ∈ Cr×1 designed to\nminimize the mean square error (MSE) between the vector r\nand its MMSE estimate ˆr = ΛvHy, i.e.,\nEr = E\nn\r\rΛvHy − r\n\r\r2o\n.\n(18)\nThe linear estimator that minimizes (18) is then given by:\nΛ(Φ)=\nD\n1\n2 UHΦHv\nvH\n\u0012\nΦRxΦH + Φ\nNu\nP\ni=2\nRwiΦH + σ2nIN\n\u0013\nv\n, (19)\nwhere Λ(Φ) ∈ Cr×1 depends on the RIS phase-shift matrix\nΦ. Substituting (19) into (18) yields:\nEr(Φ) = tr\n\u0010\nIr − Λ(Φ)vHΦUD\n1\n2\n\u0011\n.\n(20)\nDenoting s = D\n1\n2 UHΦHv, from (19), (20) can be written\nas:\nEr(Φ) = tr\n\n\n\n\nIr −\nssH\nvH\n\u0014\nΦ\n\u0012\nRx +\nNu\nP\ni=2\nRwi\n\u0013\nΦH + σ2nIN\n\u0015\nv\n\n\n\n\n\n= r −\nsHs\nvH\n\u0014\nΦ\n\u0012\nRx +\nNu\nP\ni=2\nRwi\n\u0013\nΦH + σ2nIN\n\u0015\nv\n= r − 1 +\n1\nEx [γ (x, Φ)] + 1\n(21)\nThus, problem (15) is equivalent to:\nb∗ = arg min\nb Er(Φ(b))\n(22)\ns.t. Φ ∈ F\nIn other words, the optimal design of the Reconfigurable In-\ntelligent Surface (RIS), aimed at maximizing the ergodic rate\nfor a given combining vector v without channel estimation,\nis equivalent to the optimal RIS design for minimizing the\nestimation error of the channel based on a single observation\nof the received signal obtained using the same combining\nvector v. This equivalence holds particularly when channel\nestimation employs a Linear Minimum Mean Squared Error\n(LMMSE) estimator.\nProblem (22) is still not convex in b. To address the solution\nof (22), we make a simplifying assumption, neglecting the fact\nthat Λ(Φ) depends on the value of Φ. Hence, we express the\nobjective function of (22) as\nEr(Φ) = Er(Λ, Φ(b)),\n(23)\nas if Λ and Φ were independent variables. Under this hypoth-\nesis, (22) can be solved by following an alternating optimiza-\ntion (AO) approach. The AO is an iterative algorithm whose\nkey advantage is that it simplifies the optimization process\nby breaking it into smaller subproblems, which are easier to\nsolve. The AO approach is especially helpful when the original\nproblem involves complicated interactions or dependencies\namong the variables. In particular, we propose a two-step\niterative algorithm, where Er is alternatively optimized with\nrespect to Λ and Φ. Being Λ(k) and Φ(k) the values found\nat iteration k, at iteration k + 1 we proceed as follows:\n1) Having fixed the value of Φ = Φ(k), we minimize\n(23) by computing Λ(k+1) as Λ(Φ) in (19). This\noptimization is unconstrained and is a straightforward\napplication of MSE minimization;\n2) Fixing the value of Λ as Λ(k+1), the MSE takes the\nexpression given in (24) and Er(Λ, Φ) is now a convex\nfunction of Φ. The RIS phase-shift matrix is computed\nas the solution of the minimization\nΦ(k+1) = arg min\nΦ\nEr\n\u0010\nΛ(k+1), Φ\n\u0011\n,\ns.t. Φ ∈ F.\n(25)\nRegarding the convergence of the proposed technique we\ncan observe that, since in both steps we minimize the MSE,\nat each iteration the MSE either decreases or reaches a\npoint where it remains unchanged. Given that the MSE is\na positive value, the procedure will ultimately converge to a\nlocal optimum.\nB. Solution of (25)\n1) Solution for the MP case: The main difficulty posed\nby (25) is the nonlinearity of Φ(b) = S∆(b), where ∆(b)\nis defined in (5). To elaborate, for the sake of notation\nconvenience, let us introduce Q and q ∈ Cr×1 as:\nQ = vH\n \nΦ(b)\n \nRx +\nNu\nX\ni=2\nRwi\n!\nΦH(b) + σ2\nnIN\n!\nv\nq = vHΦ(b)UD\n1\n2\n(26)\nIt is then easy to show that:\nEr\n\u0010\nΛ(k+1), Φ(b)\n\u0011\n=\n\r\r\rΛ(k+1)\r\r\r\n2\nQ−2ℜ\nr\nX\nj=1\nh\nΛ(k+1)\nj\nqj\ni\n+ r.\n(27)\nThe proposed approach to RIS optimization utilizes the Neu-\nmann series approximation to linearize the matrix inverses for\nsmall variations of the solution, similar to traditional Z-matrix-\nbased approaches (see, e.g., [36]). However, as demonstrated\nin [44], working with the phase of the reflection coefficients\nrather than directly with the tunable reactances b leads to\nbetter performance in terms of algorithm convergence. For\nfurther clarification, when neglecting the parasitic resistance\nr0, the reflection coefficient Γm of the m-th port of the RIS\nbecomes a pure phase shift, i.e., Γm = ejϕm, and we can\n6\nexpress it as:\nΓm =jbm − Z0\njbm + Z0\n→ bm = Z0\nj\n1 + ejϕm\n1 − ejϕm\ndbm\ndϕm\n= 2Z0\nejϕm\n(ejϕm − 1)2 =\n(28)\n2Z0\njbm − Z0\n(jbm + Z0)\n\u0010\njbm−Z0\njbm+Z0 − 1\n\u00112 = −b2\nm + Z2\n0\n2Z0\nHence, denote by B(k) = diag\n\u0000b(k)\u0001\nand ϕ(k) the tunable re-\nactances matrices and the corresponding reflection coefficient\nphase vector at iteration k of the iterative algorithm. Consider-\ning small variations of ϕ(k) for evaluating the solution at next\nstep, i.e., ϕ(k+1) = ϕ(k) + δ, with δ ∈ C1×M and δm << 1,\nwe have:\nB(k+1) ≈ B(k) + F(k)diag (δ)\n(29)\nwhere F(k) ∈ CM×M is a diagonal matrix with entries\nF(k)\nm,m = −(b(k)\nm )\n2+Z2\n0\n2Z0\n.\nSince Φ = S∆(b), from (5) and (26) we have:\nQ = 4Y 2\n0 vH\n(\nS(ZSS + r0 + jB)−1\n \nRx +\nNu\nX\ni=2\nRwi\n!\n(30)\n×\n\u0002\nS(ZSS + r0 + jB)−1\u0003H + σ2\nnIN\no\nv\nq = −2Y0vHS(ZSS + r0 + jB)−1UD\n1\n2 .\nFrom (29) we have:\nS(ZSS + r0 + jB(k+1)−1\n(31)\n= S(ZSS + r0 + jB(k) + jF(k)diag (δ))−1,\nWe then introduce the following terms:\nA(k) =\n\u0010\nZSS + r0 + jB(k)\u0011−1\n(32)\nG(k) = jSA(k)F(k).\nInvoking the Neumann series approximation for matrix inver-\nsion, we have:\nS(ZSS + r0 + jB(k+1))−1 ≈ SA(k) − G(k)diag (δ) A(k)\n(33)\nwhere the approximation holds when:\n\r\r\r\rF(k)diag (δ)\n\u0010\nZSS + r0 + jB(k)\u0011−1\r\r\r\r ≤ ϵ\n(34)\nwith ϵ << 1. Denoting by P = F(k)A(k), condition (34) can\nbe expressed as:\nM\nX\nm=1\nδ2\nmθ2\nm < ϵ2\n(35)\nwhere θm represents the entries of the main diagonal of PPH.\nThen:\nQ ≈ 4Y 2\n0 vH\n(\n(SA(k) − G(k)diag (δ) A(k))\n \nRx +\nNu\nX\ni=2\nRwi\n!\n(36)\n×\nh\nSA(k) − G(k)diag (δ) A(k)iH\n+ σ2\nnIN\n\u001b\nv\nq ≈ −2Y0vH \u0010\nSA(k) − G(k)diag (δ) A(k)\u0011\nUD\n1\n2\nIntroduce now the terms:\nR = Rx +\nNu\nX\ni=2\nRwi\nC1 = 4Y 2\n0 vHSA(k)R\nh\nA(k)iH\nSHv\nC2 = 4σ2\nnY 2\n0 vHSA(k)Rv\nd = −2Y0vHSA(k)UD\n1\n2\n(37)\nwhich allows us to reformulate the expression of Q and q as:\nQ ≈ C1 + C2\n− 2ℜ\n\u001a\n4Y 2\n0 vHG(k)diag (δ) A(k)R\nh\nA(k)iH\nSHv\n\u001b\n(38)\n+ 4Y 2\n0 vHG(k)diag (δ) A(k)R\nh\nA(k)iH\ndiag (δ)\nh\nG(k)iH\nv\nq ≈ d + 2Y0vHG(k)diag (δ) A(k)UD\n1\n2\nIt is now convenient to introduce the terms:\nRA = A(k)R\nh\nA(k)iH\n∈ CM×M\nf1 = 4Y 2\n0 vHG(k) ∈ C1×M\nf2 = RASHv ∈ CM×1\nf3 =\nh\nG(k)iH\nv ∈ CM×1\nf4 = 2Y0vHG(k) ∈ C1×M\nf5 = A(k)UD\n1\n2 Λ(k+1) ∈ CM×1\n(39)\nF1 = diag(f1) ∈ CM×M\nF3 = diag(f3) ∈ CM×M\nf1,2 = f T\n1 ⊙ f2 ∈ CM×1\nf4,5 = f T\n4 ⊙ f5 ∈ CM×1\nAccordingly, by considering only the terms in (27) that depend\non the optimization variable δ, we can approximate the MSE\nEr\n\u0010\nΛ(k+1), Φ(b)\n\u0011\n=tr\n(\nΛ(k+1)\n\"\nvH\n \nΦ(b)\n \nRx +\nNu\nX\ni=2\nRwi\n!\nΦH(b) + σ2\nnIN\n!\nv\n#\nΛ(k+1)H−2ℜ\nh\nΛ(k+1)vHΦ(b)UD\n1\n2\ni\n+Ir\n)\n.\n(24)\n7\n(27) as:\nˆEr\n\u0010\nΛ(k+1), Φ(δ)\n\u0011\n=\n\r\r\rΛ(k+1)\r\r\r\n2\nδF1RF3δT\n(40)\n− 2δ\n\u0014\r\r\rΛ(k+1)\r\r\r\n2\nℜ (f1,2) + ℜ (f4,5)\n\u0015\nWe are now in a position to define the problem for finding\nthe optimal δ as:\nδ∗ = arg min\nδ\nˆEr\n\u0010\nΛ(k+1), Φ(δ)\n\u0011\n(41)\ns.t.\nM\nX\nm=1\nδ2\nmθ2\nm < ϵ2\nThe problem in (41) is now convex and can be easily solved\nin the Lagrangian domain. First, from (40) we derive the\ngradient of the Lagrangian:\n∇δ\n\"\nˆEr\n\u0010\nΛ(k+1), Φ(δ)\n\u0011\n+ µ\n M\nX\nm=1\nδ2\nmθ2\nm − ϵ2\n!#\n= 2δ\n\r\r\rΛ(k+1)\r\r\r\n2\nℜ (F1RF3)\n(42)\n− 2\n\r\r\rΛ(k+1)\r\r\r\n2\nℜ (f1,2) − ℜ (f4,5) + 2δΨ\nwhere µ > 0 is a Lagrange multiplier and Ψ ∈ CM×1\nis a vector with entries θ2\nm. Accordingly, denoting by\nM =\n\r\rΛ(k+1)\r\r2 ℜ (F1RF3) and v =\n\r\rΛ(k+1)\r\r2 ℜ (f1,2) +\nℜ (f4,5), we finally obtain\nδ∗ = [M + µ × diag (Ψ)]−1 v\n(43)\nwhere µ is set to satisfy the constraint in (41). Finally, we can\nevaluate B(k+1) ≈ B(k) + F(k)diag (δ∗) and go to the next\niteration of the AO algorithm.\n2) Solution for the CT model: In the CT case, it is\nnecessary to use (4) instead of (5). This firstly entails using\na diagonal ZSS with entries Z0, which is trivial and does not\nlead to differences regarding the solution of problem (25).\nSecondly, it is necessary to subtract ∆S in (33), resulting in:\nS(ZSS + r0 + jB(k+1))−1\n(44)\n≈ SA(k) − G(k)diag (δ) A(k) − ∆S.\nFrom this point onwards, the optimization can proceed\nstraightforwardly in the same manner as described above for\nthe MP case.\nV. NUMERICAL RESULTS\nWe present some numerical results to assess the effective-\nness of the proposed optimization algorithms. Considering the\nscenario depicted in Fig. 1, we assume the carrier frequency\nis f0 = 30 GHz, the RIS is centered at position PR = (0, 0, 3)\nm, and the BS is positioned at PBS = (−7, 7, 2) m, corre-\nsponding to an angle of −π/4 with respect to the RIS. The Nu\nUEs are situated at positions Pi = (Xi, Yi, 0) m, indicating\nthat they are located on the opposite side of the room from\nthe BS. Specifically, P0 is the position of the user of interest\nand Pi, i > 0 are the positions of the interfering users.\nFollowing the RIS structure proposed in [44], the scatterers\nof the RIS consist of identical metallic dipoles with a radius\nof λ/500 and a length of L = 0.46λ. The dipoles are\nconfigured as a uniform planar array (UPA) with MH elements\nalong the x axis and MV elements along the z axis. The\nspacing between the elements is set to dx = λ/Q in the\nx direction, where Q is an integer determining the dipole\ndensity. Conversely, the spacing between elements in the z\ndirection is dz = 3/4λ. We then choose MH = 16λ/dx\nand MV = 4, resulting in an RIS forming a rectangle with\nan area of 50λ2. Regarding the BS, it is equipped with\nN = 16 antennas arranged in two linear arrays along the z\naxis, with each array containing 8 antennas along the x axis.\nThe antennas at the BS are separated by λ/2 in the x-axis\nand 3λ/4 in the z-axis. Similar to the RIS, these antennas\nare metallic dipoles with a radius of λ/500 and a length of\nL = 0.46λ. Regarding the noise, the variance σ2 is calculated\nto achieve a signal-to-noise ratio of -20 dB in the case\nwhere the RIS is configured randomly and for a transmitted\npower Ptx = 20 dBm. Finally, the UEs are equipped with\nsingle dipole antennas having the same characteristics. In the\nfollowing two subsections, we describe the models used for\nRIS optimization and for generating simulation results.\nA. Model considered for RIS optimization\nGiven the potential presence of both Line of Sight (LOS)\nand non-Line of Sight (NLOS) components in practical chan-\nnels, we characterize the RIS-UE channel using a generalized\nspatially correlated Rician fading model [52]. This approach\nis widely used in the literature to account for the presence\nof multipath fading in RIS-aided communications, as shown,\nfor example, in [42] for a multiport network model using S-\nparameters.\nAs for the LOS, it is assumed that the prior positions of the\nnodes are known with circular uncertainty, meaning the nodes\nare uniformly distrubuted within a circle of radius σ around\nthe actual position, corresponding to the localization error.\nThe correlation matrices of the LOS components are then\ncomputed using a classical model for correlation calculation\nbased on the angular spread with which the signal can arrive\ngiven the known localization error. For simplicity, consider\na planar geometry where the arrival angle depends only on\nthe azimuth φ, and assume knowledge of the range ∆i of\npossible arrival angles for the signal from i-th UE, given\nits uncertainty region (see the illustrative example in Fig. 2).\nDenoting by xm the x location of the m-th dipole of the RIS,\nwith m = 1, . . . , M, when a plane-wave impinges on the RIS\nfrom the azimuth angle φ, the array response vector can be\nwritten as [53]\na(φ) =\nh\nej 2π\nλ x1 sin φ, . . . , ej 2π\nλ xM sin φiT\n,\n(45)\nwhere λ is the wavelength. Hence, the channel correlation\nmatrices Ri are evaluated as:\nRi = βi\nZ φi+∆i/2\nφi−∆i/2\nf(φi, ∆i)a(φ)aH(φ)dφ\n(46)\nwhere f(φi, ∆i) =\n4(φ−φi)\n∆i\nis the spatial scattering distri-\nbution function which derives from the uniform distribution\n8\nFig. 2: Angle spread for correlation evaluation\nassumption within the circle, βi is the channel gain which is\nevaluated assuming a LOS propagation model. Note that this\nmodel is equivalent to the spatial correlation matrix model\nproposed in [53], [54]. However, in this case this model\nis considered only for CSI-free RIS optimization purposes\nand does not reflect the model which is generated in the\nsimulations, as explained below. The same model is assumed\nfor the NLOS component. In particular, considering a Ricean\nfactor K1 and an angular spread ∆m and the correlation\nmatrix of the NLOS part is:\nWi = βi\nK1\nZ φi+∆m/2\nφi−∆m/2\nf(φi, ∆m)a(φ)aH(φ)dφ\n(47)\nHence, we evaluate Rx = R1 + W1 and Rwi = Ri + Wi,\nwith i > 1.\nB. Model considered for Simulations\nGiven the estimated positions of the nodes, the true posi-\ntions are generated according to the uncertainty model, which\nselects a random point within the circle of the uncertainty\nregion. Meanwhile, the BS is positioned at a fixed location.\nSubsequently, the Line of Sight (LOS) components of the\nmatrices S and the vectors ti, along with the matrix ZSS,\nare derived from the multiport network model introduced in\n[33], utilizing the nodes’ positions. This model’s accuracy has\nbeen confirmed in [44] through comparison with a full-wave\nnumerical simulator.\nTo streamline the simulations, we assume that the antennas\nat the BS are isolated dipoles, neglecting mutual coupling\neffects at the BS. Subsequently, following the Ricean channel\nmodel outlined earlier, a Gaussian NLOS component is incor-\nporated. Specifically, if S and ti represent the terms computed\nby the model [33], the actual S(e) and t(e)\ni\nare determined by\nintroducing multipath effects in the form of additive Gaussian\nnoise with a covariance matrix calculated as in (47). Notably,\nwe generate the NLOS for the i-th RIS-UE channels, taking\ninto account the angle spreading ∆m and the Ricean factor\nK1. For the BS-RIS channel, we consider the angle spreading\n∆(BS)\nm\nand a Ricean factor K0. It’s worth mentioning that\nalthough we include the NLOS component in the BS-RIS\nchannel in the simulations, this effect is not accounted for in\nthe analysis, assuming that K0 can be very high. The direct\npath BS-UE is not modeled, assuming it is entirely blocked.\nThe transfer function used to compute the achievable rate\nis calculated as in (1) using S(e) and t(e)\ni , and the rate is\ndetermined as in (10), i.e., with exact channel knowledge. This\ncorresponds to the assumption that given the RIS optimization\nobtained in an offline phase, during actual transmission, the\nRIS becomes an integral part of the environment, and com-\nmunication follows standard end-to-end channel estimation\nstrategies, which can be conducted with pilot sequences and\nreceiver CSI estimation. Thus, the computed rate assumes\nideal channel estimation in this phase or negligible errors\naffecting it.\nC. Results\nIn the following figures, we present the results obtained\nfrom simulations to validate the CSI-free optimization ap-\nproach proposed in Section IV. In this regard, the combining\nvector v is a beamforming vector. Specifically, denoting φBS\nas the arrival angle of the signal at the BS from the RIS,\nv is calculated as v = a(φBS), where a is defined in (45).\nTherefore, the results are obtained for two different schemes,\nnamely OPT-NoCSI and CT-NoCSI which correspond to the\nsolution of (25) for the MP, and CT models, respectively.\nThese approaches will be compared with OPT-CSI, which\ncorresponds to the OPT-NoCSI scheme in the case where the\nchannel is exactly known for all involved nodes. This scheme,\nrepresenting the ultimate upper bound benchmark, can be\neasily derived from the OPT-NoCSI scheme by calculating\nRx = σ2\n1t(e)\n1\n\u0010\nt(e)\n1\n\u0011H\nand Rwi = σ2\ni t(e)\ni\n\u0010\nt(e)\ni\n\u0011H\n.\nIn the initial figures, the convergence behavior for the\nOPT-NoCSI algorithm is depicted for the case where Nu =\n3, with positions P0\n=\n10 (cos π/8, sin π/8, 0), P1\n=\n10 (cos π/4, sin π/4, 0), and P2 = 10 (cos 3π/8, sin 3π/8, 0),\nand for three values of dipoles’ distances: dx\n=\nλ/2,\ndx = λ/4, and dx = λ/8. Specifically, the rate value (13)\nexpressed in bit/s/Hz is plotted against the iteration index\nk. In other words, the node positions are assumed such that\nthe two interfering nodes are located at the same distance of\n10 meters from the useful node, corresponding to the case\nwhere the signal-to-interference ratio (SIR) is equal to 1,\nwith angles between the nodes differing by π/8. The Ricean\nfactors K0 and K1 for the BS-RIS and RIS-UEs links are\nset to K0 = 20 and K1 = 10, respectively. Figure 3 (a),\n(b), (c) and (d) report the results for four different position\nuncertainty: σ = 0 m, σ = 0.1 m, σ = 0.5 m and σ = 1 m,\nrespectively. It can be observed that the proposed algorithm\nallows for an increasing rate Rb with iterations, thus enabling\nconvergence to a local optimum in all cases. In this regard, it\nis noted that when the dipoles are spaced by λ/2, convergence\nis faster, which can be explained by the lesser effect of the\nnon-diagonals of the Z matrix. On the other hand, better\nperformance is observed when the dipoles are closer, an\neffect already highlighted in previous works using multiport\nnetwork models. It is noted that this improvement is achieved\nfor the same RIS aperture of 50λ2. Finally, it is observed\nthat increasing position uncertainty results in only a slightly\n9\n0\n0.5\n1\n1.5\n2\n2.5\n3\nIterations\n104\n0\n2\n4\n6\nRb\n(a)\ndx = /2\ndx = /4\ndx = /8\n0\n0.5\n1\n1.5\n2\n2.5\n3\nIterations\n104\n0\n2\n4\n6\nRb\n(b)\ndx = /2\ndx = /4\ndx = /8\n0\n0.5\n1\n1.5\n2\n2.5\n3\nIterations\n104\n0\n2\n4\n6\nRb\n(c)\ndx = /2\ndx = /4\ndx = /8\n0\n0.5\n1\n1.5\n2\n2.5\n3\nIterations\n104\n0\n2\n4\n6\nRb\n(d)\ndx = /2\ndx = /4\ndx = /8\nFig. 3: Convergence behavior for the OPT-NoCSI algorithm for the\ncase where Nu = 3 and for three values of dipoles’ distances: dx =\nλ/2, dx = λ/4, and dx = λ/8. The node positions are assumed\nsuch that the two interfering nodes are located at the same distance\nof 10 meters from the useful node, with angles between the nodes\ndiffering by π/8. The results for four different position uncertainty,\nnamely σ = 0 m, σ = 0.1 m, σ = 0.5 m and σ = 1 m, are reported\nin Figs. (a), (b), (c) and (d), respectively.\nperceptible performance degradation. For example, in the case\nof λ/8, the rate decreases from approximately 6.5 to 6. It\nshould be emphasized that this is not the actual rate measured\nby the simulations and reported in the subsequent graphs, but\nonly the rate used in the objective function to optimize the\nRIS in the offline phase.\nIn Figs. 4-6, the trend of the rate R in (10) evaluated\nthrough simulations is depicted, considering σ = 0.5 m in\nthe case of Nu = 2 with the intended UE positioned at\nP0 = 10 (cos π/8, sin π/8, 0) while the interfering UE is\npositioned at 12 different possible positions P1 = Ti =\n10 [cos(i × π/32), sin(i × π/32)] with i = 1, 2, . . . , 15. Ac-\ncordingly, the interfering user is at the same distance from\nthe RIS as the useful user but with different angles. In Figs.\n4-6(a), the case dx = λ/2 is considered, whereas in 4-6(b)\ndx = λ/4 is reported. Furthermore, the three figures 4, 5,\nand 6 refer to the values of σ = 0.5, 1, 2 m, respectively.\nThe curves correspond to the OPT-NoCSI, OPT-CT, and OPT-\nCSI cases described earlier. It is noted that at position T4,\nthe interfering user is on average in the same position as the\nintended UE, thus an average rate equal to one is expected\nsince SIR = 1 and the interference cannot be removed, as\nindeed happens in all considered cases. It is also noted\nthat at position T8, the interfering user is at an angle π/4,\n1\n2\n3\n4\n5\n6\n7\n8\n9\n10\n11\n12\n13\n14\n15\nInterfering position index\n0\n1\n2\n3\n4\n5\n6\nR\n(a)\nSpecular position\nOPT-NoCSI\nOPT-NoCSI (Rb)\nOPT-CT\nOPT-CSI\n1\n2\n3\n4\n5\n6\n7\n8\n9\n10\n11\n12\n13\n14\n15\nInterfering position index\n0\n2\n4\n6\n8\nR\n(b)\nSpecular position\nOPT-NoCSI\nOPT-NoCSI (Rb)\nOPT-CT\nOPT-CSI\nFig. 4: Rate R in (10) evaluated through simulations consider-\ning σ\n= 0.5 m in the case of Nu\n= 2, with the intended\nUE positioned at P0 = 10\n\u0000cos π\n8 , sin π\n8 , 0\n\u0001\nwhile the interfer-\ning user is positioned at 12 possible different positions, Pi =\n10 {cos[π/8 + (i − 1)π/32], sin[π/8 + (i − 1)π/32], 0}, with i =\n1, . . . , 12. The case (a) refers to dx = λ\n2 , while the case (b) reports\nthe case dx = λ\n4\ncorresponding to the specular position of the RIS with respect\nto the BS. In this case, it is evident that the CT model\nfails, as the RIS is optimized without considering the specular\ncomponent, which in this case produces strong interference.\nThe dashed curve also reports the value of Rb defined in (13),\nwhich corresponds to the objective used by the optimizer.\nIt is noted how this value closely approximates the rate R\nfound through simulations in all cases. Finally, it is noted that\nthe optimizer OPT-NoCSI, in many cases, even for relevant\nposition estimation errors, manages to achieve performance\nreasonably close to the OPT-CSI case, which requires an exact\nchannel estimation and, in any case, provides much better\nperformance than the OPT-CT case, especially in the presence\nof consistent mutual coupling (i.e., for dx = λ/4), and when\nthe interferer is close to the specular angular position.\nIn the last two figures, namely 7 and 8, we present the\nscenario where there is only one transmitting node positioned\nat a distance of 10 m and at all possible angular positions\nϕ from 0 to 90 degrees. In this setting, we depict the power\nreceived at the BS (in dBW) as a function of the angle ϕ. The\nRIS is optimized using the OPT-NoCSI and CT approaches for\nthe case Nu = 2, where the central position of the reference\n10\n1\n2\n3\n4\n5\n6\n7\n8\n9\n10\n11\n12\n13\n14\n15\nInterfering position index\n0\n1\n2\n3\n4\n5\n6\nR\n(a)\nSpecular position\nOPT-NoCSI\nOPT-NoCSI (Rb)\nOPT-CT\nOPT-CSI\n1\n2\n3\n4\n5\n6\n7\n8\n9\n10\n11\n12\n13\n14\n15\nInterfering position index\n0\n2\n4\n6\n8\nR\n(b)\nSpecular position\nOPT-NoCSI\nOPT-NoCSI (Rb)\nOPT-CT\nOPT-CSI\nFig. 5: Rate R in (10) evaluated through simulations considering\nσ = 1 m for the same setting of Fig. 4.\nnode is P0 = 10\n\u0000cos π\n8 , sin π\n8 , 0\n\u0001\n, corresponding to an angle\nof 22.5 degrees, and that of the interfering node is P1 =\n10\n\u0000cos π\n4 , sin π\n4 , 0\n\u0001\n, corresponding to the specular position at\n45 degrees. In 7 (a), (b), (c), the cases dx = λ/2 and σ =\n0.5, 1, 2 m are depicted, respectively. In 8 (a), (b), (c), the\nsame cases are illustrated for dx = λ/4. The objective of\nthese figures is to showcase the type of beam created by the\nRIS in the direction of the useful node and its ability to reject\ninterference.\nThe first notable observation is that in the CT case, the\ninterference is not eliminated. This occurs because in this\nmodel, structural scattering is not considered, and thus, the\ninterference originating from the direction π/4 is significantly\nunderestimated. Conversely, in the OPT-NoCSI case, the RIS\nplaces a null in the direction of the specular component. In\nboth cases, the RIS generates a beam in the direction of the\nuseful signal. However, in the CT case when dx = λ/4, the\nbeam is not centered due to the mismatch of the model, which\ndoes not account for mutual couplings. Both the null towards\nthe interferer and the beam towards the intended UE become\nwider as the uncertainty regarding the possible position of\nthe interferer increases (observe the difference in the beams\nwhen transitioning from case (a) to case (c)). This behavior\naligns with expectations, as an increase in position uncertainty\nnecessitates ’illuminating’ or ’eliminating’ larger portions of\nspace with the RIS.\n1\n2\n3\n4\n5\n6\n7\n8\n9\n10\n11\n12\n13\n14\n15\nInterfering position index\n0\n1\n2\n3\n4\n5\n6\nR\n(a)\nSpecular position\nOPT-NoCSI\nOPT-NoCSI (Rb)\nOPT-CT\nOPT-CSI\n1\n2\n3\n4\n5\n6\n7\n8\n9\n10\n11\n12\n13\n14\n15\nInterfering position index\n0\n2\n4\n6\n8\nR\n(b)\nSpecular position\nOPT-NoCSI\nOPT-NoCSI (Rb)\nOPT-CT\nOPT-CSI\nFig. 6: Rate R in (10) evaluated through simulations considering\nσ = 2 m for the same setting of Fig. 4.\nVI. CONCLUSION\nIn this paper, we have addressed the challenge of optimizing\nReconfigurable Intelligent Surfaces (RIS) for uplink commu-\nnication systems in the presence of interfering users with-\nout relying on Channel State Information (CSI) estimation.\nOur proposed CSI-free approach leverages a priori statistical\nknowledge of the channel to maximize the average achievable\nrate. To account for practical considerations often overlooked\nin traditional RIS models, we developed a multiport network\nmodel that incorporates factors such as mutual coupling\namong scattering elements and the presence of structural\nscattering. Through simulations, we have demonstrated the\neffectiveness of our approach, showing that it can achieve\nperformance levels close to those obtained with perfect CSI\nin some cases.\nREFERENCES\n[1] C. Liaskos and al., “A new wireless communication paradigm through\nsoftware-controlled metasurfaces,” IEEE Comm. Mag., vol. 56, no. 9,\npp. 162–169, Sep. 2018.\n[2] M. Di Renzo and al., “Smart radio environments empowered by recon-\nfigurable AI meta-surfaces: an idea whose time has come,” EURASIP\nJournal on Wir. Comm. and Net., vol. 2019, no. 1, p. 129, 2019.\n[3] Q. Wu and al., “Intelligent reflecting surface aided wireless communi-\ncations: A tutorial,” IEEE Trans. on Comm., 2021.\n[4] M. Di Renzo and al., “Smart radio environments empowered by\nreconfigurable intelligent surfaces: How it works, state of research, and\nroad ahead,” IEEE JSAC, vol. 38, no. 11, pp. 2450–2525, July 2020.\n11\n0\n10\n20\n30\n40\n50\n60\n70\n80\n90\n (deg.)\n-140\n-135\n-130\n-125\n-120\n-115\n-110\nPrx (dBW)\n(a)\nSpecular position\nUE position\nOPT-NoCSI\nOPT-CT\n0\n10\n20\n30\n40\n50\n60\n70\n80\n90\n (deg.)\n-140\n-135\n-130\n-125\n-120\n-115\n-110\nPrx (dBW)\n(b)\nSpecular position\nUE position\nOPT-NoCSI\nOPT-CT\n0\n10\n20\n30\n40\n50\n60\n70\n80\n90\n (deg.)\n-140\n-135\n-130\n-125\n-120\n-115\n-110\nPrx (dBW)\n(c)\nSpecular position\nUE position\nOPT-NoCSI\nOPT-CT\nFig. 7: Power received at the BS (in dBW) as a function of the angle\nϕ of the transmitting node. The RIS characterized by dx = λ/2 and\nit is optimized using the OPT-NoCSI and CT approaches for the case\nNu = 2, where the reference node at an angle of 22.5 degrees, and\nthe interfering node is at 45 degrees (specular direction).\n[5] Y. Liu and al., “Reconfigurable intelligent surfaces: Principles and\nopportunities,” arXiv:2007.03435, 2020.\n[6] M. Di Renzo and al., “Analytical modeling of the path-loss for recon-\nfigurable intelligent surfaces – Anomalous mirror or scatterer ?” 21st\nInt. Workshop on Signal Proc. Advances in Wir. Comm., May 2020.\n[7] E. Bj¨ornson, H. Wymeersch, B. Matthiesen, P. Popovski, L. Sanguinetti,\nand E. de Carvalho, “Reconfigurable intelligent surfaces: A signal\nprocessing perspective with wireless applications,” IEEE Signal Process.\nMag., vol. 39, no. 2, pp. 135–158, Mar. 2022.\n[8] X. Wei, D. Shen, and L. Dai, “Channel estimation for ris assisted\nwireless communications—part i: Fundamentals, solutions, and future\nopportunities,” IEEE Communications Letters, vol. 25, no. 5, pp. 1398–\n1402, 2021.\n[9]\n¨O. T. Demir and E. Bj¨ornson, “Is channel estimation necessary to select\nphase-shifts for RIS-assisted massive MIMO?” IEEE Trans. Wireless\nCommun., pp. 1–1, Jun. 2022.\n[10]\n¨O. T. Demir, E. Bj¨ornson, and L. Sanguinetti, “Exploiting array ge-\nometry for reduced-subspace channel estimation in RIS-aided commu-\nnications,” in 2022 IEEE 12th Sensor Array and Multichannel Signal\nProcessing Workshop (SAM), 2022, pp. 455–459.\n[11] X. Wei, D. Shen, and L. Dai, “Channel estimation for ris assisted\nwireless communications—part ii: An improved solution based on\ndouble-structured sparsity,” IEEE Communications Letters, vol. 25,\nno. 5, pp. 1403–1407, 2021.\n[12] G. Zhou, C. Pan, H. Ren, P. Popovski, and A. L. Swindlehurst, “Channel\nestimation for RIS-aided multiuser millimeter-wave systems,” IEEE\nTrans. Signal Process., vol. 70, pp. 1478–1492, Mar. 2022.\n[13] T. L. Jensen and E. De Carvalho, “An optimal channel estimation\nscheme for intelligent reflecting surfaces based on a minimum variance\nunbiased estimator,” in ICASSP 2020 - 2020 IEEE International Con-\nference on Acoustics, Speech and Signal Processing (ICASSP), 2020,\npp. 5000–5004.\n[14] J. Chen, Y.-C. Liang, H. V. Cheng, and W. Yu, “Channel estimation\nfor reconfigurable intelligent surface aided multi-user mmWave MIMO\nsystems,” IEEE Trans. Wireless Commun., vol. 22, no. 10, pp. 6853–\n6869, Oct. 2023.\n[15] A. de Jesus Torres, L. Sanguinetti, and E. Bj¨ornson, “Electromagnetic\n0\n10\n20\n30\n40\n50\n60\n70\n80\n90\n (deg.)\n-140\n-135\n-130\n-125\n-120\n-115\n-110\nPrx (dBW)\n(a)\nSpecular position\nUE position\nOPT-NoCSI\nOPT-CT\n0\n10\n20\n30\n40\n50\n60\n70\n80\n90\n (deg.)\n-140\n-135\n-130\n-125\n-120\n-115\n-110\nPrx (dBW)\n(b)\nSpecular position\nUE position\nOPT-NoCSI\nOPT-CT\n0\n10\n20\n30\n40\n50\n60\n70\n80\n90\n (deg.)\n-140\n-135\n-130\n-125\n-120\n-115\n-110\nPrx (dBW)\n(c)\nSpecular position\nUE position\nOPT-NoCSI\nOPT-CT\nFig. 8: Power received at the BS (in dBW) as a function of the angle\nϕ of the transmitting node for dx = λ/4 and the same setting as\nFig. 7.\ninterference in RIS-aided communications,” IEEE Wireless Commun.\nLett., vol. 11, no. 4, pp. 668–672, Apr. 2022.\n[16] W.-X. Long, M. Moretti, L. Sanguinetti, and R. Chen, “Channel esti-\nmation in RIS-aided communications with interference,” IEEE Wireless\nCommun. Lett., vol. 12, no. 10, pp. 1751–1755, Oct. 2023.\n[17] A. Abrardo, D. Dardari, M. Di Renzo, “Intelligent Reflecting Surfaces:\nSum-Rate Optimization Based on Statistical Position Information,”\nIEEE Transactions on Communications, vol. 69, no. 10, pp 7121-7136\n[18] A. Zappone and al., “Overhead-aware design of reconfigurable intelli-\ngent surfaces in smart radio environments,” IEEE Trans. on Wireless\nComm., Vol. 20, no. 1, pp. 126-141, 2021\n[19] M.-M. Zhao, Q. Wu, M.-J. Zhao, and R. Zhang, “Intelligent reflecting\nsurface enhanced wireless networks: Two-timescale beamforming op-\ntimization,” IEEE Transactions on Wireless Communications, vol. 20,\nno. 1, pp. 2–17, 2021.\n[20] F. Jiang, A. Abrardo, K. Keykhosravi, H. Wymeersch, D. Dardari, and\nM. D. Renzo, “Two-timescale transmission design and ris optimization\nfor integrated localization and communications,” IEEE Trans. on Wire-\nless Comm., vol. 22, no. 12, pp. 8587–8602, April 2023.\n[21] Q.-U.-A. Nadeem, A. Chaaban, and M. Debbah, “Opportunistic beam-\nforming using an intelligent reflecting surface without instantaneous\nCSI,” IEEE Wireless Communications Letters, to appear, 2020.\n[22] Z. Peng, T. Li, C. Pan, H. Ren, W. Xu, and M. Di Renzo, “Analysis\nand optimization for IRS-aided multi-pair communications relying on\nstatistical csi,” arXiv:2007.11704, 2020.\n[23] D. Dardari and D. Massari, “Using metaprisms for performance im-\nprovement in wireless communications,” arXiv:2003.13505, 2020.\n[24] M. Di Renzo, F. H. Danufane, and S. A. Tretyakov, “Communication\nmodels for reconfigurable intelligent surfaces: From surface electromag-\nnetics to wireless networks optimization,” Proc. IEEE, vol. 110, no. 9,\npp. 1164–1209, 2022.\n[25] M. Di Renzo, A. Ahmed, A. Zappone, V. Galdi, G. Gradoni, M. Moccia,\nand G. Castaldi, “Digital reconfigurable intelligent surfaces: On the im-\npact of realistic reradiation models,” CoRR, vol. abs/arXiv:2205.09799,\n2022.\n[26] S. Abeywickrama, R. Zhang, Q. Wu, and C. Yuen, “Intelligent reflecting\nsurface: Practical phase shift model and beamforming optimization,”\nIEEE Trans. Commun., vol. 68, no. 9, pp. 5849–5863, 2020.\n[27] M. Di Renzo, A. Mohamed, A. Zappone, G. Gradoni, M. Rossi,\n12\nM. Moccia, G. Castaldi, and V. Galdi, “Effects of realistic reradia-\ntion models in digital reconfigurable intelligent surfaces,” Journal of\nInformation and Intelligence, 2023.\n[28] A. Rafique, N. U. Hassan, M. Zubair, I. H. Naqvi, M. Q. Mehmood,\nM. Di Renzo, M. Debbah, and C. Yuen, “Reconfigurable intelligent\nsurfaces: Interplay of unit cell and surface-level design and performance\nunder quantifiable benchmarks,” IEEE Open J. Commun. Soc., vol. 4,\npp. 1583–1599, 2023.\n[29] M. T. Ivrlac and J. A. Nossek, “Toward a circuit theory of communi-\ncation,” IEEE Trans. Circuits Syst. I Regul. Pap., vol. 57-I, no. 7, pp.\n1663–1683, 2010.\n[30] M. Di Renzo, A. Zappone, M. Debbah, M. Alouini, C. Yuen,\nJ. de Rosny, and S. A. Tretyakov, “Smart radio environments empowered\nby reconfigurable intelligent surfaces: How it works, state of research,\nand the road ahead,” IEEE J. Sel. Areas Commun., vol. 38, pp. 2450–\n2525, 2020.\n[31] M. Movahediqomi, G. Ptitcyn, and S. Tretyakov, “Comparison between\ndifferent designs and realizations of anomalous reflectors for extreme\ndeflections,” IEEE Transactions on Antennas and Propagation, pp. 1–1,\n2023.\n[32] Y. Li, X. Ma, X. Wang, G. Ptitcyn, M. Movahediqomi, and S. A.\nTretyakov, “Tunable perfect anomalous reflection using passive ape-\nriodic gratings,” CoRR, vol. abs/arXiv:2303.05411, 2023.\n[33] M. D. R. G. Gradoni, “End-to-end mutual coupling aware communica-\ntion model for reconfigurable intelligent surfaces: An electromagnetic-\ncompliant approach based on mutual impedances,” IEEE Wireless\nCommun. Lett., vol. 10, no. 5, pp. 938–942, May 2021.\n[34] P. C. Chaumet, “The discrete dipole approximation: A review,” Mathe-\nmatics, vol. 10, no. 17, 2022.\n[35] R. Faqiri, C. Saigre-Tardif, G. C. Alexandropoulos, N. Shlezinger, M. F.\nImani, and P. del Hougne, “Physfad: Physics-based end-to-end channel\nmodeling of ris-parametrized environments with adjustable fading,”\nIEEE Trans. Wirel. Commun., vol. 22, no. 1, pp. 580–595, 2023.\n[36] M. D. R. X. Qian, “Mutual coupling and unit cell aware optimization\nfor reconfigurable intelligent surfaces,” IEEE Wireless Commun. Lett.,\nvol. 10, no. 6, pp. 1183–1187, June 2021.\n[37] H. E. Hassani, X. Qian, S. Jeong, N. S. Perovic, M. D. Renzo, P. Mursia,\nV. Sciancalepore, and X. Costa-Perez, “Optimization of ris-aided mimo\n– a mutually coupled loaded wire dipole model,” arXiv, June 2023.\n[38] N. S. Perovic, L. Tran, M. Di Renzo, and M. F. Flanagan, “Optimization\nof ris-aided SISO systems based on a mutually coupled loaded wire\ndipole model,” CoRR, vol. abs/arXiv:2305.12735, 2023.\n[39] M. Akrout, F. Bellili, A. Mezghani, and J. A. Nossek, “Physically\nconsistent models for intelligent reflective surface-assisted communi-\ncations under mutual coupling and element size constraint,” CoRR, vol.\nabs/arXiv:2302.11130, 2022.\n[40] K. Konno, S. Terranova, Q. Chen, and G. Gradoni, “Generalised\nimpedance model of wireless links assisted by reconfigurable intelligent\nsurfaces,” CoRR, vol. abs/arXiv:2306.03761, 2023.\n[41] P. Zheng, X. Ma, and T. Y. Al-Naffouri, “On the impact of\nmutual coupling on ris-assisted channel estimation,” CoRR, vol.\nabs/arXiv:2309.04990, 2023.\n[42] S. Shen, B. Clerckx, and R. Murch, “Modeling and architecture design\nof reconfigurable intelligent surfaces using scattering parameter network\nanalysis,” IEEE Transactions on Wireless Communications, vol. 21,\nno. 2, pp. 1229–1243, 2022.\n[43] A. Abrardo, A. Toccafondi, and M. D. Renzo, “Analysis and opti-\nmization of reconfigurable intelligent surfaces based on s-parameters\nmultiport network theory,” arXiv:2308.16856 [cs.IT], accepted in IEEE\nEUCAP 2024, August 2023.\n[44] ——, “Design of reconfigurable intelligent surfaces by using s-\nparameter multiport network theory – optimization and full-wave vali-\ndation,” arXiv:2311.06648 [cs.IT], November 2023.\n[45] W.-X. Long, M. Moretti, A. Abrardo, L. Sanguinetti, and R. Chen,\n“Mmse design of ris-aided communications,” arXiv:2312.07864 [cs.IT],\nDecember 2023.\n[46] N. S. Perovic and al., “Achievable rate optimization for mimo systems\nwith reconfigurable intelligent surfaces,” arXiv:2008.09563, 2020.\n[47] T. V. Chien and al., “Reconfigurable intelligent surface-assisted\ncell-free massive mimo systems over spatially-correlated channels,”\nhttps://arxiv.org/pdf/2104.08648.pdf, 2021.\n[48] O.T.Demir, E. Bjornson, and L. Sanguinetti, “Exploiting array geometry\nfor reduced-subspace channel estimation in ris-aided communications,”\n2022 IEEE 12th Sensor Array and Multichannel Signal Processing\nWorkshop, pp. 445–459, 2022.\n[49] W.-X. Long, M. Moretti, A. Abrardo, L. Sanguinetti, and R. Chen,\n“Mmse design of ris-aided communications,” arXiv:2312.07864, 2023.\n[50] B. Hassibi and B. M. Hochwald, “How much training is needed in\nmultiple-antenna wireless links?” IEEE Trans. Inf. Theor., vol. 49, no. 4,\npp. 951–963, Apr 2003.\n[51] M.-M. Zhao, Q. Wu, M.-J. Zhao, and R. Zhang, “Intelligent Reflect-\ning Surface Enhanced Wireless Network: Two-timescale Beamforming\nOptimization,” arXiv e-prints, Dec. 2019.\n[52] M. McKay and I. Collings, “General capacity bounds for spatially\ncorrelated rician mimo channels,” IEEE Transactions on Information\nTheory, vol. 51, no. 9, pp. 3121–3145, 2005.\n[53]\n¨O. T. Demir, E. Bj¨ornson, and L. Sanguinetti, “Channel modeling and\nchannel estimation for holographic massive MIMO with planar arrays,”\nIEEE Wireless Commun. Lett., vol. 11, no. 5, pp. 997–1001, May 2022.\n[54] E. Bj¨ornson and L. Sanguinetti, “Rayleigh fading modeling and chan-\nnel hardening for reconfigurable intelligent surfaces,” IEEE Wireless\nCommun. Lett., vol. 10, no. 4, pp. 830–834, Apr. 2021.\n"
}