{
    "optim": "arXiv:2402.17567v1  [quant-ph]  27 Feb 2024\nCoherence generation with Hamiltonians\nManfredi Scalici, Moein Naseri, and Alexander Streltsov\nCentre for Quantum Optical Technologies, Centre of New Technologies,\nUniversity of Warsaw, Banacha 2c, 02-097 Warsaw, Poland\nWe explore methods to generate quantum coherence through unitary evolutions, by introducing and studying\nthe coherence generating capacity of Hamiltonians. This quantity is deﬁned as the maximum derivative of\ncoherence that can be achieved by a Hamiltonian. By adopting the relative entropy of coherence as our ﬁgure\nof merit, we evaluate the maximal coherence generating capacity with the constraint of a bounded Hilbert-\nSchmidt norm for the Hamiltonian. Our investigation yields closed-form expressions for both Hamiltonians and\nquantum states that induce the maximal derivative of coherence under these conditions. Speciﬁcally, for qubit\nsystems, we solve this problem comprehensively for any given Hamiltonian, identifying the quantum states\nthat lead to the largest coherence derivative induced by the Hamiltonian. Our investigation enables a precise\nidentiﬁcation of conditions under which quantum coherence is optimally enhanced, oﬀering valuable insights\nfor the manipulation and control of quantum coherence in quantum systems.\nI.\nINTRODUCTION\nThe paradigm of quantum resource theories [1] provides a\nstructured approach to investigate the characteristics of quan-\ntum systems and their utility in quantum technologies. No-\ntably, the resource theories of entanglement [2] and coher-\nence [3, 4] stand out as signiﬁcant examples within this frame-\nwork. The resource theory of entanglement explores the capa-\nbilities and constraints of spatially separated agents who oper-\nate within their local quantum laboratories and communicate\nvia classical channels [2]. On the other hand, the resource the-\nory of coherence delves into the challenges and opportunities\nfaced by an agent who is limited in the abilities to generate and\npreserve quantum coherence [3, 4]. Furthermore, the frame-\nwork of quantum resource theories has been adeptly applied to\nthe ﬁeld of quantum thermodynamics [5, 6]. This application\nhas enabled a deeper understanding of how quantum systems\ncan be manipulated within the bounds of energy constraints.\nEvery quantum resource theory is grounded on deﬁning two\nbasic elements: free states and free operations [1]. Free states\nrefer to quantum states that can be easily generated within a\nsetting that is justiﬁed by physical principles. Speciﬁcally,\nwithin the resource theory of coherence, free states are iden-\ntiﬁed as incoherent states [7]. These are states which are di-\nagonal in a certain reference basis, denoted by |i⟩. The impe-\ntus behind exploring this theory is rooted in the phenomenon\nof unavoidable decoherence, suggesting that incoherent states\nare those that remain unchanged in the presence of decoher-\nence.\nOn the aspect of free operations, these ideally are quan-\ntum manipulations that can be easily executed, based on the\nphysical considerations on which the resource theory is based.\nFor instance, in the resource theory of entanglement, the set\nof local operations and classical communication embodies a\nset of free operations endowed with tangible physical inter-\npretation [8]. Within the context of the resource theory of\ncoherence, various sets of free operations have been scruti-\nnized [7, 9–14]. A common characteristic among these sets is\ntheir inability to generate coherence from incoherent states.\nAt the heart of any quantum resource theory lies the fun-\ndamental inquiry into the feasibility of state transformations.\nIt is customary to consider the scenario where n copies of a\ngiven initial state ρ are at one’s disposal, with the ambition to\ntransform these into m copies of a desired target state σ. This\nprocess is envisioned to accommodate an error margin that\ndiminishes as the number of initial state copies, n, increases.\nThe eﬃciency of this transformation is quantiﬁed by the high-\nest feasible ratio of m/n, signifying the transformation rate.\nWithin the framework of the resource theory of coherence,\nthe optimal rate at which one quantum state can be trans-\nformed into another is precisely determined when focusing on\nthe set of maximally incoherent operations (MIO). These op-\nerations are characterized by their inability to produce coher-\nence from states that are initially incoherent [10]. The maxi-\nmal transformation rate in this setting is encapsulated by the\nformula [9]:\nR(ρ → σ) = Cr(ρ)\nCr(σ),\n(1)\nwhere Cr(ρ) represent the relative entropy of coherence for the\ninitial and target states, respectively. The relative entropy of\ncoherence for a state ρ is deﬁned as [7]:\nCr(ρ) = min\nσ∈I S (ρ||σ) = S (∆[ρ]) − S (ρ),\n(2)\nwith the quantum relative entropy S (ρ||σ) = Tr[ρ log2 ρ] −\nTr[ρ log2 σ], the von Neumann entropy S (ρ) = −Tr[ρ log2 ρ],\nand ∆[ρ] = P\ni |i⟩⟨i| ρ |i⟩⟨i| representing the operation of com-\nplete dephasing in the incoherent basis. A similar quantity\nhas been studied previously also within the resource theory of\nentanglement [15].\nThe relative entropy of coherence is an important example\nof a coherence measure [7]. Essentially, a coherence mea-\nsure, represented by C(ρ), quantiﬁes the amount of coherence\nin a quantum state ρ. Its fundamental characteristic is that it\nis non-increasing under the application of free operations, de-\nnoted as Λ f, that are permissible within the resource theory\nframework, i.e., C(Λ f[ρ]) ≤ C(ρ) for any quantum state ρ and\nany free operation Λ f. The literature oﬀers a diverse range of\ncoherence quantiﬁers, each grounded in either physical prin-\nciples or mathematical foundations [7, 10, 14, 16–19].\n2\nConsidering the signiﬁcance of quantum coherence in\nquantum information science and quantum technology [3, 4],\nit becomes essential to explore and comprehend the most ef-\nﬁcient methodologies for its generation. One strategy to cre-\nate quantum coherence involves employing a static quantum\nchannel, represented by Λ. This approach can successfully\ncreate coherence from an initially incoherent state, contingent\nupon the condition that Λ is not in the set MIO. The pursuit\nof identifying and reﬁning optimal methods for the generation\nof coherence through static quantum channels has garnered\nattention and been subject to detailed examination in various\nstudies [7, 20–22].\nIn this article, we focus on the optimal methods to gener-\nate coherence via dynamical evolutions, focusing speciﬁcally\non unitary evolutions Ut = e−itH. Using the relative entropy\nof coherence as a ﬁgure of merit, we investigate the maximal\nderivative of Cr achievable in this setting, maximized over all\ninitial states ρ and all Hamiltonians H with bounded Hilbert-\nSchmidt norm. This quantity has a clear operational meaning\nvia Eq. (1), corresponding to the maximal coherence genera-\ntion rate achievable via Hamiltonians with bounded Hilbert-\nSchmidt norm. We characterize optimal initial states and op-\ntimal Hamiltonians for any system of dimension d. For qubit\nsystems, we provide optimal input state for any given Hamil-\ntonian.\nII.\nCOHERENCE GENERATING CAPACITY OF\nHAMILTONIANS\nFor a Hamiltonian H, we deﬁne the coherence generating\ncapacity of H as the maximal increase of coherence achiev-\nable via a unitary evolution Ut = e−itH at time t = 0, i.e.,\nCgen(H) = max\nρ\nCr(e−iHtρeiHt)\ndt\n\f\f\f\f\f\ft=0\n.\n(3)\nFunctions of this form have been previously studied in entan-\nglement theory, in the context of entanglement generation via\nnon-local Hamiltonians [23, 24].\nThe following proposition provides an alternative expres-\nsion for the coherence generating capacity.\nProposition 1. For any Hamiltonian H it holds that\nCgen(H) = max\nρ\niTr(H[ρ, log2 ∆(ρ)]).\n(4)\nProof. We deﬁne the state ρt = e−iHtρeiHt and ˙ρt = dρt/dt. It\nthen holds\nd\ndtS (ρt) = −Tr[˙ρt log2 ρt].\n(5)\nA proof of this equality is given in the Appendix. For the time\nderivative of coherence we obtain\ndCr(ρt)\ndt\n= dS (∆[ρt])\ndt\n= −Tr\n\" d\ndt∆(ρt)\n!\nlog2 ∆(ρt)\n#\n= −Tr \u0002∆(˙ρt) log2 ∆(ρt)\u0003 ,\n(6)\nwhere we have used the fact that dephasing commutes with\nthe time derivative, i.e.,\nd\ndt∆(ρt) = ∆(˙ρt).\n(7)\nUsing the von Neumann equation ˙ρt = −i[H, ρt] Eq. (6) can\nbe expressed as\ndCr(ρt)\ndt\n= iTr \u0002∆([H, ρt]) log2 ∆(ρt)\u0003 .\n(8)\nAs we further show in the Appendix,\nTr \u0002∆(A) log2 ∆(B)\u0003 = Tr \u0002A log2 ∆(B)\u0003\n(9)\nholds true for any Hermitian matrix A and any positive matrix\nB. Choosing A = i∆([H, ρt]) and B = ρt we further obtain\ndCr(ρt)\ndt\n= iTr \u0002[H, ρt] log2 ∆(ρt)\u0003 .\n(10)\nAt time t = 0 we further have\ndCr(ρt)\ndt\n\f\f\f\f\ft=0\n= iTr[[H, ρ] log2 ∆(ρ)],\n(11)\nwhere ρ = ρt=0. This expression can be further written as\ndCr(ρt)\ndt\n\f\f\f\f\ft=0\n= iTr(H[ρ, log2 ∆(ρ)]).\n(12)\nPerforming the maximum over all states ρ completes the\nproof.\n□\nIn the following, our goal is to evaluate the maximal coher-\nence generating capacity over all Hamiltonians with the con-\nstraint ||H||2 ≤ 1, where ||M||2 =\np\nTr[M†M] is the Hilbert-\nSchmidt norm of a matrix M. As we will see, this problem is\nclosely related to the variance of the surprisal, as investigated\nin [25] (a similar technique has been used earlier in [24]). For\na probability distribution p = (p0, . . . , pd−1), the the surprisal\n− log2 pi is a quantiﬁer of the surprise to obtain the outcome\ni. The variance of the surprisal is given as\nf(p) =\nX\ni\npi\n\u0000− log2 pi\n\u00012 −\n\nX\ni\npi\n\u0000− log2 pi\n\u0001\n\n2\n.\n(13)\nAs we will show in the following theorem, the maximal co-\nherence generating capacity for a system of dimension d is\nclosely related to the maximal variance of the surprisal f.\nTheorem 2. It holds that\nmax\n||H||2≤1Cgen(H) = max\np\np\n2 f(p).\n(14)\nProof. Deﬁning the Hermitian matrix\nM = i[ρ, log2 ∆(ρ)],\n(15)\n3\nthe derivative of the relative entropy of coherence at time zero\ncan be written as\ndCr(ρt)\ndt\n\f\f\f\f\ft=0\n= Tr(HM).\n(16)\nWe can now perform the maximization over all Hamiltonians\nH with the property ||H||2 ≤ 1. For this, we use Hölder’s\ninequality, arriving at\ndCr(ρt)\ndt\n\f\f\f\f\ft=0\n= Tr(HM) ≤ ||H||2||M||2.\n(17)\nFor a given M, this inequality is saturated if H is chosen as\nH =\nM\n||M||2\n.\n(18)\nMaximizing over all Hamiltonians with bounded Hilbert-\nSchmidt norm, we obtain\nmax\n||H||2≤1\ndCr(ρt)\ndt\n\f\f\f\f\ft=0\n= Tr[M2]\n||M||2\n= ||M||2 =\n\r\r\r[ρ, log2 ∆(ρ)]\n\r\r\r2 .\n(19)\nTo complete the proof of the theorem, it remains to maxi-\nmize\n\r\r\r[ρ, log2 ∆(ρ)]\n\r\r\r2 over all states ρ. Denoting with ρi j the\nelements of ρ, we obtain\n[ρ, log2 ∆(ρ)] = ρ log2 ∆(ρ) − \u0002log2 ∆(ρ)\u0003 ρ\n(20)\n=\nX\ni, j\n\u0010\nρi j log2 ρ j j − ρi j log2 ρii\n\u0011\n|i⟩⟨j|\n=\nX\ni, j\nρi j\n\u0010\nlog2 ρ j j − log2 ρii\n\u0011\n|i⟩⟨j| .\nWith this, we obtain the following:\n\r\r\r[ρ, log2 ∆(ρ)]\n\r\r\r2\n2 =\nX\ni, j\n|ρi j|2 \u0010\nlog2 ρ j j − log2 ρii\n\u00112 .\n(21)\nSince ρ is a quantum state, it holds that\nρiiρ j j ≥ |ρi j|2,\n(22)\nwhich implies the inequality\n\r\r\r[ρ, log2 ∆(ρ)]\n\r\r\r2\n2 ≤\nX\ni, j\nρiiρ j j\n\u0010\nlog2 ρ j j − log2 ρii\n\u00112 .\n(23)\nLet us now deﬁne the function\nf(ρ) = 1\n2\nX\ni, j\nρiiρ j j\n\u0010\nlog2 ρ j j − log2 ρii\n\u00112 .\n(24)\nNote that the right-hand side of Eq. (23) corresponds to 2 f(ρ).\nAs we prove in the Appendix, f(ρ) can also be written as\nf(ρ) =\nX\ni\nρii\n\u0000− log2 ρii\n\u00012 −\n\nX\ni\nρii\n\u0000− log2 ρii\n\u0001\n\n2\n.\n(25)\nNote that this function coincides with the variance of the sur-\nprisal function deﬁned in Eq. (13), if we choose pi = ρii.\nConsider now a pure state of the form\n|ψ⟩ =\nd−1\nX\ni=0\n√qi |i⟩ ,\n(26)\nwhere the probabilities qi are chosen such that the variance of\nthe surprisal is maximal. Consider now the density matrix σ =\n|ψ⟩⟨ψ|. Due to the arguments presented above, it is clear that σ\nmaximizes the function f, i.e., f(σ) = maxρ f(ρ). Moreover,\nthe matrix elements of σ fulﬁll σiiσj j = |σi j|2, which implies\n2 f(σ) =\nX\ni, j\nσiiσj j\n\u0010\nlog2 σj j − log2 σii\n\u00112\n(27)\n=\nX\ni, j\n|σi j|2 \u0010\nlog2 σj j − log2 σii\n\u00112\n=\n\r\r\r[σ, log2 ∆(σ)]\n\r\r\r2\n2 .\nCollecting the arguments presented above, we have\nmax\nρ\n\r\r\r[ρ, log2 ∆(ρ)]\n\r\r\r2\n2 ≤ max\nρ\n2 f(ρ) = 2 f(σ)\n(28)\n=\n\r\r\r[σ, log2 ∆(σ)]\n\r\r\r2\n2\n≤ max\nρ\n\r\r\r[ρ, log2 ∆(ρ)]\n\r\r\r2\n2 .\nThis proves that\nmax\nρ\n\r\r\r[ρ, log2 ∆(ρ)]\n\r\r\r2\n2 = 2 f(σ),\n(29)\nand the proof of the theorem is complete.\n□\nAn optimal initial state for coherence generation can be\ngiven as follows:\n|ψ⟩ = √γ |0⟩ +\nr\n1 − γ\nd − 1\nd−1\nX\ni=1\n|i⟩ ,\n(30)\nwhere γ ∈ (0, 1) is chosen such that the probability distri-\nbution (γ, 1−γ\nd−1, . . ., 1−γ\nd−1) maximizes the variance of the sur-\nprisal [24, 25]. Following the arguments from the proof of\nTheorem 2, an optimal Hamiltonian is given by Eq. (18) with\nM = i[ψ, log2 ∆(ψ)] = i\nX\nk,l\nψkl\n\u0000log2 ψll − log2 ψkk\n\u0001 |k⟩⟨l|\n= i √γ\nr\n1 − γ\nd − 1\n \nlog2\n1 − γ\nd − 1 − log2 γ\n! d−1\nX\nl=1\n|0⟩⟨l|\n+ i √γ\nr\n1 − γ\nd − 1\n \nlog2 γ − log2\n1 − γ\nd − 1\n! d−1\nX\nk=1\n|k⟩⟨0|\n= iα (|0⟩⟨φ| − |φ⟩⟨0|)\n(31)\nwith a state |φ⟩ = Pd−1\ni=1 |i⟩ /\n√\nd − 1 and some α ∈ R. An\noptimal Hamiltonian can thus be chosen as\nH =\ni√\n2\n(|0⟩⟨φ| − |φ⟩⟨0|) .\n(32)\n4\nWe will now focus explicitly on the single-qubit case. In\nthis case, we will evaluate Cgen(H) for any Hamiltonian H.\nIn the following, we denote the elements of the density matrix\nwith ρkl, and similarly Hkl are elements of H. Moreover, ρ01 =\n|ρ01|eiα and similarly H01 = |H01|eiβ. Using Eq. (20) we obtain\niTr \u0000H[ρ, log2 ∆(ρ)]\u0001 = i\nX\nk,l\nHlkρkl\n\u0000log2 ρll − log2 ρkk\n\u0001 (33)\n= i \u0002H10ρ01\n\u0000log2 ρ11 − log2 ρ00\n\u0001\u0003\n+ i \u0002H01ρ10\n\u0000log2 ρ00 − log2 ρ11\n\u0001\u0003\n= i \u0002H10ρ01 − H01ρ10\n\u0003 log2\nρ11\nρ00\n= i |H10| |ρ01|\nh\nei(α−β) − e−i(α−β)i\nlog2\nρ11\nρ00\n= −2 |H10| |ρ01| sin(α − β) log2\nρ11\nρ00\n.\nOur goal now is to maximize this expression over all α, |ρ01|,\nρ00, and ρ11, taking into account that ρ is a density matrix\nof a single qubit. Maximizing over α is straightforward, an\noptimal choice is α = β − π/2. We thus arrive at\nCgen(H) = max\nρi j 2 |H10| |ρ01| log2\nρ11\nρ00\n.\n(34)\nFor any qubit density matrix it holds that |ρ01| ≤ √ρ00ρ11 with\nequality on pure states. With this we can perform the maxi-\nmization over |ρ01|, leading to\nCgen(H) = max\nρi j 2 |H10| √ρ00ρ11 log2\nρ11\nρ00\n.\n(35)\nThis also means that an optimal state can be chosen to be pure.\nIn the last step we recall that ρ11 = 1 − ρ00, such that\nCgen(H) = max\nρ00 2 |H10|\np\nρ00(1 − ρ00) log2\n1 − ρ00\nρ00\n.\n(36)\nThis maximization can be performed numerically, leading to\nρ00 ≈ 0.083.\nWe note that analogous results have been previously re-\nported in entanglement theory. In particular, optimal entan-\nglement generation for two-qubit Hamiltonians has been con-\nsidered in [23], and optimal states for entanglement genera-\ntion without ancillas have been derived. Optimal entangle-\nment generation with Hamiltonians of bounded operator norm\nhave been investigated in [24].\nIII.\nCONCLUSIONS\nIn conclusion, our investigation oﬀers an in-depth explo-\nration of the coherence generating capacity inherent to Hamil-\ntonians, showcasing a methodology that enables the assess-\nment of the maximum coherence derivative achievable in\nquantum systems of any dimension, governed by Hamiltoni-\nans with bounded Hilbert-Schmidt norms. Speciﬁcally, for\nqubit systems, we have achieved a comprehensive resolution\nof this problem for any Hamiltonian, identifying states that\nmaximize the rate of change in the relative entropy of coher-\nence.\nThis inquiry opens the door to several compelling questions\nfor future research. A primary area of interest is the extent of\ncoherence enhancement attainable through speciﬁc Hamilto-\nnians in systems of dimensions greater than those of qubits.\nAlthough our approach provides a novel way to frame this\nquestion, the feasibility of solving this maximization prob-\nlem analytically, or possibly through semideﬁnite program-\nming, remains to be determined. Additionally, the potential\napplicability of our techniques to other quantum resource the-\nories, especially the resource theory of entanglement, poses\nan intriguing prospect. Considering the parallels between the\nresource theories of coherence and entanglement, there is a\npromising possibility that our strategies could uncover opti-\nmal methods for increasing entanglement in a system using\ncertain Hamiltonian classes.\nACKNOWLEDGEMENTS\nWe thank Marek Miller for discussion.\nThis work was\nsupported by the “Quantum Coherence and Entanglement for\nQuantum Technology” project, carried out within the First\nTeam programme of the Foundation for Polish Science co-\nﬁnanced by the European Union under the European Regional\nDevelopment Fund, and the National Science Centre Poland\n(Grant No. 2022/46/E/ST2/00115).\n[1] E. Chitambar and G. Gour, Quantum resource theories,\nRev. Mod. Phys. 91, 025001 (2019).\n[2] R. Horodecki, P. Horodecki, M. Horodecki, and K. Horodecki,\nQuantum entanglement, Rev. Mod. Phys. 81, 865 (2009).\n[3] A.\nStreltsov,\nG.\nAdesso,\nand\nM.\nB.\nPlenio,\nCol-\nloquium:\nQuantum\ncoherence\nas\na\nresource,\nRev. Mod. Phys. 89, 041003 (2017).\n[4] K.-D. Wu, A. Streltsov, B. Regula, G.-Y. Xiang, C.-F.\nLi, and G.-C. Guo, Experimental Progress on Quantum\nCoherence:\nDetection, Quantiﬁcation,\nand Manipulation,\nAdvanced Quantum Technologies 4, 2100040 (2021).\n[5] M.\nHorodecki\nand\nJ.\nOppenheim,\nFundamental\nlim-\nitations\nfor\nquantum\nand\nnanoscale\nthermodynamics,\nNature Communications 4, 2059 (2013).\n[6] N. H. Y. Ng and M. P. Woods, Resource Theory of Quantum\nThermodynamics: Thermal Operations and Second Laws, in\nThermodynamics in the Quantum Regime: Fundamental Aspects and New Di\nedited by F. Binder, L. A. Correa, C. Gogolin, J. Anders, and\nG. Adesso (Springer International Publishing, Cham, 2018) pp.\n625–650.\n[7] T. Baumgratz, M. Cramer, and M. B. Plenio, Quantifying Co-\nherence, Phys. Rev. Lett. 113, 140401 (2014).\n[8] C. H. Bennett, D. P. DiVincenzo, J. A. Smolin, and W. K. Woot-\nters, Mixed-state entanglement and quantum error correction,\nPhys. Rev. A 54, 3824 (1996).\n5\n[9] A. Winter and D. Yang, Operational Resource Theory of Co-\nherence, Phys. Rev. Lett. 116, 120404 (2016).\n[10] J.\nAberg,\nQuantifying\nSuperposition,\narXiv:quant-ph/0612146 (2006).\n[11] B. Yadin,\nJ. Ma,\nD.\nGirolami,\nM. Gu,\nand V.\nVe-\ndral, Quantum Processes Which Do Not Use Coherence,\nPhys. Rev. X 6, 041028 (2016).\n[12] E. Chitambar and G. Gour, Critical Examination of Incoher-\nent Operations and a Physically Consistent Resource Theory of\nQuantum Coherence, Phys. Rev. Lett. 117, 030401 (2016).\n[13] G. Gour and R. W. Spekkens, The resource theory of\nquantum reference frames:\nmanipulations and monotones,\nNew Journal of Physics 10, 033023 (2008).\n[14] J. I. de Vicente and A. Streltsov, Genuine quantum coherence,\nJ. Phys. A 50, 045301 (2016).\n[15] V. Vedral, M. B. Plenio, M. A. Rippin, and P. L. Knight, Quan-\ntifying Entanglement, Phys. Rev. Lett. 78, 2275 (1997).\n[16] A. Streltsov,\nU. Singh,\nH. S. Dhar,\nM. N. Bera, and\nG. Adesso, Measuring Quantum Coherence with Entanglement,\nPhys. Rev. Lett. 115, 020403 (2015).\n[17] X.-D. Yu,\nD.-J. Zhang,\nG. F. Xu, and D. M. Tong,\nAlternative\nframework\nfor\nquantifying\ncoherence,\nPhys. Rev. A 94, 060302 (2016).\n[18] Y.\nPeng,\nY.\nJiang,\nand\nH.\nFan,\nMaximally\nco-\nherent\nstates\nand\ncoherence-preserving\noperations,\nPhys. Rev. A 93, 032326 (2016).\n[19] X.\nYuan,\nH.\nZhou,\nZ.\nCao,\nand\nX.\nMa,\nIntrinsic\nrandomness\nas\na\nmeasure\nof\nquantum\ncoherence,\nPhys. Rev. A 92, 022124 (2015).\n[20] A. Mani and V. Karimipour, Cohering and decohering power of\nquantum channels, Phys. Rev. A 92, 032331 (2015).\n[21] M. G. Díaz, K. Fang, X. Wang, M. Rosati, M. Skotiniotis,\nJ. Calsamiglia, and A. Winter, Using and reusing coherence to\nrealize quantum processes, Quantum 2, 100 (2018).\n[22] M.\nTakahashi,\nS.\nRana,\nand\nA.\nStreltsov,\nCreating\nand\ndestroying\ncoherence\nwith\nquantum\nchannels,\nPhys. Rev. A 105, L060401 (2022).\n[23] W. Dür, G. Vidal, J. I. Cirac, N. Linden, and S. Popescu,\nEntanglement\nCapabilities\nof\nNonlocal\nHamiltonians,\nPhys. Rev. Lett. 87, 137901 (2001).\n[24] S. Bravyi, Upper bounds on entangling rates of bipartite hamil-\ntonians, Phys. Rev. A 76, 052319 (2007).\n[25] D.\nReeb\nand\nM.\nM.\nWolf,\nTight\nBound\non\nRelative\nEntropy\nby\nEntropy\nDiﬀerence,\nIEEE Transactions on Information Theory 61, 1458 (2015).\n6\nAppendix A: Proof of Eq. (5)\nHere we will prove that the time derivative of the von Neumann entropy can be written as\nd\ndtS (ρt) = −Tr \u0002˙ρt log2 ρt\n\u0003 .\n(A1)\nFirst, we decompose the density matrix ρt in its eigenbasis ρt = P\ni λi |ψi⟩⟨ψi|, where λi and |ψi⟩ are time-dependent eigenvalues\nand eigenstates, respectively. It follows that:\nd\ndt\n\u0000ρt log2 ρt\n\u0001 =\nX\ni\nd\ndt\n \nλi\nln λi\nln 2\n!\n|ψi⟩⟨ψi| +\nX\ni\n\u0000λi log2 λi\n\u0001 d\ndt |ψi⟩⟨ψi|\n(A2)\n=\nX\ni\n \n˙λi\nln λi\nln 2 +\n˙λi\nln 2\n!\n|ψi⟩⟨ψi| +\nX\ni\n\u0000λi log2 λi\n\u0001 h ˙\n|ψi⟩⟨ψi| + |ψi⟩ ˙\n⟨ψi|\ni\n.\nThis means that the derivative of the von Neumann entropy can be written as\nd\ndtS (ρt) = −Tr\n\" d\ndt\n\u0000ρt log2 ρt\n\u0001#\n= −\nX\ni\n \n˙λi\nln λi\nln 2 +\n˙λi\nln 2\n!\n,\n(A3)\nwhere we have used the fact that\nTr\nh ˙\n|ψi⟩⟨ψi| + |ψi⟩ ˙\n⟨ψi|\ni\n= Tr\n\" d\ndt (|ψi⟩⟨ψi|)\n#\n= d\ndtTr \u0002|ψi⟩⟨ψi|\u0003 = 0.\n(A4)\nNoting that P\ni ˙λi = d\ndt\nP\ni λi = 0, we obtain\nd\ndtS (ρt) = −\nX\ni\n˙λi log2 λi.\n(A5)\nIn the next step, we write ˙ρ log2 ρ as follows:\n˙ρ log2 ρ =\nX\ni, j\n \n˙λi |ψi⟩⟨ψi| + λi\nd\ndt |ψi⟩⟨ψi|\n!\nlog2 λ j |ψ j⟩⟨ψ j| ,\n(A6)\nwhich implies\nTr \u0002˙ρ log2 ρ\u0003 =\nX\ni, j\n \n˙λi log2 λ jTr\nh\n|ψi⟩⟨ψi|ψ j⟩⟨ψ j|\ni\n+ λi log2 λ jTr\n\" d\ndt (|ψi⟩⟨ψi|) |ψ j⟩⟨ψ j|\n#!\n(A7)\n=\nX\ni\n˙λi log2 λi +\nX\ni, j\nλi log2 λ jTr\nh\u0010 ˙\n|ψi⟩⟨ψi| + |ψi⟩ ˙\n⟨ψi|\n\u0011\n|ψ j⟩⟨ψ j|\ni\n=\nX\ni\n˙λi log2 λi +\nX\ni\nλi log2 λi\n\u0010\n⟨ψi| ˙ψi⟩ + ⟨ ˙ψi|ψi⟩\n\u0011\n=\nX\ni\n˙λi log2 λi.\nThis completes the proof.\nAppendix B: Proof of Eq. (9)\nLet A be a Hermitian matrix, and B be a positive matrix. It holds that\nTr \u0002A log2 ∆(B)\u0003 = Tr\nA log2\n\nX\ni\n|i⟩⟨i| B |i⟩⟨i|\n\n =\nX\ni\nTr \u0002A log2 (|i⟩⟨i| B |i⟩⟨i|)\u0003\n=\nX\ni, j\nTr \u0002A |j⟩⟨j| log2 (|i⟩⟨i| B |i⟩⟨i|) |j⟩⟨j|\u0003\n=\nX\ni, j\nTr \u0002|j⟩⟨j| A |j⟩⟨j| log2 (|i⟩⟨i| B |i⟩⟨i|)\u0003\n= Tr\n\nX\nj\n|j⟩⟨j| A |j⟩⟨j| log2\n\nX\ni\n|i⟩⟨i| B |i⟩⟨i|\n\n\n= Tr \u0002∆(A) log2 ∆(B)\u0003.\n(B1)\n7\nAppendix C: Proof of Eq. (25)\nHere we will show that the function\nf(ρ) = 1\n2\nX\ni, j\nρiiρ j j\n\u0010\nlog2 ρ j j − log2 ρii\n\u00112\n(C1)\ncan also be written as\nf(ρ) =\nX\ni\nρii\n\u0000− log2 ρii\n\u00012 −\n\nX\ni\nρii\n\u0000− log2 ρii\n\u0001\n\n2\n.\n(C2)\nThis follows directly from the following equalities:\nX\ni\nρii\n\u0000− log2 ρii\n\u00012 −\n\nX\ni\nρii\n\u0000− log2 ρii\n\u0001\n\n2\n=\nX\ni\nρii\n\u0000log2 ρii\n\u00012 −\nX\ni\nρ2\nii\n\u0000log2 ρii\n\u00012 −\nX\ni, j\nρiiρ j j log2 ρii log2 ρ j j\n(C3)\n=\nX\ni\nρii (1 − ρii) \u0000log2 ρii\n\u00012 −\nX\ni, j\nρiiρ j j log2 ρii log2 ρ j j\n=\nX\ni\nρii\n\nX\nj,i\nρ j j\n\n\u0000log2 ρii\n\u00012 −\nX\ni, j\nρiiρ j j log2 ρii log2 ρ j j\n=\nX\ni, j\nρiiρ j j\n\u0000log2 ρii\n\u00012 −\nX\ni, j\nρiiρ j j log2 ρii log2 ρ j j\n= 1\n2\nX\ni, j\nρiiρ j j\n\u0000log2 ρii\n\u00012 + 1\n2\nX\ni, j\nρiiρ j j\n\u0010\nlog2 ρ j j\n\u00112 −\nX\ni, j\nρiiρ j j log2 ρii log2 ρ j j\n= 1\n2\nX\ni, j\nρiiρ j j\n\u0014\u0000log2 ρii\n\u00012 +\n\u0010\nlog2 ρ j j\n\u00112 − 2 log2 ρii log2 ρ j j\n\u0015\n= 1\n2\nX\ni, j\nρiiρ j j\n\u0000log2 ρii − log2 ρii\n\u00012 = 1\n2\nX\ni, j\nρiiρ j j\n\u0000log2 ρii − log2 ρii\n\u00012 .\nHere, we have used the fact that P\nj,i ρ j j = 1 − ρii.\n"
}